[{"Category": "Brain Teasers", "Riddle": "You live in a one story house made entirely of redwood. What color would the stairs be?", "_type": "dict", "Heading": "What Color?", "Answer": "What stairs? You live in a one-story house.", "id": 237}, {"Category": "Brain Teasers", "Riddle": "A boy was at a carnival and went to a booth where a man said to the boy, \"If I write your exact weight on this piece of paper then you have to give me $50, but if I cannot, I will pay you $50.\" The boy looked around and saw no scale so he agrees, thinking no matter what the carny writes he'll just say he weighs more or less. In the end the boy ended up paying the man $50. How did the man win the bet?", "_type": "dict", "Heading": "Carnival Trick", "Answer": "The man did exactly as he said he would and wrote \"your exact weight\" on the paper.", "id": 238}, {"Category": "Brain Teasers", "Riddle": "Mr. and Mrs. Mustard have six daughters and each daughter has one brother. How many people are in the Mustard family?", "_type": "dict", "Heading": "The Mustard Family", "Answer": "There are nine Mustards in the family. Since each daughter shares the same brother, there are six girls, one boy and Mr. and Mrs. Mustard.", "id": 239}, {"Category": "Brain Teasers", "Riddle": "What has six faces, but does not wear makeup, has twenty-one eyes, but cannot see? What is it?", "_type": "dict", "Heading": "Six Faces", "Answer": "A die (dice).", "id": 240}, {"Category": "Brain Teasers", "Riddle": "A woman shoots her husband. Then she holds him underwater for over 5 minutes. Finally, she hangs him. But 5 minutes later they both go out together and enjoy a wonderful dinner together. How can this be?", "_type": "dict", "Heading": "Killer Wife, Or Not?", "Answer": "The woman was a photographer. She shot a picture of her husband, developed it, and hung it up to dry.", "id": 241}, {"Category": "Brain Teasers", "Riddle": "How do you make the number 7 even without addition, subtraction, multiplication, or division?", "_type": "dict", "Heading": "Even Seven", "Answer": "Drop the \"S\".", "id": 242}, {"Category": "Brain Teasers", "Riddle": "There are 20 people in an empty, square room. Each person has full sight of the entire room and everyone in it without turning his head or body, or moving in any way (other than the eyes). Where can you place an apple so that all but one person can see it?", "_type": "dict", "Heading": "Invisible Apple", "Answer": "Place the apple on one person's head.", "id": 243}, {"Category": "Brain Teasers", "Riddle": "Always in you, Sometimes on you; \n\r\n\nIf I surround you, I can kill you. \n\r\n\nWhat am I?", "_type": "dict", "Heading": "I Can Kill You", "Answer": "Water.", "id": 244}, {"Category": "Brain Teasers", "Riddle": "How can you take 2 from 5 and leave 4?", "_type": "dict", "Heading": "Strange Subtraction", "Answer": "F  I V  E\n\r\n\nRemove the 2 letters F and E from five and you have IV.", "id": 245}, {"Category": "Brain Teasers", "Riddle": "I am a word of six; my first three letters refer to an automobile; my last three letters refer to a household animal; my first four letters is a fish; my whole is found in your room. What am I?", "_type": "dict", "Heading": "Room Riddles", "Answer": "A carpet.", "id": 246}, {"Category": "Brain Teasers", "Riddle": "I have a little house in which I live all alone. It has no doors or windows, and if I want to go out I must break through the wall. What am I?", "_type": "dict", "Heading": "Lonely House", "Answer": "A chick in an egg.", "id": 247}, {"Category": "Brain Teasers", "Riddle": "Romeo and Juliet are found dead on the floor in a bedroom. When they were discovered, there were pieces of glass and some water on the floor. The only furniture in the room is a shelf and a bed. The house is in a remote location, away from everything except for the nearby railroad track. What caused the death of Romeo and Juliet?", "_type": "dict", "Heading": "The Death Of Romeo And Juliet", "Answer": "Romeo and Juliet are fish. The rumble of the train knocked the tank off the shelf, it broke and Romeo and Juliet did not survive.", "id": 248}, {"Category": "Brain Teasers", "Riddle": "When can you add two to eleven and get one as the correct answer?", "_type": "dict", "Heading": "Number Cycle", "Answer": "When you add two hours to eleven o'clock, you get one o'clock.", "id": 249}, {"Category": "Brain Teasers", "Riddle": "A time when they are green, a time when they're brown, but both of these times, cause me to frown. But just in between, for a very short while, They're perfect and yellow and cause me to smile!\n\r\n\nWhat am I talking about here?", "_type": "dict", "Heading": "A Time When They Are Green,", "Answer": "Bananas.", "id": 250}, {"Category": "Brain Teasers", "Riddle": "A pregnant lady named her children: Dominique, Regis, Michelle, Fawn, Sophie and Lara. What will she name her next child? Jessica, Katie, Abby or Tilly?", "_type": "dict", "Heading": "Next Name Brain Teaser", "Answer": "Tilly. She seems to follow the scale Do, Re, Me, Fa, So, La, and then Ti.", "id": 251}, {"Category": "Brain Teasers", "Riddle": "I'm not clothes but I cover your body;\n\r\n\nThe more I'm used, the thinner I grow.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "I Cover Your Body", "Answer": "Bar of soap.", "id": 252}, {"Category": "Brain Teasers", "Riddle": "Sometimes I am born in silence, Other times, no. I am unseen, But I make my presence known. In time, I fade without a trace. I harm no one, but I am unpopular with all. What am I?", "_type": "dict", "Heading": "Now And Later Riddle", "Answer": "A fart.", "id": 253}, {"Category": "Brain Teasers", "Riddle": "A man was found dead next to a 13 story building. The police say it was a suicide, but you say it was a homicide (someone killed him). To prove this, you go to each floor on the building, open the window, and toss a penny out. You do this to each floor until you reach the 13th floor, open the window, and toss a penny out. How does this prove it wasn't a suicide?", "_type": "dict", "Heading": "Building Riddle", "Answer": "If the man committed suicide, he would've left the window open and you wouldn't have had to open it.", "id": 254}, {"Category": "Brain Teasers", "Riddle": "Three playing cards in a row. Can you name them with these clues? There is a two to the right of a king. A diamond will be found to the left of a spade. An ace is to the left of a heart. A heart is to the left of a spade. Now, identify all three cards.", "_type": "dict", "Heading": "Playing Cards", "Answer": "Ace of Diamonds, King of Hearts, Two of Spades.", "id": 255}, {"Category": "Brain Teasers", "Riddle": "Five apples are in a basket. How do you divide them among five girls so that each girl gets an apple, but one apple remains in the basket?", "_type": "dict", "Heading": "Five Apples", "Answer": "Give the fifth girl her apple in the basket.", "id": 256}, {"Category": "Brain Teasers", "Riddle": "When will water stop running downhill?", "_type": "dict", "Heading": "Running Water", "Answer": "When it reaches the bottom.", "id": 257}, {"Category": "Brain Teasers", "Riddle": "If there are four sheep, two dogs and one herds-men, how many feet are there?", "_type": "dict", "Heading": "How Many Feet Brain Teaser", "Answer": "Two. Sheep have hooves; dogs have paws; only people have feet.", "id": 258}, {"Category": "Brain Teasers", "Riddle": "What can you hold in your right hand, but not in your left?", "_type": "dict", "Heading": "Tricky Hands", "Answer": "Your left hand!", "id": 259}, {"Category": "Brain Teasers", "Riddle": "Tom and his younger sister were fighting. Their mother was tired of the fighting and decided to punish them by making them stand on the same piece of newspaper in such a way that they couldn't touch each other. How did she accomplish this?", "_type": "dict", "Heading": "Newspaper Divider", "Answer": "Tom's mother slid a newspaper under a door, each sibling standing on each side.", "id": 260}, {"Category": "Brain Teasers", "Riddle": "Which of the following words don't belong in the group and why? CORSET, COSTER, SECTOR, ESCORT, COURTS", "_type": "dict", "Heading": "Don't Belong", "Answer": "Courts. All of the others are anagrams of each other.", "id": 261}, {"Category": "Brain Teasers", "Riddle": "There are 2 ducks in front of 2 other ducks. There are 2 ducks behind 2 other ducks. There are 2 ducks beside 2 other ducks. How many ducks are there?", "_type": "dict", "Heading": "Hiding Ducks", "Answer": "Just four, in a square formation.", "id": 262}, {"Category": "Brain Teasers", "Riddle": "You have 5 kids and you have to get them all into a car. Tommy and Timmy are twins but they fight so they can't sit together. Sarah and Sally fight too, so they can't sit together. Max fights with his sisters so he can only sit by his brothers. There's 5 seats side by side and you have to put them in order. How would you seat the kids, so that everyone is happy?", "_type": "dict", "Heading": "Car Ride!", "Answer": "Sarah, Tommy, Max, Timmy, and then Sally.", "id": 263}, {"Category": "Brain Teasers", "Riddle": "I am strong enough to smash ships, but I fear the Sun. What am I?", "_type": "dict", "Heading": "Strong Enough But.... What Am I?", "Answer": "Ice.", "id": 264}, {"Category": "Brain Teasers", "Riddle": "I always follow you around, everywhere you go at night. I look very bright to people, but I can make the sun dark. I can be in many different forms and shapes. What am I?", "_type": "dict", "Heading": "A \"What Am I?\" Question", "Answer": "The moon!", "id": 265}, {"Category": "Brain Teasers", "Riddle": "Can a man legally marry his widow's sister in the state of California?", "_type": "dict", "Heading": "Legal Marriage", "Answer": "NO since she is a 'widow', the guy's dead!", "id": 266}, {"Category": "Brain Teasers", "Riddle": "A cloud was my mother, the wind is my father, my son is the cool stream, and my daughter is the fruit of the land. A rainbow is my bed, the earth my final resting place, and I'm the torment of man. Who Am I?", "_type": "dict", "Heading": "Natural Family", "Answer": "Rain.", "id": 267}, {"Category": "Brain Teasers", "Riddle": "If 5 cats catch 5 mice in 5 minutes, how long will it take one cat to catch a mouse?", "_type": "dict", "Heading": "5 Cats", "Answer": "Five minutes.", "id": 268}, {"Category": "Brain Teasers", "Riddle": "A farmer in California owns a beautiful pear tree. He supplies the fruit to a nearby grocery store. The store owner has called the farmer to see how much fruit is available for him to purchase. The farmer knows that the main trunk has 24 branches. Each branch has exactly 12 boughs and each bough has exactly 6 twigs. Since each twig bears one piece of fruit, how many plums will the farmer be able to deliver?", "_type": "dict", "Heading": "How Many Plums?", "Answer": "None. A pear tree does not bear plums.", "id": 269}, {"Category": "Brain Teasers", "Riddle": "The rungs of a 10 foot ladder attached to a ship are 1 foot apart. If the water is rising at the rate of one foot an hour, how long will it take until the water covers over the ladder?", "_type": "dict", "Heading": "Rungs Of A Ladder", "Answer": "It will never cover the ladder because as the water rises, so will the floating ship.", "id": 270}, {"Category": "Brain Teasers", "Riddle": "There is a clothing store in Bartlesville. The owner has devised his own method of pricing items. A vest costs $20, socks cost $25, a tie costs $15 and a blouse costs $30. Using the method, how much would a pair of underwear cost?", "_type": "dict", "Heading": "By Letter By Number Logic Puzzle", "Answer": "$45. The pricing method consists of charging $5 for each letter required to spell the item.", "id": 271}, {"Category": "Brain Teasers", "Riddle": "One is to three as three is to five and five is to four and four is the magic number.\n\r\n\nWhat is the pattern?", "_type": "dict", "Heading": "The Pattern?", "Answer": "One has three letters in the word three has five letters in it five has four letters and four has four letters in it (if you try more numbers they will always come back to the number four: so four is the magic number)", "id": 272}, {"Category": "Brain Teasers", "Riddle": "If the day before yesterday is the 23rd, then what is the day after tomorrow?", "_type": "dict", "Heading": "After Tomorrow", "Answer": "The 27th.", "id": 273}, {"Category": "Brain Teasers", "Riddle": "A man was just doing his job when his suit was torn. Why did he die three minutes later?", "_type": "dict", "Heading": "Just Doing His Job", "Answer": "He was an astronaut on a space walk, doing repairs.", "id": 274}, {"Category": "Brain Teasers", "Riddle": "When may a man's coat pocket be empty, and yet have something in it?", "_type": "dict", "Heading": "Empty Pocket", "Answer": "When it has a hole in it.", "id": 275}, {"Category": "Brain Teasers", "Riddle": "I am the beginning of sorrow, and the end of sickness. You cannot express happiness without me, yet I am in the midst of crosses. I am always in risk, yet never in danger. You may find me in the sun, but I am never out of darkness. What am I?", "_type": "dict", "Heading": "Happiness!", "Answer": "The letter S.", "id": 276}, {"Category": "Brain Teasers", "Riddle": "What common English verb becomes its own past tense by rearranging its letters?", "_type": "dict", "Heading": "Recycling Letters", "Answer": "Eat and Ate.", "id": 277}, {"Category": "Brain Teasers", "Riddle": "A little pool with two layers of wall around it. One white and soft and the other dark and hard, amidst a light brown grassy lawn with an outline of a green grass. What am I?", "_type": "dict", "Heading": "Delicious Riddle", "Answer": "A Coconut.", "id": 278}, {"Category": "Brain Teasers", "Riddle": "If your uncle's sister is not your aunt, what relation is she to you?", "_type": "dict", "Heading": "Uncle's Sister", "Answer": "Your mother.", "id": 279}, {"Category": "Brain Teasers", "Riddle": "If a chicken says, \"All chickens are liars\". Is the chicken telling the truth?", "_type": "dict", "Heading": "Xcvbnm", "Answer": "Answer: Chickens cannot talk.", "id": 280}, {"Category": "Brain Teasers", "Riddle": "What day would yesterday be if Thursday was four days before the day after tommorow?", "_type": "dict", "Heading": "What Day Is It?", "Answer": "Friday.", "id": 281}, {"Category": "Brain Teasers", "Riddle": "A group of campers have been on vacation so long, that they've forgotten the day of the week. The following conversation ensues.\n\r\n\nDarryl: What's the day? I don't think it is Thursday, Friday or Saturday.\n\r\n\nTracy: Well that doesn't narrow it down much. Yesterday was Sunday.\n\r\n\nMelissa: Yesterday wasn't Sunday, tomorrow is Sunday.\n\r\n\nBen: The day after tomorrow is Saturday.\n\r\n\nAdrienne: The day before yesterday was Thursday.\n\r\n\nSusie: Tomorrow is Saturday.\n\r\n\nDavid: I know that the day after tomorrow is not Friday.\n\r\n\nIf only one person's statement is true, what day of the week is it?", "_type": "dict", "Heading": "Tell Us The Day!", "Answer": "It is Wednesday. If it was any other day of the week, more than one statement would be true. To solve the riddle, evaluate each person's statement and write down what day it could be according to the statement. David's statement indicates it could be any day of the week except for Wednesday. When you list the days that it could be according to everyone's statement, it turns out Wednesday is the day mentioned only one time. Darryl: Sunday, Monday, Tuesday, or Wednesday Tracy: Monday Melissa: Saturday Ben: Thursday Adrienne: Saturday Susie: Friday David: Sunday, Monday, Tuesday, Thursday, Friday or Saturday", "id": 282}, {"Category": "Brain Teasers", "Riddle": "What relation would your father's sister's sister-in-law be to you?", "_type": "dict", "Heading": "Think Family", "Answer": "This person would be your mother.", "id": 283}, {"Category": "Brain Teasers", "Riddle": "How many of each type of animal did Moses take on the Ark?", "_type": "dict", "Heading": "Get Your Facts Straight!", "Answer": "None, it was Noah.", "id": 284}, {"Category": "Brain Teasers", "Riddle": "Which word is the odd one out: Seventy, Brawl, Clover, Proper, Carrot, Swing, Change, Travel, Sacred, Stone?", "_type": "dict", "Heading": "Which Word Does Not Belong?", "Answer": "Carrot. When the first and last letters are removed from the other words, they still spell another word.", "id": 285}, {"Category": "Brain Teasers", "Riddle": "A horse is tied to a five-meter rope in front of an old saloon. Six meters behind the horse is a bale of hay. Without breaking his rope, the horse is able to eat the hay whenever he chooses. \n\r\n\nHow is this possible?", "_type": "dict", "Heading": "Tied Up Horse", "Answer": "The rope is not tied to anything else.", "id": 286}, {"Category": "Brain Teasers", "Riddle": "I'm the part of the bird that's not in the sky. I can swim in the ocean and yet remain dry. What am I?", "_type": "dict", "Heading": "Part Of A Bird", "Answer": "A shadow.", "id": 287}, {"Category": "Brain Teasers", "Riddle": "I can be long, or I can be short. I can be grown, and I can be bought. I can be painted, or left bare. I can be round, or square. What am I?", "_type": "dict", "Heading": "Pretty Little Things", "Answer": "Your fingernails.", "id": 288}, {"Category": "Brain Teasers", "Riddle": "I run through hills; I veer around mountains. I leap over rivers and crawl through the forests. Step out your door to find me.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Step Out Your Door To Find Me", "Answer": "Roads.", "id": 289}, {"Category": "Brain Teasers", "Riddle": "You can see nothing else When you look in my face, I will look you in the eye and I will never lie. What am I?", "_type": "dict", "Heading": "I'm Always Here Riddle", "Answer": "I am your reflection.", "id": 290}, {"Category": "Brain Teasers", "Riddle": "Tomorrow Is Neither Wednesday Nor Thursday. Yesterday Was Not Friday Or Saturday. Today Is Not Thursday Nor Monday Nor Sunday. What Day Is Today?", "_type": "dict", "Heading": "What Day Is Today?", "Answer": "Friday.", "id": 291}, {"Category": "Brain Teasers", "Riddle": "I look at you, you look at me, I raise my right, you raise your left. What am I?", "_type": "dict", "Heading": "Stop Copying Me!", "Answer": "Your reflection in a mirror.", "id": 292}, {"Category": "Brain Teasers", "Riddle": "If life gets tough, what do you have that you can always count on?", "_type": "dict", "Heading": "Who Needs A Calculator!", "Answer": "Your fingers!", "id": 293}, {"Category": "Brain Teasers", "Riddle": "Joe is turning 17 this year, yet he turned 16 yesterday. How is this possible?", "_type": "dict", "Heading": "Joe's Birthday", "Answer": "Joe's birthday is on December 31, the last day of the year. The current day was January 1st of the next year.", "id": 294}, {"Category": "Brain Teasers", "Riddle": "If you have two coins which total 35 cents and one of the coins is not a dime, what are the two coins?", "_type": "dict", "Heading": "What Are The Two Coins?", "Answer": "A quarter and a dime. One coin is not a dime, but the other one is.", "id": 295}, {"Category": "Brain Teasers", "Riddle": "The 22nd and 24th presidents of the United States of America had the same parents, but were not brothers. How can this be possible?", "_type": "dict", "Heading": "Presidential Ties", "Answer": "They were the same man. Grover Cleveland served two terms as president of the United States, but the terms were not consecutive.", "id": 296}, {"Category": "Brain Teasers", "Riddle": "When asked how old she was, Suzie replied, \"In two years I will be twice as old as I was five years ago.\" How old is she?", "_type": "dict", "Heading": "Impossible Age", "Answer": "She's 12!", "id": 297}, {"Category": "Brain Teasers", "Riddle": "I am a path situated between high natural masses. Remove my first letter and you have a path situated between man-made masses.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Remove My First Letter", "Answer": "A Valley.", "id": 298}, {"Category": "Brain Teasers", "Riddle": "I am the ruler of shovels, I have a double. I am as thin as a knife, I have a wife. What am I?", "_type": "dict", "Heading": "Thin As A Knife", "Answer": "The King of Spades (from a deck of cards).", "id": 299}, {"Category": "Brain Teasers", "Riddle": "Which is correct to say, \"The yolk of the egg are white,\" or \"The yolk of the egg is white?\"", "_type": "dict", "Heading": "Egg Yolks", "Answer": "Neither, because egg yolks are yellow.", "id": 300}, {"Category": "Brain Teasers", "Riddle": "On Christmas eve, when Santa leaves his workshop on the north pole, what direction does he travel?", "_type": "dict", "Heading": "Santa's Sleigh", "Answer": "South.  If you're on the North Pole the only direction you can go is south.", "id": 301}, {"Category": "Brain Teasers", "Riddle": "I don't have eyes, but once I did see. Once I had thoughts, but now I'm white and empty. What am I?", "_type": "dict", "Heading": "Once I Had Thoughts", "Answer": "I am a skull.", "id": 302}, {"Category": "Brain Teasers", "Riddle": "How many bricks does it take to complete a brick building?", "_type": "dict", "Heading": "Brick Building", "Answer": "One brick.", "id": 303}, {"Category": "Brain Teasers", "Riddle": "If you're 8 feet away from a door and with each move you advance half the distance to the door. How many moves will it take to reach the door?", "_type": "dict", "Heading": "Advance Half The Distance?", "Answer": "Infinity! Technically you will never reach the door, as you can only move half the distance, no matter how small.", "id": 304}, {"Category": "Brain Teasers", "Riddle": "What can be stolen, mistaken, or altered, yet never leaves you your entire life?", "_type": "dict", "Heading": "It Never Leaves You", "Answer": "Your identity.", "id": 305}, {"Category": "Brain Teasers", "Riddle": "What can you find in the center of gravity?", "_type": "dict", "Heading": "Center Of Gravity", "Answer": "The letter \"V\"", "id": 306}, {"Category": "Brain Teasers", "Riddle": "Name an English word of more than 2 letters that both begins and ends with the letters \"he\" in that order, there are two possible answers. What is it?", "_type": "dict", "Heading": "Starts And Ends In \"he\"", "Answer": "Headache or Heartache.", "id": 307}, {"Category": "Brain Teasers", "Riddle": "What has to be broken before it can be used?", "_type": "dict", "Heading": "Has To Be Broken", "Answer": "An egg.", "id": 308}, {"Category": "Brain Teasers", "Riddle": "I am served at a table, In gatherings of two or four; Served small, white and round. You'll love some, And that's part of the fun. What am I?", "_type": "dict", "Heading": "Small, Round And White Challenge", "Answer": "Ping Pong Balls.", "id": 309}, {"Category": "Brain Teasers", "Riddle": "All the electricity was out in town and none of the street lights or traffic signals had power. A dark limousine was cruising down the newly paved blacktop, with its headlights off. A young boy dressed totally in black (with no reflectors) stepped out to cross the street. The moon wasn't out and the boy had no flashlight, yet the driver stopped to let the boy cross the street. How did the driver see the boy?", "_type": "dict", "Heading": "Boy In Black", "Answer": "The driver saw the boy because it was during the daylight hours.", "id": 310}, {"Category": "Brain Teasers", "Riddle": "I love to dance and twist and prance, I shake my tail, as away I sail, wingless I fly into the sky.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Wingless I Fly", "Answer": "A Kite.", "id": 311}, {"Category": "Brain Teasers", "Riddle": "Who can shave three times a day and still grow a beard?", "_type": "dict", "Heading": "Still Grow A Beard Mind Trick", "Answer": "A barber, He could shave other men three times a day and still grow his own beard.", "id": 312}, {"Category": "Brain Teasers", "Riddle": "If you put roast in a roaster, what do you put in toaster?", "_type": "dict", "Heading": "What Do You Put In A Toaster?", "Answer": "Bread.", "id": 313}, {"Category": "Brain Teasers", "Riddle": "You're sitting down for breakfast and realize you have 4 bagels left. You know you'll run out in four days so you cut them in half. How many bagels do you have now?", "_type": "dict", "Heading": "Bagels For Breakfast", "Answer": "4 Bagels.", "id": 314}, {"Category": "Brain Teasers", "Riddle": "What is red and blue, and purple and green? No one can reach it, not even the queen?", "_type": "dict", "Heading": "Far Off Color", "Answer": "A Rainbow.", "id": 315}, {"Category": "Brain Teasers", "Riddle": "A guy was waiting at home, he swung a metal pole then took 3 left turns and on his way back home there was a masked man waiting for him. What is he doing and who is the masked man?", "_type": "dict", "Heading": "3 Left Turns", "Answer": "He is playing baseball and the masked man is the Catcher.", "id": 324}, {"Category": "Brain Teasers", "Riddle": "We hurt without moving. We poison without touching. We bear the truth and the lies. We are not to be judged by our size. What are we?", "_type": "dict", "Heading": "Try Very Hard Before Looking At Answer.", "Answer": "Words.", "id": 325}, {"Category": "Brain Teasers", "Riddle": "On a fine sunny day a ship was in the harbor. All of a sudden the ship began to sink. There was no storm and nothing wrong with the ship yet it sank right in front of the spectators eyes. What caused the ship to sink?", "_type": "dict", "Heading": "Sinking Ship Mind Challenge", "Answer": "It was a Submarine.", "id": 326}, {"Category": "Brain Teasers", "Riddle": "You're in a magical bathroom with no windows and the only way things can get in and out is by an open door. You decide to have a bath so you turn on the tap, you shut the door and the handle breaks so you can't open it, you then turn off the tap and the knob breaks so water keeps coming. How do you save yourself from drowning?", "_type": "dict", "Heading": "Trapped!", "Answer": "Pull out the plug in the bath.", "id": 329}, {"Category": "Brain Teasers", "Riddle": "Two men are in a desert. They both have packs on. One of the guys is dead. The guy who is alive has his pack open, the guy who is dead has his pack closed. What is in the pack?", "_type": "dict", "Heading": "In His Pack", "Answer": "A parachute (that didn't open)", "id": 330}, {"Category": "Brain Teasers", "Riddle": "I am four letters long, I can be seen in the sky, I am the ocean & I am the sea. Can you guess me?", "_type": "dict", "Heading": "Sky And Ocean", "Answer": "The color Blue.", "id": 331}, {"Category": "Brain Teasers", "Riddle": "I am free yet priceless, you can't own me but you can use me, you can't keep me but you can spend me. Once you lost me you can never have me back. What am I?", "_type": "dict", "Heading": "Free Yet Priceless Riddle", "Answer": "Time.", "id": 332}, {"Category": "Brain Teasers", "Riddle": "A thousand colored folds stretch toward the sky, Atop a tender strand, Rising from the land, 'Til killed by maiden's hand, Perhaps a token of love, perhaps to say goodbye. What am I?", "_type": "dict", "Heading": "Token Of Love - What Am I?", "Answer": "A flower.", "id": 333}, {"Category": "Brain Teasers", "Riddle": "What is one thing that all wise men, regardless of their politics or religion, agree is between heaven and earth?", "_type": "dict", "Heading": "Between Heaven And Earth", "Answer": "The word 'And'.", "id": 334}, {"Category": "Brain Teasers", "Riddle": "I know a word of letters three. Add two, and fewer there will be. What is it?", "_type": "dict", "Heading": "Answer's Right In Front Of You Riddle", "Answer": "The word \"Few\".", "id": 335}, {"Category": "Brain Teasers", "Riddle": "If a wheel has 64 spokes, how many spaces are there between the spokes?", "_type": "dict", "Heading": "Inbetween The Spokes", "Answer": "64. The space that comes after the 64th spoke, would be just before the first spoke.", "id": 336}, {"Category": "Brain Teasers", "Riddle": "I'm always in charge, I'm never in debt. I'm known as the first amongst all my kind. I'm found within cars, But never in buses. I'm not used in Mexico, I'm used in Palestine.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Always In Charge", "Answer": "The letter 'a.'", "id": 337}, {"Category": "Brain Teasers", "Riddle": "I'm under your face,\n\r\n\nI'm outside your mind;\n\r\n\nA biological case,\n\r\n\nPressure brings pain sometimes.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Biological Case", "Answer": "Your skull.", "id": 338}, {"Category": "Brain Teasers", "Riddle": "What is in seasons, seconds, centuries and minutes but not in decades, years or days?", "_type": "dict", "Heading": "Not I", "Answer": "The letter ‘n’", "id": 339}, {"Category": "Brain Teasers", "Riddle": "A hole leading in, a hole leading out, we connect to a cavern that is slimy all throughout. \n\r\n\nWhat are we?", "_type": "dict", "Heading": "The Holes", "Answer": "A nose.", "id": 340}, {"Category": "Brain Teasers", "Riddle": "A cop was walking past a restaurant when he heard someone scream - \"No John, not the gun!\" He ran inside and and saw a doctor, a lawyer, a milkman, and a dead body on the floor. He promptly walked over to the milkman and arrested him. He didn't witness the shooting and there was no apparent evidence to prove who shot the person and no one told him who the killer was.\n\r\n\nHow did the policeman instantly know it was the milkman?", "_type": "dict", "Heading": "The Doctor,a Lawyer And A Milkman.", "Answer": "The milkman was the only male. The doctor and lawyer were females, so the cop knew that \"John\" was the milkman.", "id": 341}, {"Category": "Brain Teasers", "Riddle": "Sally has four classes, Science, Math, English Language Arts, and History. She had a test in every class, and wanted to have some fun, so she did all of her tests in French. When she received her tests back, only one teacher could understand her work. If none of Sally's teachers spoke French, which teacher was able to understand the test and how did they understand it?", "_type": "dict", "Heading": "Sally's French", "Answer": "The Math teacher, because numbers are the same in French as they are in English.", "id": 342}, {"Category": "Brain Teasers", "Riddle": "A word I know, six letters it contains. Subtract just one, and twelve is what remains. What is the word?", "_type": "dict", "Heading": "Subtract One", "Answer": "Dozens!", "id": 343}, {"Category": "Brain Teasers", "Riddle": "Name an eight letter word that has kst in the middle, in the beginning, and at the end.", "_type": "dict", "Heading": "Kst In The Middle", "Answer": "Inkstand - kst is in the middle. \"In\" is the beginning, and \"and\" ends the word.", "id": 344}, {"Category": "Brain Teasers", "Riddle": "A mother gave birth to six kids. The first daughter's name is July. The second daughter's name is August. The third daughter's name is September. The fourth daughter's name is October. The next child was a boy, therefore, she named him November. The mother was planning on having a girl named December, but it turned out that she got a boy. If she didn't name him December, what is his name?", "_type": "dict", "Heading": "The Mother With Six Kids", "Answer": "Jason. She took the first letter of the names of her children. July, August, September, October, November.", "id": 345}, {"Category": "Brain Teasers", "Riddle": "Lynn likes grapes but not potatoes. She likes squash but not lettuce, and she likes peas but not onions. Following the same rule, will she like pumpkins or apples?", "_type": "dict", "Heading": "Pumpkins Or Apples?", "Answer": "Pumpkins. Lynn only likes things that grow on vines.", "id": 346}, {"Category": "Brain Teasers", "Riddle": "Four cars come to a four way stop, all coming from a different direction. They can't decide who got there first, so they all go forward at the same time. They do not crash into each other, but all four cars go. How is this possible?", "_type": "dict", "Heading": "Car Collisions", "Answer": "They all made right-hand turns.", "id": 498}, {"Category": "Brain Teasers", "Riddle": "A man builds a house with all 4 sides facing south. A bear walks past the house. What color is the bear?", "_type": "dict", "Heading": "Color Of The Bear", "Answer": "White, the house is built directly on the North Pole.", "id": 499}, {"Category": "Brain Teasers", "Riddle": "When liquid splashes me, none seeps through. When I am moved alot, liquid I spew. When I am hit, color I change. And color, I come in quite a range. What I cover is very complex, and I am very easy to flex. What am I?", "_type": "dict", "Heading": "Easy To Flex", "Answer": "I'm skin!", "id": 500}, {"Category": "Brain Teasers", "Riddle": "Even if they are starving, natives living in the Arctic will never eat a penguin's egg.\n\r\n\nWhy not?", "_type": "dict", "Heading": "Living In The Arctic ", "Answer": "Penguins only live in Antartica.", "id": 501}, {"Category": "Brain Teasers", "Riddle": "As I was going to the fair, I saw a man with golden hair. He had 3 sons each with another one. How many people were going to the fair?", "_type": "dict", "Heading": "Going To The Fair", "Answer": "One. Just me because I met the others on the way to the fair.", "id": 502}, {"Category": "Brain Teasers", "Riddle": "What's as big as you are yet doesn't weigh an ounce?", "_type": "dict", "Heading": "Just Like You", "Answer": "A shadow.", "id": 503}, {"Category": "Brain Teasers", "Riddle": "You are on an island in the middle of a lake. The lake is in a remote part of the country and there has never been a bridge connecting the island to the mainland. Every day a tractor and wagon gives hay rides around the island. Puzzled as to how the tractor had gotten onto the island, you ask around and find out that the tractor was not transported to the island by boat or by air. Nor was it built on the island. Explain how the tractor got there?", "_type": "dict", "Heading": "Hay Rides", "Answer": "It was driven over in winter, when the lake was frozen.", "id": 504}, {"Category": "Brain Teasers", "Riddle": "Where will you find roads without cars, forests without trees and cities without houses?", "_type": "dict", "Heading": "Empty Lands", "Answer": "On a Map.", "id": 505}, {"Category": "Brain Teasers", "Riddle": "A man went on a trip with a fox, a goose and a sack of corn. He came upon a stream which he had to cross and found a tiny boat to use to cross the stream. He could only take himself and one other - the fox, the goose, or the corn - at a time. He could not leave the fox alone with the goose or the goose alone with the corn.\n\r\n\nHow does he get all safely over the stream?", "_type": "dict", "Heading": "Fox, Goose And A Sack Of Corn", "Answer": "Take the goose over first and come back. Then take the fox over and bring the goose back. Now take the corn over and come back alone to get the goose. Take the goose over and the job is done!", "id": 506}, {"Category": "Brain Teasers", "Riddle": "What force and strength cannot get through, I with a gentle touch can do. And many in the street would stand, were I not a friend at hand. \n\r\n\nWhat am I?", "_type": "dict", "Heading": "Cannot Get Through", "Answer": "I am a Key.", "id": 507}, {"Category": "Brain Teasers", "Riddle": "Trains travel from one town to another town all day, always on the same track, always going nonstop and at the same speed. The noon train took 80 minutes to complete the trip, but the 4 PM train took an hour and 20 minutes. Why?", "_type": "dict", "Heading": "Trains", "Answer": "80 minutes is the same as an hour and 20 minutes.", "id": 508}, {"Category": "Brain Teasers", "Riddle": "A pipe, a carrot, and a couple sticks are lying together in a field. Why?", "_type": "dict", "Heading": "Pipe, Carrot, And Sticks", "Answer": "They're what is left of a melted snowman.", "id": 509}, {"Category": "Brain Teasers", "Riddle": "I can be short and sometimes hot. When displayed, I rarely impress.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Rarely Impress", "Answer": "I am your temper.", "id": 510}, {"Category": "Brain Teasers", "Riddle": "Two dogs are sitting on a porch - a fat dog and a thin dog. The little dog is the son of the fat dog, but the fat dog is not the father of the thin dog. Can you explain?", "_type": "dict", "Heading": "Fat And Thin Dogs ", "Answer": "The fat dog is the mother.", "id": 511}, {"Category": "Brain Teasers", "Riddle": "Three men are walking across a green and luscious field. Only two of them are wearing rubber boots and yet the feet of the third man remain dry. Why?", "_type": "dict", "Heading": "Three Men", "Answer": "The ground is not wet!", "id": 512}, {"Category": "Brain Teasers", "Riddle": "If you drop the soap on the floor, is the floor clean or the soap dirty?", "_type": "dict", "Heading": "Soap Dirty Or Floor Clean", "Answer": "It depends on the floor.", "id": 513}, {"Category": "Brain Teasers", "Riddle": "Two sentries were on duty outside a barracks. One faced up the road to watch for anyone approaching from the North. The other looked down the road to see if anyone approached from the South. Suddenly one of them said to the other, \"Why are you smiling?\" How did he know that his companion was smiling?", "_type": "dict", "Heading": "Sentries", "Answer": "Although the guards were looking in opposite directions, they were not back to back. They were facing each other.", "id": 514}, {"Category": "Brain Teasers", "Riddle": "Only two back bones and a thousand ribs.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Hammer And Steel", "Answer": "Railroad track.", "id": 515}, {"Category": "Brain Teasers", "Riddle": "While exploring the wilds of Canada, George was captured by hostile wood fairies. Zion, the powerful chief of the fairies told him he could make one final statement which would determine how he would die. If the statement he made was false, he would be boiled in water. If the statement were true, he would be fried in oil. George found neither of this options too his liking, so he made a statement that got him out of this seemingly impossible situation. What is the one statement he could have made?", "_type": "dict", "Heading": "George's Choice", "Answer": "George said: \"You will boil me in water.\" The fairies were faced with a dilemma. If they boil him in water, that would make his statement true, which means he should have been fried in oil. They can only fry him in oil if he makes a true statement, but if they do, it would make his final statement false. The fairies had no way our of their situation so they were forced to set George free.", "id": 516}, {"Category": "Brain Teasers", "Riddle": "I'm tall and twisted;\n\r\n\nNarrow and fast;\n\r\n\nI'm there for a moment,\n\r\n\nBut my devastation lasts.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Lasting Devastation", "Answer": "A Tornado.", "id": 517}, {"Category": "Brain Teasers", "Riddle": "Something very extraordinary happened on the 6th of May, 1978 at 12:34 a.m. What was it?", "_type": "dict", "Heading": "Sequences Of Time", "Answer": "At that moment, the time and day could be written as: 12:34, 5/6/78.", "id": 518}, {"Category": "Brain Teasers", "Riddle": "I am a five letter word and I am a fruit. Take the first letter out and I am a crime, take out the first and second letter and I am a animal, take out the first and last letter and I am a type of music. What am I.", "_type": "dict", "Heading": "Guess", "Answer": "Grape cause if you take out the first letter it's rape, ape, rap.", "id": 519}, {"Category": "Brain Teasers", "Riddle": "The marathon man timed himself and found out that if he wore a bright white outfit he ran 20 miles in 80 minutes, but when he wore a dark outfit, he ran 20 miles in one hour and twenty minutes. What does this mean for his next race?", "_type": "dict", "Heading": "Marathon Man", "Answer": "Absolutely nothing, as 80 minutes equals an hour and twenty minutes.", "id": 520}, {"Category": "Brain Teasers", "Riddle": "There once was an evil wizard. He took 3 woman from their homes and turned them into rose bushes that looked exactly alike. He put them in his garden. One of the woman had a husband and children and begged the wizard to let her see them. He agreed. At night, he brought the woman to her house. In the morning he came and took her home. One day the husband decided to go rescue her. So he snuck into the wizard's garden. He looked and looked at the 3 identical rose bushes trying to figure out which could be his wife. Suddenly, he knew the answer and he took his wife home. How did he know which rose bush was his wife?", "_type": "dict", "Heading": "Three Rose Bushes", "Answer": "The wizard brought the rosebush to her home at night and returned her to the garden in the morning. Therefore, she was the only plant without dew.", "id": 521}, {"Category": "Brain Teasers", "Riddle": "What word doesn't belong in this group? That, hat, what, mat, cat, sat, pat, or chat?", "_type": "dict", "Heading": "-at Words", "Answer": "What. It's pronounced differently; all of the others rhyme.", "id": 522}, {"Category": "Brain Teasers", "Riddle": "Three lives have I. \n Gentle enough to soothe the skin, \n Light enough to caress the sky, \n Hard enough to crack rocks. \nWhat am I?", "_type": "dict", "Heading": "I Have Three Lives", "Answer": "Water.", "id": 523}, {"Category": "Brain Teasers", "Riddle": "I can sizzle like bacon, I am made with an egg, I have plenty of backbone, but lack a good leg, I peel layers like onions, but still remain whole, I can be long, like a flagpole, yet fit in a hole.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Sizzle Like Bacon", "Answer": "I'm a snake.", "id": 524}, {"Category": "Brain Teasers", "Riddle": "What ends in a 'w' but has no end?", "_type": "dict", "Heading": "Neverending!", "Answer": "A rainbow!", "id": 525}, {"Category": "Brain Teasers", "Riddle": "What kind of coat can be put on only when wet?", "_type": "dict", "Heading": "Wet Coat", "Answer": "A coat of paint!", "id": 526}, {"Category": "Brain Teasers", "Riddle": "There was a green house. \n Inside the green house there was a white house \n Inside the white house there was a red house. \n Inside the red house there were lots of babies \n What am I?", "_type": "dict", "Heading": "Lots Of Houses Lots Of Babies", "Answer": "A watermelon.", "id": 527}, {"Category": "Brain Teasers", "Riddle": "At night they come without being fetched, And by day they are lost without being stolen. What are they?", "_type": "dict", "Heading": "Belonging To Night", "Answer": "The stars.", "id": 528}, {"Category": "Brain Teasers", "Riddle": "I have many feathers to help me fly. I have a body and head, but I'm not alive. It is your strength which determines how far I go. You can hold me in your hand, but I'm never thrown. What am I?", "_type": "dict", "Heading": "Mastery Of Range", "Answer": "An Arrow.", "id": 529}, {"Category": "Brain Teasers", "Riddle": "What can be driven although it doesn't have wheels, sliced but stays whole?", "_type": "dict", "Heading": "Sliced But Stays Whole", "Answer": "A golf Ball", "id": 530}, {"Category": "Brain Teasers", "Riddle": "Alive without breath, As cold as death, Never thirsty, Ever drinking, Clad in mail, Never clinking, Drowns on dry land, Thinks an island Is a mountain, Thinks a fountain Is a puff of air. What am I?", "_type": "dict", "Heading": "Drown On Land", "Answer": "A fish.", "id": 531}, {"Category": "Brain Teasers", "Riddle": "There were two pairs hanging on a tree, one man walked by and took a pair. Soon after a second man also took a pear from the tree. However, even after both men took fruit from the tree there was still a pear left on the tree. How could this be?", "_type": "dict", "Heading": "2 Pears On A Tree", "Answer": "There were four pears (2 pairs) on the tree. The first man took a pair (2 pears) and the second only took one pear leaving one pear on the tree.", "id": 532}, {"Category": "Brain Teasers", "Riddle": "What is the smallest bridge in the world?", "_type": "dict", "Heading": "Smallest Bridge", "Answer": "The bridge of your nose.", "id": 533}, {"Category": "Brain Teasers", "Riddle": "Where is the AD before BC, tomorrow before yesterday, and the eight is first?", "_type": "dict", "Heading": "Letter Search", "Answer": "In a dictionary.", "id": 534}, {"Category": "Brain Teasers", "Riddle": "What is the difference between electricity and lighting?", "_type": "dict", "Heading": "Electricity Vs. Lightning ", "Answer": "You have to pay for electricity.", "id": 535}, {"Category": "Brain Teasers", "Riddle": "There are four brothers in this world that were all born together. The first runs and never wearies. The second eats and is never full. The third drinks and is always thirsty. The fourth sings a song that is never good. What are the four brothers?", "_type": "dict", "Heading": "Earth Day Riddle: Four Siblings", "Answer": "Water, Fire, Earth, and Wind.", "id": 536}, {"Category": "Brain Teasers", "Riddle": "When you stop and look, you can always see me. If you try to touch you cannot feel me. I cannot move, but as you near me, I will move away from you. What am I?", "_type": "dict", "Heading": "Beyond Your Reach", "Answer": "I am the horizon.", "id": 537}, {"Category": "Brain Teasers", "Riddle": "Bright as diamonds, Loud as thunder, Never still, A thing of wonder. What am I?", "_type": "dict", "Heading": "Wonderful And Bright", "Answer": "A Waterfall.", "id": 538}, {"Category": "Brain Teasers", "Riddle": "Rearrange the following letters to make just one word. \"STOODUWERNJ\" What is it?", "_type": "dict", "Heading": "One Word Puzzle", "Answer": "Just one word.", "id": 539}, {"Category": "Brain Teasers", "Riddle": "There is a frog, dead in the middle of an island. If he swims north, the distance to the mainland is 2 meters. If he swims south, the distance to the mainland is 3 meters. If he swims east or west, the distance is 4 meters. Which way does he swim?", "_type": "dict", "Heading": "Stranded Frog", "Answer": "He doesn't swim at all, he is dead.", "id": 540}, {"Category": "Brain Teasers", "Riddle": "A simple peasant bought a number of camels and is taking them to his farm. As he rides contentedly along he counts them - he counts 29. He was sure he had bought 30 camel, so in alarm he jumps off his camel and counts the camels again. To his delight there are 30. Half an hour later, he counts his camels and once more there are just 29. Confused, he climbs off his camel and counts again. Once more there are 30. Can you explain?", "_type": "dict", "Heading": "Camel Count - 29 Or 30?", "Answer": "When he is on the camel he omits to count it.", "id": 541}, {"Category": "Brain Teasers", "Riddle": "A man was born in 1898\n He is still alive now\n at the age 33 \n How is this possible ?", "_type": "dict", "Heading": "How Is He Alive", "Answer": "he was born in room 1898 in the hospital", "id": 542}, {"Category": "Brain Teasers", "Riddle": "Walk on the living, they don't even mumble. Walk on the dead, they mutter and grumble. What are they?", "_type": "dict", "Heading": "Stop Complaining", "Answer": "Fallen leaves.", "id": 543}, {"Category": "Brain Teasers", "Riddle": "Seven kids are in line for a carnival ride. Third in line is Joe, and two spots ahead of him is Kylie. Seventh in line is Kate, in front of Kate is Rylie, behind Joe is Chris, Eelizabeth is ahead of John in line. What is the order of the line?", "_type": "dict", "Heading": "Sequential Quiz", "Answer": "1. kylie 2. elizabeth 3. joe 4.chris 5. john 6. rylie 7. kate.", "id": 544}, {"Category": "Brain Teasers", "Riddle": "Two men were playing tennis. They played five sets and each man won three sets. How can this be possible?", "_type": "dict", "Heading": "Tennis Knowledge", "Answer": "The two men were partners playing doubles.", "id": 545}, {"Category": "Brain Teasers", "Riddle": "What do you throw out to use and take in when you're done?", "_type": "dict", "Heading": "Overboard", "Answer": "An anchor.", "id": 546}, {"Category": "Brain Teasers", "Riddle": "What can you put in a barrel, that will make the barrel lighter?", "_type": "dict", "Heading": "The Barrel", "Answer": "A Hole.", "id": 547}, {"Category": "Brain Teasers", "Riddle": "If it takes 3 people to dig 1 hole how many people does it takes for 1/2 an hole?", "_type": "dict", "Heading": "Hole 1/2", "Answer": "You can't dig 1/2 an hole because once you begin to dig it is an hole.", "id": 548}, {"Category": "Brain Teasers", "Riddle": "All about, but cannot be seen, Can be captured, cannot be held, No throat, but can be heard. What is it?", "_type": "dict", "Heading": "All About Brain Teaser", "Answer": "The wind.", "id": 549}, {"Category": "Brain Teasers", "Riddle": "What lives in winter, dies in summer, and grows with its roots upward?", "_type": "dict", "Heading": "Winter Riddle", "Answer": "An icicle.", "id": 550}, {"Category": "Brain Teasers", "Riddle": "Shoot at me a thousand times and I may still survive; one scratch from me and you will find your prospects take a dive.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Scratch ", "Answer": "An Eightball.", "id": 551}, {"Category": "Brain Teasers", "Riddle": "What is both possible and impossible at the same time?", "_type": "dict", "Heading": "Possible And Impossible", "Answer": "Impossibility.", "id": 552}, {"Category": "Brain Teasers", "Riddle": "Who is it that rows quickly with four oars but never comes out from under his own roof?", "_type": "dict", "Heading": "Shy Little Guy", "Answer": "A Turtle.", "id": 553}, {"Category": "Brain Teasers", "Riddle": "A group of privates were standing in the blistering sun facing due west. Their sergeant shouted at them: Right turn! About turn! Left turn!\n\r\n\nIn which direction are they now facing?", "_type": "dict", "Heading": "The Confused Soldiers", "Answer": "East.", "id": 554}, {"Category": "Brain Teasers", "Riddle": "What is the next number in the series?\n\r\n\n7,645 5,764 4,576...", "_type": "dict", "Heading": "Whats Next", "Answer": "6,457. The last digit is moved to the front to make the next number.", "id": 555}, {"Category": "Brain Teasers", "Riddle": "Which word is the odd one out: First Second Third Forth Fifth Sixth Seventh Eighth?", "_type": "dict", "Heading": "Odd One", "Answer": "Forth. It is incorrectly spelled.", "id": 556}, {"Category": "Brain Teasers", "Riddle": "I know a word of letters three. Add two, and fewer there will be! What Word Am I?", "_type": "dict", "Heading": "Three Letter Word Trivia Challenge", "Answer": "Few.", "id": 557}, {"Category": "Brain Teasers", "Riddle": "What house has post on top, A roof at the bottom, While the rain comes from below?", "_type": "dict", "Heading": "Rain Coming From Below", "Answer": "A boat.", "id": 558}, {"Category": "Brain Teasers", "Riddle": "Round as a button, Deep as a well. If you want me to talk, You must first pull my tail.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Round As A Button, Deep As A Well", "Answer": "A bell.", "id": 559}, {"Category": "Brain Teasers", "Riddle": "If someone says to you, \"I'll bet you $1 that if you give me $2, I will give you $3 in return\", would this be a good bet for you to accept?", "_type": "dict", "Heading": "Crazy Bet", "Answer": "No. This is a situation where you lose even if you win. Assuming the other person is being wise, they would take your $2 and say, \"I lose\", and give you $1 in return. You win the bet, but you're out $1.", "id": 560}, {"Category": "Brain Teasers", "Riddle": "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?", "_type": "dict", "Heading": "Blindingly Helpful", "Answer": "Sand.", "id": 561}, {"Category": "Brain Teasers", "Riddle": "The distance from the Earth to the Sun is about 100 million miles. The speed of light is 186,000 miles per second, and light takes eight minutes to reach the Earth from the Sun.  Let's say the Sun rose at 6am this morning, and that by some freak of physics the speed of light is suddenly doubled to 372,000 miles a second.\n\r\n\nWhat time will the Sun rise tomorrow?", "_type": "dict", "Heading": "Light Speed", "Answer": "6am again. After all, what diffrence does the speed of light make to the answer?  It's irrelevant- only the speed of the roation of the Earth matters here.", "id": 562}, {"Category": "Brain Teasers", "Riddle": "A dagger thrust at my own heart, Dictates the way I'm swayed. Left I stand, and right I yield, To the twisting of the blade. What am I?", "_type": "dict", "Heading": "Opened With A Twist", "Answer": "A Lock.", "id": 563}, {"Category": "Brain Teasers", "Riddle": "This thing all things devours: Birds, beasts, trees, flowers; Gnaws iron, bites steel; Grinds hard stones to meal; Slays king, ruins town, And beats high mountain down. What am I?", "_type": "dict", "Heading": "Devours Everything!", "Answer": "Time!", "id": 564}, {"Category": "Brain Teasers", "Riddle": "We are five little objects of an everyday sort. You will find us all in a tennis court. What are we?", "_type": "dict", "Heading": "Five Objects", "Answer": "Vowels.", "id": 565}, {"Category": "Brain Teasers", "Riddle": "In a pond there are some flowers with some bees hovering over them. How many flowers and bees are there if both the following statements are true: 1. If each bee lands on a flower, one bee doesn't get a flower. 2. If two bees share each flower, there is one flower left out.", "_type": "dict", "Heading": "Bees And Flowers", "Answer": "4 bees and 3 flowers.", "id": 566}, {"Category": "Brain Teasers", "Riddle": "This makes the heart grow ”FOUNDER”… Not FONDER. What is it?", "_type": "dict", "Heading": "Grow The Heart What Is It Riddle", "Answer": "The letter U.", "id": 567}, {"Category": "Brain Teasers", "Riddle": "A box without hinges, key or lid, Yet golden treasure inside is hid.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Golden Treasure", "Answer": "An egg.", "id": 568}, {"Category": "Brain Teasers", "Riddle": "Gaze at this sentence for just about sixty seconds and then explain what makes it quite different from the average sentence. Quick!\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Quick!", "Answer": "It contains all of the letters in the alphabet.", "id": 569}, {"Category": "Brain Teasers", "Riddle": "I come in a cone but I am not food;\n\r\n\nI will be skewed if you screw with my hue;\n\r\n\nI come by the millions but you can probably only name a few.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Come By The Millions", "Answer": "Colors.", "id": 570}, {"Category": "Brain Teasers", "Riddle": "Other than being colors, what do the words orange, silver and purple have in common?", "_type": "dict", "Heading": "Orange, Silver And Purple", "Answer": "There is no word in the English language that rhymes with them.", "id": 571}, {"Category": "Brain Teasers", "Riddle": "Always invisible, yet never out of sight.\n\r\n\nWhat are they?", "_type": "dict", "Heading": "Never Out Of Sight", "Answer": "The letters I & S.", "id": 572}, {"Category": "Brain Teasers", "Riddle": "If you screw a light bulb into a socket by turning the bulb toward the right with your right hand, which way would you turn the socket with your left hand in order to unscrew it while holding the bulb stationary?", "_type": "dict", "Heading": "That Which Way", "Answer": "To the right. It's always the same direction.", "id": 573}, {"Category": "Brain Teasers", "Riddle": "I am not found on any ground, \nBut always in the air; \nThough charged each cloud with thunder loud, \nYou can not find me there. \nNow, if from France you choose to dance \nYour way just into Spain, \nI there am seen, and near the queen, \nIn hail, in mist, and rain.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Enigma Riddle", "Answer": "The letter I.", "id": 574}, {"Category": "Brain Teasers", "Riddle": "Why is an avaricious man like one with a short memory?", "_type": "dict", "Heading": "Avaricious Riddle", "Answer": "Because he is always for getting.", "id": 575}, {"Category": "Brain Teasers", "Riddle": "If I say I am lying, am I telling the truth?", "_type": "dict", "Heading": "Lies And Truths", "Answer": "This is impossible to solve, because if I were telling the truth, then I would be lying, which doesn't make sense since I am telling the truth. If I am lying, then what I said was true and that doesn't make sense either.", "id": 576}, {"Category": "Brain Teasers", "Riddle": "A boy has as many sisters as brothers, but each sister has only half as many sisters as brothers.\n\r\n\nHow many brothers and sisters are there in the family?", "_type": "dict", "Heading": "How Many?", "Answer": "Four brothers and three sisters.", "id": 577}, {"Category": "Brain Teasers", "Riddle": "A prisoner is told \"If you tell a lie we will hang you; if you tell the truth we will shoot you.\" What can he say to save himself?", "_type": "dict", "Heading": "The Prisoner", "Answer": "You will hang me.", "id": 578}, {"Category": "Brain Teasers", "Riddle": "Where on Earth do the winds always blow from the South?", "_type": "dict", "Heading": "Southern Winds", "Answer": "The North Pole.", "id": 579}, {"Category": "Brain Teasers", "Riddle": "What country would you send a man to for his appetite?", "_type": "dict", "Heading": "Man With A Appetite", "Answer": "To Hungary.", "id": 580}, {"Category": "Brain Teasers", "Riddle": "How many three cent stamps are in a dozen?", "_type": "dict", "Heading": "Stamps In A Dozen", "Answer": "A dozen, although you probably said four.", "id": 581}, {"Category": "Brain Teasers", "Riddle": "1. Carnation, Peony, Tomato, Rose\n\r\n\n2. North America, Australia, Asia, Canada\n\r\n\n3. Dodgers, Cubs, Cowboys, Cardinals\n\r\n\n4. Laugh, Giggle, Chuckle, Cry\n\r\n\n5. Southeast, Southwest, Northeast, East", "_type": "dict", "Heading": "Which One Does Not Belong 2 ?", "Answer": "1.  Tomato because the others are all flowers.\n\r\n\n2. Canada because the others are all continents.\n\r\n\n3. Could be Dodgers  because it starts with a D or could be Cowboys because the others are baseball teams.\n\r\n\n4. Cry because the others are about happiness and being glad.\n\r\n\n5. East because the others are intermediate directions.", "id": 582}, {"Category": "Brain Teasers", "Riddle": "As defendants, we deny all involvement in the unscrupulous dealings which have come to light in the recent government investigation.  What country name is hidden in the previous sentence?", "_type": "dict", "Heading": "Hidden Country", "Answer": "Sweden. \"defendant\ns\n, \nwe den\ny\".", "id": 583}, {"Category": "Brain Teasers", "Riddle": "What year of this century is the same when its number is upside down? What year of the previous century is the same when inverted?", "_type": "dict", "Heading": "Upside Down Years", "Answer": "1961 and 1881.", "id": 584}, {"Category": "Brain Teasers", "Riddle": "I have two coins, one is marked George I and one is marked George IV. One is genuine but one is a forgery. Which is the forgery?", "_type": "dict", "Heading": "Two Coins", "Answer": "George I. A coin would not be marked Goerge I because at the time it was produced it would not have been known that there was going to be a George II.", "id": 585}, {"Category": "Brain Teasers", "Riddle": "Which of the following statements are true, and which are false? 1. Only one of the statements is false 2. Exactly two of the statements are false. 3. Only three of the statements are false. 4. Exactly four of the statements are false. 5. All five of these statements are false.", "_type": "dict", "Heading": "Baffling Statements", "Answer": "The only true statement can be #4. The others are false. #5 can't be true, because it says all the statements are false.", "id": 586}, {"Category": "Brain Teasers", "Riddle": "Jack had only $2, but he needed $3 for his cab fare home. He went to a pawn shop and pawned his $2 for $1.50. Jack then bumped into Don and told him that he would sell him his $2 pawn ticket for $1.50. Don agreed. Jack started out with $2 and he ended up with $3. Who is out the extra dollar and why?", "_type": "dict", "Heading": "Pawn Shop Ponzi Scheme", "Answer": "Don is out the extra dollar. Before the pawn broker will return the $2 to the ticket holder, he will want the $1.50 which he advanced returned to him. Don will give the pawn broker the ticket and the $1.50, and the pawn broker will then return the $2.", "id": 587}, {"Category": "Brain Teasers", "Riddle": "Analogies are comparisons. Complete each analogy below. Here is an example: Ear is to hearing as eye is to?   Sight.\n\r\n\n1. Cardinals is to St. Louis as Dodger is to?\n\r\n\n2. A.M. is to before noon as P.M. is to?\n\r\n\n3. Three is to triangle as 8 is to?\n\r\n\n4. Tear is to tore as see is to?\n\r\n\n5. Springfield is to Illinois as Austin is to?", "_type": "dict", "Heading": "Analogies 1", "Answer": "1. Los Angeles\n\r\n\n2. Afternoon\n\r\n\n3. Octagon\n\r\n\n4. Saw\n\r\n\n5. Texas", "id": 588}, {"Category": "Brain Teasers", "Riddle": "The favorite foods of Megan, Michael, Sergi, and Jana are written below. Each person has a different favorite food. Use the following food clues to match the people with their favorite foods.\n\r\n\n1. Michael likes ketchup and mustard on his favorite food.\n\r\n\n2. Jana is allergic to cheese.\n\r\n\n3. Sergi eats his favorite food on a bun.\n\r\n\n4 Sometimes for something different, Michael makes his food into corn dogs.\n\r\n\nWhat are each kids favorite food?\n\r\n\nWrite the name of the person next to their favorite foods.\n\r\n\nChicken Drumstick:\n\r\n\nHot Dog in a bun:\n\r\n\nA slice of Pizza:\n\r\n\nA hamburger in a bun:", "_type": "dict", "Heading": "Favorite Foods 1", "Answer": "Chicken Drumstick:  Jana\n\r\n\nHot Dog in a bun: Michael\n\r\n\nA slice of Pizza: Megan\n\r\n\nA hamburger in a bun: Sergi", "id": 589}, {"Category": "Brain Teasers", "Riddle": "In 1990, a person is 15 years old. In 1995 that same person is 10 years old. How is this possible?", "_type": "dict", "Heading": "Reverse Years", "Answer": "The years are in B.C.", "id": 590}, {"Category": "Brain Teasers", "Riddle": "A large truck is crossing a bridge 1 mile long. The bridge can only hold 14000 lbs, which is the exact weight of the truck. The truck makes it half way across the bridge and stops. A bird lands on the truck. Does the bridge collapse?", "_type": "dict", "Heading": "A Large Truck", "Answer": "No, it does not collapse. Because it has driven a half mile - you would subtract the gas used from the total weight of the truck.", "id": 591}, {"Category": "Brain Teasers", "Riddle": "Charlotte is 13 years old. Her father Montague is 40 years old. How many years ago was Charlotte's father four times as old as Charlotte?", "_type": "dict", "Heading": "Charlotte Match Teaser", "Answer": "Four years ago. When Charlotte was 9 her father was 36, 4 times her age.", "id": 592}, {"Category": "Brain Teasers", "Riddle": "Picture three boxes containing fruit. The first box is marked peaches, the second is marked oranges, and the third box is marked peaches and oranges. Each of the boxes is labeled incorrectly. How could you label each box correctly if you were allowed to select only one fruit from one of the boxes?", "_type": "dict", "Heading": "Three Fruit Boxes", "Answer": "First you select a fruit from the box marked peaches and oranges. If it was a orange you selected, you know that the box could only contain oranges. If it was a peach, you know that the box could only contain peaches since each box is incorrectly marked. If, for example an orange was selected, you would mark that box oranges and switch the other two incorrect labels around. Now all three would be correctly labeled.", "id": 593}, {"Category": "Brain Teasers", "Riddle": "Four men were in a boat on the lake. The boat turns over, and all four men sink to the bottom of the lake, yet not a single man got wet! Why?", "_type": "dict", "Heading": "Single Man", "Answer": "Because they were all married and not single.", "id": 594}, {"Category": "Brain Teasers", "Riddle": "The following sentence is false. The preceding sentence is true. Are these sentences true or false?", "_type": "dict", "Heading": "True Or False Brain Teaser", "Answer": "Neither, it's a paradox. If the first is true, then the second must be false, which makes the first false; it doesn't work.", "id": 595}, {"Category": "Brain Teasers", "Riddle": "I have three USA coins. They are not a quarter, dime or penny and they adds up to 60 cents. \n\r\n\nWhat are the coins?", "_type": "dict", "Heading": "USA Coins", "Answer": "A 50 cent piece and 2 nickels.", "id": 596}, {"Category": "Brain Teasers", "Riddle": "Alice is walking throught the forest of forgetfulness. She wants to know what day of the week it is. She stops and asks a lion and a unicorn. Now the lion lies all of the time on Monday, Tuesday, and Wednesday. The unicorn always lies on Thursday, Friday and Saturday. Alice asks the lion what day it is, he says, \"Well, yesterday was one of my lying days.\" Alice can't figure it out just from the lion's answer so she asks the unicorn and the unicorn says, \"Yesterday was also one of my lying days.\" What day is it?", "_type": "dict", "Heading": "What Day", "Answer": "Thursday.", "id": 597}, {"Category": "Brain Teasers", "Riddle": "1. Trigononmetry, Geometry, Cirrus, Calculus\n\r\n\n2. Comic book, Atlas, Novel, Brain teasers book\n\r\n\n3. Otter, Shark, Dolphin, Sea Lion\n\r\n\n4. Pen, Pencil, Eraser, Chalk\n\r\n\n5. Golden Delicious, Bartlett, Granny Smith, Jonathon", "_type": "dict", "Heading": "Which One Does Not Belong 3 ?", "Answer": "1. Cirrus because the others are all mathematics\n\r\n\n2. Atlas because the others are all for leisure/pleasure reading\n\r\n\n3. Shark because the others are all marine mammals\n\r\n\n4. Chalk because the others are all desk tools\n\r\n\n5. Bartlett because the others are types of apples", "id": 748}, {"Category": "Brain Teasers", "Riddle": "Are the below statements True or False?\n\r\n\n \n\r\n\n1. The Washington Monument is in Washington D.C.?\n\r\n\n2. The Pacific Ocean is on the east coast of North America?\n\r\n\n3. There are 12 months in every Gregorian year?\n\r\n\n4. The color red is a primary color?\n\r\n\n5. Lincoln was the the third president of the United States?", "_type": "dict", "Heading": "True Or False 1", "Answer": "1. T\n\r\n\n2. F \n\r\n\n3. T\n\r\n\n4. T\n\r\n\n5. F", "id": 749}, {"Category": "Brain Teasers", "Riddle": "A store has on sale a computer and word processor small enough to fit in your pocket. It can add, multiply, subtract, divide, and write in all languages. A delete device will correct any error. No electricity is required to operate it. The price? Only a few cents! How can the store make a profit by selling it so cheap?", "_type": "dict", "Heading": "The Amazing Computer", "Answer": "The computer is a wooden pencil with an eraser!", "id": 750}, {"Category": "Brain Teasers", "Riddle": "I was born in the 18th century, yet still live on today. Appearing on TV when I have something to say. Called everything from \"honest\" to a dirty rotten \"crook\", I used to wear a wig, but have had several looks. I've always had a party, but never disturb the neighbors. I've been shot at many times - major stories for the papers. What am I?", "_type": "dict", "Heading": "18th Century", "Answer": "The Office of the President of the United States.", "id": 751}, {"Category": "Brain Teasers", "Riddle": "What is the missing half of each word pair?\n\r\n\n1. Hot and \n\r\n\n2. Lock and\n\r\n\n3. Black and\n\r\n\n4. Scream and \n\r\n\n5. Body and\n\r\n\n6. Left and\n\r\n\n7. Bacon and\n\r\n\n8. Cat and\n\r\n\n9. Up and\n\r\n\n10. Burgers and", "_type": "dict", "Heading": "Word Pairs I", "Answer": "1. Cold\n\r\n\n2. Key\n\r\n\n3. White/Blue\n\r\n\n4. Shout\n\r\n\n5. Soul\n\r\n\n6. Right\n\r\n\n7. Eggs\n\r\n\n8. Mouse\n\r\n\n9. Down\n\r\n\n10. Fries", "id": 752}, {"Category": "Brain Teasers", "Riddle": "When is the best time to have lunch?", "_type": "dict", "Heading": "The Lunch", "Answer": "after breakfast", "id": 753}, {"Category": "Brain Teasers", "Riddle": "If you toss a die and it comes up with the number one 9 times in a row, what is the probability that it will come up with one on the next throw?", "_type": "dict", "Heading": "Lucky Die IQ Test", "Answer": "One in six. A die has no memory of what it last showed.", "id": 754}, {"Category": "Brain Teasers", "Riddle": "What is the difference between a lady and a postage stamp?", "_type": "dict", "Heading": "Lady And Postage Stamp", "Answer": "One is female, the other is mail-fee.", "id": 755}, {"Category": "Brain Teasers", "Riddle": "'When Gwen is twice as old as Dean, Then I shall be just 17. But Gwendoline was 23 When Dean was twice as old as me.' Thats what Bill said.\n\r\n\nSo tell us then, How old he was when Dean was ten?", "_type": "dict", "Heading": "Ages!", "Answer": "Eight.", "id": 756}, {"Category": "Brain Teasers", "Riddle": "A queen bee was buzzing, a worker bee was buzzing, a honey bee was buzzing, and a killer bee was buzzing.\n\r\n\nHow many bees were in buzzing?", "_type": "dict", "Heading": "The Queen Bee", "Answer": "One. There is only one b in the word buzzing", "id": 757}, {"Category": "Brain Teasers", "Riddle": "Use all letters of this sentence once each only to spell out three animals.\n\r\n\n'TALL ELEPHANT OR APEMAN'", "_type": "dict", "Heading": "Three Animals", "Answer": "PANTHER, ANTELOPE, LLAMA", "id": 758}, {"Category": "Brain Teasers", "Riddle": "A man sails off on a cruise between Mexico and the USA. He does not stop at any ports and does not even come out of the cabin, yet he makes $300,000 from his trip.\n\r\n\nHow?", "_type": "dict", "Heading": "Sailing Off", "Answer": "He's a smuggler.", "id": 759}, {"Category": "Brain Teasers", "Riddle": "Why do black sheep eat less than white sheep?", "_type": "dict", "Heading": "Sheep Riddle", "Answer": "Because there are less black sheep in the world than white.", "id": 760}, {"Category": "Brain Teasers", "Riddle": "What is the value of 1/2 of 2/3 of 3/4 of 4/5 of 5/6 of 6/7 of 7/8 of 8/9 of 9/10 of 1,000?", "_type": "dict", "Heading": "Fraction Teaser", "Answer": "One hundred - work backwards and you will understand.", "id": 761}, {"Category": "Brain Teasers", "Riddle": "The body of a woman is found in bed. Tere are no signs of violence and no marks of any kind on her body. The only evidence is a pair of scissors lying next to her.\n\r\n\nHow did she die?", "_type": "dict", "Heading": "Sleeping Beauty", "Answer": "She had drowned. The women was found on a waterbed that had been punctured by scissors while she was slept.", "id": 762}, {"Category": "Brain Teasers", "Riddle": "Which of the seven dwarfs never speaks?", "_type": "dict", "Heading": "Silent Dwarf", "Answer": "Dopey.", "id": 763}, {"Category": "Brain Teasers", "Riddle": "Can you Form a word from the letters? A  B  C  D  E F  G  I.  (note; the word is hyphenated)", "_type": "dict", "Heading": "Make A Word", "Answer": "Big-Faced.", "id": 764}, {"Category": "Brain Teasers", "Riddle": "How many times does the long hand of the clock pass the short hand between midnight one day and midnight the following day? As both hands are together at the starting time of midnight this does not count as a pass.", "_type": "dict", "Heading": "The Hands Of The Clock", "Answer": "21.", "id": 765}, {"Category": "Brain Teasers", "Riddle": "Name three things that?\n\r\n\n1. Are red\n\r\n\n2. Can swim\n\r\n\n3. Give off heat", "_type": "dict", "Heading": "Name Three 1", "Answer": "Answers may vary.\n\r\n\n1. Apples, Roses, Stop Signs\n\r\n\n2. Fish, Dogs, Snakes\n\r\n\n3. Sun, Fire, Your body", "id": 766}, {"Category": "Brain Teasers", "Riddle": "A train just leaves a station and enters a tunnel. Where is the best place for a claustrophobic person to sit?", "_type": "dict", "Heading": "Claustrophobia", "Answer": "In the back. See, the train is still accelerating as it is leaving the station so the train will be moving faster when the back of the train enters the tunnel.", "id": 767}, {"Category": "Brain Teasers", "Riddle": "Why is your eye like a boy being whipped?", "_type": "dict", "Heading": "Eye Whip", "Answer": "It is under the lash.", "id": 768}, {"Category": "Brain Teasers", "Riddle": "A person gets up 180 times every night and sleeps for at least 7 hours at a time.  Where does the person live?", "_type": "dict", "Heading": "Geography Riddle", "Answer": "At the North or South Pole.", "id": 769}, {"Category": "Brain Teasers", "Riddle": "Name the first three presidents to live in the white house?", "_type": "dict", "Heading": "Three Presidents", "Answer": "Adams\n\r\n\nJefferson\n\r\n\nMadison", "id": 770}, {"Category": "Brain Teasers", "Riddle": "In the back yard, there is a hollow stump, that contains six ears of corn. If a healthy squirrel carries out only three ears each day, how many days will it take to empty the stump?", "_type": "dict", "Heading": "Six Hears Of Corn", "Answer": "Six. Each day the squirrel will carry out the two ears on his head plus one ear of corn.", "id": 771}, {"Category": "Brain Teasers", "Riddle": "If you have three oranges and you take away two, how many will you have?", "_type": "dict", "Heading": "If You Have Three Oranges", "Answer": "the answer is 2 two you take 2.... (you have 2)", "id": 772}, {"Category": "Brain Teasers", "Riddle": "What have these words in common?\n\r\n\nASPIRATED  GRANGERS  PRELATES  SWINGERS  CHASTENS", "_type": "dict", "Heading": "Words Change Game", "Answer": "All can be diminished by one letter (from begining and end alternately) forming a new word each time.", "id": 773}, {"Category": "Brain Teasers", "Riddle": "Can you list 15 items that are sold in pairs?", "_type": "dict", "Heading": "Pick A Pair 1", "Answer": "1. Shoes\n\r\n\n2. Gloves\n\r\n\n3. Socks\n\r\n\n4. Ice Skates\n\r\n\n5. Skis\n\r\n\n6. Shoe laces\n\r\n\n7. Earrings\n\r\n\n8. Ear plugs\n\r\n\n9. Dice\n\r\n\n10. Reese's Peanut Butter Cups Candy\n\r\n\n11. Speakers\n\r\n\n12. Dumb Bells\n\r\n\n13. Chop sticks\n\r\n\n13. Drum sticks\n\r\n\n14. Knee pads\n\r\n\n15. Fake eyelashes", "id": 774}, {"Category": "Brain Teasers", "Riddle": "It has rib bones and back bones. It swallows human beings whole, then spits them out alive. What is it?", "_type": "dict", "Heading": "Swallow Human Beings Whole", "Answer": "A house.", "id": 775}, {"Category": "Brain Teasers", "Riddle": "A sign on the barber's door says \"I shave only those who do not shave themselves\". Does the barber shave himself?", "_type": "dict", "Heading": "Barber's Door", "Answer": "There is no answer; it's a paradox. It cannot be made to work.", "id": 776}, {"Category": "Brain Teasers", "Riddle": "If seven cats kill seven rats in 7 minutes, how many would be needed to kill one hundred rats in 50 minutes?", "_type": "dict", "Heading": "Ahhh Rats", "Answer": "14.", "id": 777}, {"Category": "Brain Teasers", "Riddle": "Spell \"enemy\" in three letters.", "_type": "dict", "Heading": "Enemy ", "Answer": "F O E", "id": 778}, {"Category": "Brain Teasers", "Riddle": "Dreaming of apples on a wall. And dreaming often, dear. I dreamed that, if I counted all, How many would appear?\n\r\n\nHow many?", "_type": "dict", "Heading": "Apples Riddle", "Answer": "And dreaming of ten, dear.", "id": 779}, {"Category": "Brain Teasers", "Riddle": "Which is the largest room in the world?", "_type": "dict", "Heading": "Largest Room", "Answer": "The room for improvement.", "id": 780}, {"Category": "Brain Teasers", "Riddle": "What is the difference between a dollar and a half and thirty five-cents?", "_type": "dict", "Heading": "Dollar Difference", "Answer": "Nothing. A dollar and a half is the same as thirty five-cents (nickels). But not the same as thirty-five cents.", "id": 781}, {"Category": "Brain Teasers", "Riddle": "A dog had three puppies, named Mopsy, Topsy and Spot. What was the mothers name?", "_type": "dict", "Heading": "Puppy Love", "Answer": "What", "id": 782}, {"Category": "Brain Teasers", "Riddle": "Holding two long poles, five fellows Chase a herd of white buffalo into a cave.", "_type": "dict", "Heading": "Chasing Buffalo", "Answer": "Eating rice with a pair of chopsticks.", "id": 783}, {"Category": "Brain Teasers", "Riddle": "A man walking along a railraod track sees a train thundering at high speed towards him. Instead of immediately jumpimg off the track, he charges directly at the train for about ten feet and only then gets off the track.\n\r\n\nWhy?", "_type": "dict", "Heading": "On The Right Track", "Answer": "The man was on a bridge when he first saw the train so he couldn't jump off the track immediately.", "id": 784}, {"Category": "Brain Teasers", "Riddle": "Suppose you want to send in the mail a valuable object to a friend. You have a box which is big enough to hold the object. The box has a locking ring which is large enough to have a lock attached and you have several locks with keys. However, your friend does not have the key to any lock that you have. You cannot send the key in an unlocked box since it may be stolen or copied. How do you send the valuable object, locked, to your friend - so it may be opened by your friend?", "_type": "dict", "Heading": "Mailing A Valuable Object", "Answer": "Send the box with a lock attached and locked. Your friend attaches his or her own lock and sends the box back to you. You remove your lock and send it back to your friend. Your friend may then remove the lock she or he put on and open the box.", "id": 785}, {"Category": "Brain Teasers", "Riddle": "How can you hold a piece of string, one end in each hand, and tie a knot in the string with out letting go of either end?", "_type": "dict", "Heading": "A Knotty Problem", "Answer": "Cross your arms before you seize the ends of the string. Uncross your arms and it will tie a knot!", "id": 786}, {"Category": "Brain Teasers", "Riddle": "A horse travels a certain distance each day. Strangely enough, two of its legs travel 30 miles each day and the other two legs travel nearly 31 miles. It would seem that two of the horse's legs must be one mile ahead of the other two legs, but of course this can't be true, since the horse is normal. How is this possible?", "_type": "dict", "Heading": "Horse Travel Brain Teaser", "Answer": "The horse operates a mill and travels in a circular clockwise direction. The two outside legs will travel a greater distance than the two inside legs.", "id": 787}, {"Category": "Brain Teasers", "Riddle": "My first is often at the front door. My second is found in the cereal family. My third is what most people want. My whole is one of the United States. What am I?", "_type": "dict", "Heading": "How Do You Get The Whole United States To Agree?", "Answer": "MATRIMONY (mat rye money). Which is certainly a \"united state\"!", "id": 788}, {"Category": "Brain Teasers", "Riddle": "As a whole, I am both safe and secure. Behead me, and I become a place of meeting. Behead me again, and I am the partner of ready. Restore me, and I become the domain of beasts.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "I Am Safe And Secure.", "Answer": "Stable.", "id": 789}, {"Category": "Brain Teasers", "Riddle": "Where is there is no south, west, nor east, and weather not fit for man or beast", "_type": "dict", "Heading": "Not South West Nor East", "Answer": "The South Pole", "id": 790}, {"Category": "Brain Teasers", "Riddle": "A book costs $1 plus half its price. How much does it cost?", "_type": "dict", "Heading": "Price Of A Book", "Answer": "$2", "id": 791}, {"Category": "Brain Teasers", "Riddle": "Our dinner guests cry that we are evil, when they notice their place in the meal. But its no big deal why; we are just one big happy tribe! And we get reall fed up with people!\n\r\n\nWho, What or Are we?", "_type": "dict", "Heading": "The Dinner Guests", "Answer": "Cannibals!", "id": 792}, {"Category": "Brain Teasers", "Riddle": "You are standing in front of a room with one lightbulb inside of it. You cannot see if it is on or off. Outside the room, there are 3 switches in the off positions. You may turn the switches any way you want to. You stop turning the switches, enter the room and know which switch controls the lightbulb. How?", "_type": "dict", "Heading": "3 Switches", "Answer": "You turn 2 switches \"on\" and leave 1 switch \"off\" and wait about a minute. Then enter the room, but just before you enter, turn one switch from \"on\" to \"off\". Once in the room, feel the lightbulb - if it is warm, but off, it has to be the last switch you turned off. If it is on, it has to be the switch left on. If it is cold and is off, it has to be the switch you left in the off position.", "id": 793}, {"Category": "Brain Teasers", "Riddle": "Of no use to one Yet absolute bliss to two. The small boy gets it for nothing. The young man has to lie for it. The old man has to buy it. The baby's right, The lover's privilege, The hypocrite's mask. To the young girl, faith; To the married woman, hope; To the old maid, charity. What am I?", "_type": "dict", "Heading": "Of No Use To One", "Answer": "A Kiss.", "id": 794}, {"Category": "Brain Teasers", "Riddle": "Three pirates, One Eye, Long John, and Peg Leg, were gambling with pieces of gold. All the winnings were piled up on the table.  One Eye said, 'I have won 1/2' and took a large handful or two. Long John said, 'I have won 1/3' and took a handful. Peg Leg said, ' I have won 1/6' and took a small handful.  One Eye said, ' I have taken too much' and returned a half. Long John said, 'I have taken too much' and returned a third. Peg Leg said, 'I have taken too much and returned a sixth.  The money on the table was then shared out equally and they had 42 pieces each.  One Eye said, 'I have now 1/2 of the total originally.' Long John said, ' I now have 1/3 of the originally.'  Peg Leg said, 'I have now 1/6 of the originally.'\n\r\n\nHow much was on the table originally?", "_type": "dict", "Heading": "Pirates", "Answer": "282 Pieces.", "id": 795}, {"Category": "Brain Teasers", "Riddle": "I can come in a can,\n\r\n\nI can come as a punch,\n\r\n\nI can come as a win,\n\r\n\nYou can eat me for lunch.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Come As A Punch", "Answer": "Beet/Beat", "id": 796}, {"Category": "Brain Teasers", "Riddle": "What word starting with BR, that with the addition of the letter E, becomes another word that sounds the same as the first?", "_type": "dict", "Heading": "Same Pronunciation", "Answer": "Braking becomes Breaking.", "id": 797}, {"Category": "Brain Teasers", "Riddle": "What is that which goes with a carriage, comes with a carriage, is of no use to a carriage, and yet the carriage cannot go without it. What is it?", "_type": "dict", "Heading": "Carriages!", "Answer": "Noise.", "id": 798}, {"Category": "Brain Teasers", "Riddle": "Julie is going on an extended trip for three weeks. She lives in a remote area where there are frequent electrical power outages which can last up to three or four days. Julie has quite a bit of food in her freezer which would go bad if it thawed and then re-froze. She does have digital clock and a VCR which would flash 12:00 if the power went out. Unfortunately the clock and VCR flash even if the power only goes out for a few seconds. What can Julie do so that when she returns home she will be able to determine whether the power was out long enough to thaw her food? Asking a neighbor whether the power was out, isn't a reliable option because the nearest house is half a mile away, and one house may have power, while another house may have no power. She won?t be able to have a neighbor check on her house every day, and has no one to house sit.", "_type": "dict", "Heading": "An Extended Trip", "Answer": "One thing Julie could do is freeze a tray of ice-cubes, and turn the tray of ice upside down in her freezer. When she comes home, she should check the tray. If the ice cubes are still in the tray, the food is safe to eat. If the trays are empty, it's time to clean out the freezer. She will have to make a judgment call if the ice-cubes are only slightly thawed.", "id": 799}, {"Category": "Brain Teasers", "Riddle": "Pregnant every time you see her, yet she never will give birth. What is it?", "_type": "dict", "Heading": "She Will Never Give Birth", "Answer": "Full Moon", "id": 800}, {"Category": "Brain Teasers", "Riddle": "In yon vast field of cultivated space, I there am found with members of my race; Decapitate me - if you've no objection - You then will find what brings me to perfection; Take one more cut, and then you'll plainly see What Iam destined, day by day, to be. What am I?", "_type": "dict", "Heading": "Beheadment Riddle", "Answer": "WHEAT\n  HEAT\n   EAT", "id": 801}, {"Category": "Brain Teasers", "Riddle": "There where 5 men travling down a road and it started to rain and 4 men sped up, the 5th did not, but they all arived at the same place at the same time but all of them were wet besides the 5th\n\r\n\nhow?", "_type": "dict", "Heading": "5 Men", "Answer": "he was dead. in a coffin", "id": 802}, {"Category": "Brain Teasers", "Riddle": "Who spends the day at the window, goes to the table for meals and hides at night?", "_type": "dict", "Heading": "Incognito!", "Answer": "A fly.", "id": 803}, {"Category": "Brain Teasers", "Riddle": "A student zips on his scooter to ride to the train station to get to college. His home is close to two stops; the first one is a mile from home, and the second is two miles from home in the opposite direction. In the morning, he always gets on at the first stop and in the afternoon, he always gets off at the second one.\n\r\n\nWhy?", "_type": "dict", "Heading": "Getting Around", "Answer": "The sations and his home are on a hill, which allows him to ride down easily on his scooter.", "id": 804}, {"Category": "Brain Teasers", "Riddle": "The king dies and two men, the true heir and an impostor, both claim to be his long-lost son. Both fit the description of the rightful heir: about the right age, height, coloring and general appearance. Finally, one of the elders proposes a test to identify the true heir. One man agrees to the test while the other flatly re-fuses. The one who agreed is immediately sent on his way, and the one who re-fused is correctly identified as the rightful heir. Can you figure out why?", "_type": "dict", "Heading": "Impostor!", "Answer": "The test was a blood test. The elder remembered that the true prince was a hemophiliac.", "id": 805}, {"Category": "Brain Teasers", "Riddle": "Some say we are red, some say we are green. Some play us, some spray us.\n\r\n\nWhat are we?", "_type": "dict", "Heading": "Red Or Green", "Answer": "Pepper.", "id": 806}, {"Category": "Brain Teasers", "Riddle": "0,1,2,3,4,5,6,7,8,9 \n\r\n\nUse the digits above once each only to compose two fractions which when added togeather equal 1.", "_type": "dict", "Heading": "Two Fractions", "Answer": "35/70 + 148/296 = 1", "id": 807}, {"Category": "Brain Teasers", "Riddle": "A boy presses a side of a blue pencil to a side of a yellow pencil, holding both pencils vertically. One inch of the pressed side of the blue pencil, measuring from its lower end, is smeared with paint. The yellow pencil is held steady while the boy slides the blue pencil down 1 inch, continueing to press it against the yellow one. He returns the blue pencil to its former position, then again it slides down 1 inch. He continues until he has lowered the blue pencil 5 times and raised it 5 times- 10 moves in all.\n\r\n\nSupposed that during this time the paint neither dries nor diminishes in quantity. How many inches of each pencil will be sneared with paint after the tenth move?", "_type": "dict", "Heading": "Down And Up", "Answer": "At the start, 1inch of the yellow pencil gets smeared with wet paint. As the blue pencil is moved downward, a second inch of the blue pencils smears a second inch of the yellow pencil.\n\r\n\nEach pair of down and up movesof the blue pencil smears 1 more inch of each pencil. 5 pairs of moves will smear 5 inches. This together with the initial inch, makes 6 inches for each pencil.", "id": 808}, {"Category": "Brain Teasers", "Riddle": "A mother has three sick children. She has a 24-ounce bottle of medicine and needs to give each child eight ounces of the medicine. She is unable to get to the store and has only three clean containers, which measure 5, 11 and 13 ounces. The electricity is out and she has no way of heating water to wash the containers and doesn't want to spread germs. How can she divide the medicine to give each child an equal portion without having any two children drink from the same container?", "_type": "dict", "Heading": "Bottle Of Medicine", "Answer": "Fill the 5 oz. and 11 oz. Containers from the 24 oz. container. This leaves 8 oz. in the 24 oz. bottle. Next empty the 11 oz. bottle by pouring the contents into the 13 oz. bottle. Fill the 13 oz. bottle from the 5 oz. container (with 2 oz.) and put the remaining 3 oz. in the 11 oz. bottle. This leaves the 5 oz. container empty. Now pour 5 oz. from the 13 oz. bottle into the 5 oz. bottle leaving 8 oz. in the 13 oz. bottle. Finally pour the 5 oz. bottle contents into the 11 oz. bottle giving 8 oz. in this container.", "id": 809}, {"Category": "Brain Teasers", "Riddle": "Rearrange all the letters in each of the sentences to form, in each case, a well known proverb.\n\r\n\n1. I don't admit women are faint.\n\r\n\n2. It rocks. The broad flag of the free.\n\r\n\n3. Strong lion's share almost gone.", "_type": "dict", "Heading": "Proverb Word Play", "Answer": "1. Time and tide wait for no man.\n\r\n\n2. Birds of a feather flock together.\n\r\n\n3. A rolling sone gathers no moss.", "id": 810}, {"Category": "Brain Teasers", "Riddle": "There were five men going to church and it started to rain. The four that ran got wet and the one that stood still stayed dry. How did the one stay dry?", "_type": "dict", "Heading": "Rainy Church Day", "Answer": "It was a body in a coffin with the bearers.", "id": 811}, {"Category": "Brain Teasers", "Riddle": "You have two container, a 5 gallon and a 3 gallon container. How do you measure out 4 gallons?", "_type": "dict", "Heading": "Gallons Of Water", "Answer": "Fill up the 3 gallon container and pour the 3 gallons into the 5 gallon container.\nThen, fill the 3 gallon container back up, and pour it into the 5 gallon container.\nThe 3 gallon container will have 1 gallon left. \nEmpty the 5 gallon container.\nPour the remining 1 gallon into the 5 gallon container.\nThen fill the 3 gallon container back up and pour it into the 5 gallon container.\nThus, you have 4 gallons.", "id": 812}, {"Category": "Brain Teasers", "Riddle": "You can use me to stop,\n\r\n\nYou take me to smoke;\n\r\n\nNot only do I stop, But I am a stop,\n\r\n\nAnd the result of pool's first stroke.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Take Me To Smoke", "Answer": "Brake/ Break", "id": 813}, {"Category": "Brain Teasers", "Riddle": "My first is often at the front door. My second is found in the cereal family. My third is what most people want. My whole is one of the United States.", "_type": "dict", "Heading": "A United State Brain Teaser", "Answer": "Matrimoney. (mat + rye + money). Matrimony is certainly a \"united state\"!", "id": 814}, {"Category": "Brain Teasers", "Riddle": "You are given a set of scales and 12 marbles. The scales are of the old balance variety. That is, a small dish hangs from each end of a rod that is balanced in the middle. The device enables you to conclude either that the contents of the dishes weight the same or that the dish that falls lower has heavier contents than the other. The 12 marbles appear to be identical. In fact, 11 of them are identical, and one is of a different weight. Your task is to identify the unusual marble and discard it. You are allowed to use the scales three times if you wish, but no more. Note that the unusual marble may be heavier or lighter than the others. You are asked to both identify it and determine whether it is heavy or light", "_type": "dict", "Heading": "Marbles", "Answer": "Most people seem to think that the thing to do is weight six coins against six coins, but if you think about it, this would yield you no information concerning the whereabouts of the only different coin. As we already know that one side will be heavier than the other. So that the following plan can be followed, let us number the coins from 1 to 12. For the first weighing let us put on the left pan coins 1,2,3,4 and on the right pan coins 5,6,7,8. There are two possibilities. Either they balance, or they don't. If they balance, then the different coin is in the group 9,10,11,12. So for our second weighing we would put 1,2 in the left pan and 9,10 on the right. If these balance then the different coin is either 11 or 12. Weigh coin 1 against 11. If they balance, the different coin is number 12. If they do not balance, then 11 is the different coin. If 1,2 vs 9,10 do not balance, then the different coin is either 9 or 10. Again, weigh 1 against 9. If they balance, the different coin is number 10, otherwise it is number 9. That was the easy part. What if the first weighing 1,2,3,4 vs 5,6,7,8 does not balance? Then any one of these coins could be the different coin. Now, in order to proceed, we must keep track of which side is heavy for each of the following weighings. Suppose that 5,6,7,8 is the heavy side. We now weigh 1,5,6 against 2,7,8. If they balance, then the different coin is either 3 or 4. Weigh 4 against 9, a known good coin. If they balance then the different coin is 3, otherwise it is 4. Now, if 1,5,6 vs 2,7,8 does not balance, and 2,7,8 is the heavy side, then either 7 or 8 is a different, heavy coin, or 1 is a different, light coin. For the third weighing, weigh 7 against 8. Whichever side is heavy is the different coin. If they balance, then 1 is the different coin. Should the weighing of 1,5, 6 vs 2,7,8 show 1,5,6 to be the heavy side, then either 5 or 6 is a different heavy coin or 2 is a light different coin. Weigh 5 against 6. The heavier one is the different coin. If they balance, then 2 is a different light coin.", "id": 815}, {"Category": "Brain Teasers", "Riddle": "A great banquet was prepared for a Roman emperor and his courtiers. 22 Dormice, 40 Larks' Tongues, 30 Flamingos and 40 Roast Parrots were served.\n\r\n\nHow many portions of Boiled Ostrich were served?", "_type": "dict", "Heading": "The Banquet", "Answer": "42. Each vowel is worth 2 and each consonant 4, so Dormice gives 22, ect.", "id": 816}, {"Category": "Brain Teasers", "Riddle": "The word F\nA\nC\nE\nT\nIOU\nSL\nY\n contains the six vowels, A-E-I-O-U and Y, \n in their alphabetical order. \n Can you find another English word that does the same?", "_type": "dict", "Heading": "FACETIOUSLY Has The Six Vowels", "Answer": "The word is abstemiously. There may be others.", "id": 817}, {"Category": "Brain Teasers", "Riddle": "It's always 1 to 6, \n it's always 15 to 20, \n it's always 5, \n but it's never 21, \n unless it's flying.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Always & Never", "Answer": "The answer is: a dice. An explanation: \"It's always 1 to 6\": the numbers on the faces of the dice, \"it's always 15 to 20\": the sum of the exposed faces when the dice comes to rest after being thrown, \"it's always 5\": the number of exposed faces when the dice is at rest, \"but it's never 21\": the sum of the exposed faces is never 21 when the dice is at rest, \"unless it's flying\": the sum of all exposed faces when the dice is flying is 21 (1 + 2 + 3 + 4 + 5 + 6).", "id": 818}, {"Category": "Brain Teasers", "Riddle": "A man goes to work at the same time each day and travels part of his journey facing forwards and the remainder facing backwards. When he returns at the end of his working day, he only faces forwards.\n\r\n\nHow can this be?", "_type": "dict", "Heading": "Which Way", "Answer": "He works in the engine room of a liner! To get to work, he walks along the decks from his cabin facing forwards, and down the ladders between decks facing backwards.  However, when he finishes, he only needs to face forwards to climb the ladders again and walk along the deck back to his cabin.", "id": 819}, {"Category": "Brain Teasers", "Riddle": "A boy leaves home in the morning to go to school. At the moment he leaves the house he looks at the clock in the mirror. The clock has no number indication and for this reason the boy makes a mistake in interpreting the time (mirror-image). Just assuming the clock must be out of order, the boy cycles to school, where he arrives after twenty minutes. At that moment the clock at school shows a time that is two and a half hours later than the time that the boy saw on the clock at home.", "_type": "dict", "Heading": "Mirroring Clock", "Answer": "The difference between the real time and the time of the mirror image is two hours and ten minutes (two and a half hours, minus the twenty minutes of cycling). Therefore, the original time on the clock at home that morning could only have been five minutes past seven: The difference between these clocks is exactly 2 hours and ten minutes (note that also five minutes past one can be mirrored in a similar way, but this is not in the morning!). Conclusion: The boy reaches school at five minutes past seven plus twenty minutes of cycling, which is twenty-five minutes past seven!...", "id": 820}, {"Category": "Brain Teasers", "Riddle": "Two cars were involved in an accident in the center of town. The man who was driving a little green car, had overtaken a big black car. The driver had misjudged the distance between him and the on-coming traffic and had to swerve back in, causing the black car to swerve and crash into a shop window. When the occupants of the cars were examined everyone in the green car was okay, but in the black car was one dead man. However, the driver of the green car was not charged with manslaughter, why was this so?", "_type": "dict", "Heading": "Getting Away With Manslaughter", "Answer": "The black car was a hearse and was on its way to a funeral.", "id": 821}, {"Category": "Brain Teasers", "Riddle": "you are stuck in a house\n you have four objects to use\n you have a wooden chair,a ladder\n a piano,and an axe.\n The axe is rubber\n What would you use to get out?? hint* you can't get out with breaking it\n and you can only pick one object.", "_type": "dict", "Heading": "Stuck In A House", "Answer": "you use the piano KEYS!!!!!", "id": 822}, {"Category": "Brain Teasers", "Riddle": "Two travellers spend from 12 o'clock to 6 o'clock walking along a level road, up a hill and back again. Their pace is 4 mph on the level, 3 mph uphill, and 6 mph downhill.\n\r\n\nHow far do they walk and at what time do they reach the top of the hill?", "_type": "dict", "Heading": "Travellers Riddle", "Answer": "24 miles half past three.", "id": 823}, {"Category": "Brain Teasers", "Riddle": "My first is high, My second damp, My whole a tie, A writer's cramp. What am I?", "_type": "dict", "Heading": "Writer's Cramp Riddle", "Answer": "Hyphen. The first two lines yield high-fen. A hyphen is used by a writer to tie (or cramp) two words together.", "id": 824}, {"Category": "Brain Teasers", "Riddle": "Three working women have different careers. If only one of statements 1, 2 and 3 are true, can you tell whether or not Mary is a nurse? 1. This statement is only true if statement 5 is false. 2. This statement is true if statements 4 or 5, or both 4 and 5 are true. 3. This statement is false only if both statements 6 and 1 are true. 4. Mary is a nurse 5. Karen is an artist. 6. Sarah is a photographer.", "_type": "dict", "Heading": "Careers", "Answer": "Mary is not a nurse. The way to solve this riddle, is to consider statements 4, 5, and 6 and create a chart of all possible true and false answers. Next, fill in the chart according to statements 1 through 3. You will discover that there is only one line where only one of statements one, two and three are true. Thus, it is determined that: Statement 4 and 5 are false and statement 6 is true.", "id": 825}]