[{"Category": "Classic Riddles", "Riddle": "The more you take, the more you leave behind. What am I?", "_type": "dict", "Heading": "Take It Or Leave It", "Answer": "Footsteps.", "id": 217}, {"Category": "Classic Riddles", "Riddle": "What 8 letter word can have a letter taken away and it still makes a word. Take another letter away and it still makes a word. Keep on doing that until you have one letter left. What is the word?", "_type": "dict", "Heading": "One Hard Riddle", "Answer": "The word is starting! starting, staring, string, sting, sing, sin, in, I.  Cool,huh?", "id": 218}, {"Category": "Classic Riddles", "Riddle": "What has a head, a tail, is brown, and has no legs?", "_type": "dict", "Heading": "Head And Tail", "Answer": "A Penny.", "id": 219}, {"Category": "Classic Riddles", "Riddle": "Can you name three consecutive days without using the words Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, or Sunday?", "_type": "dict", "Heading": "Three Consecutive Days ", "Answer": "Yesterday, Today, and Tomorrow.", "id": 220}, {"Category": "Classic Riddles", "Riddle": "A doctor and a bus driver are both in love with the same woman, an attractive girl named Sarah. The bus driver had to go on a long bus trip that would last a week. Before he left, he gave Sarah seven apples. Why?", "_type": "dict", "Heading": "In Love", "Answer": "An apple a day keeps the doctor away!", "id": 221}, {"Category": "Classic Riddles", "Riddle": "You live in a one story house made entirely of redwood. What color would the stairs be?", "_type": "dict", "Heading": "What Color?", "Answer": "What stairs? You live in a one-story house.", "id": 222}, {"Category": "Classic Riddles", "Riddle": "A boy was at a carnival and went to a booth where a man said to the boy, \"If I write your exact weight on this piece of paper then you have to give me $50, but if I cannot, I will pay you $50.\" The boy looked around and saw no scale so he agrees, thinking no matter what the carny writes he'll just say he weighs more or less. In the end the boy ended up paying the man $50. How did the man win the bet?", "_type": "dict", "Heading": "Carnival Trick", "Answer": "The man did exactly as he said he would and wrote \"your exact weight\" on the paper.", "id": 223}, {"Category": "Classic Riddles", "Riddle": "What comes once in a minute, twice in a moment, but never in a thousand years?", "_type": "dict", "Heading": "Very Confusing", "Answer": "The letter \"m\".", "id": 224}, {"Category": "Classic Riddles", "Riddle": "What has many keys, but can't even open a single door?", "_type": "dict", "Heading": "The Keys", "Answer": "A piano.", "id": 225}, {"Category": "Classic Riddles", "Riddle": "What is more useful when it is broken?", "_type": "dict", "Heading": "Broken Usefulness", "Answer": "An egg.", "id": 226}, {"Category": "Classic Riddles", "Riddle": "Samuel was out for a walk when it started to rain. He did not have an umbrella and he wasn't wearing a hat. His clothes were soaked, yet not a single hair on his head got wet. How could this happen?", "_type": "dict", "Heading": "Lucky To Be...", "Answer": "This man is bald!", "id": 468}, {"Category": "Classic Riddles", "Riddle": "Re-arrange the letters, O O U S W T D N E J R, to spell just one word. What is it?", "_type": "dict", "Heading": "TRICKY", "Answer": "'Just one word'.", "id": 469}, {"Category": "Classic Riddles", "Riddle": "Two fathers and two sons went fishing one day. They were there the whole day and only caught 3 fish. One father said, that is enough for all of us, we will have one each. How can this be possible?", "_type": "dict", "Heading": "Enough Fish For All IQ Test", "Answer": "There was the father, his son, and his son's son. This equals 2 fathers and 2 sons for a total of 3!", "id": 470}, {"Category": "Classic Riddles", "Riddle": "What can point in every direction but can't reach the destination by itself.", "_type": "dict", "Heading": "A Pointy Riddle", "Answer": "Your finger.", "id": 471}, {"Category": "Classic Riddles", "Riddle": "My life can be measured in hours, I serve by being devoured. Thin, I am quick. Fat, I am slow. Wind is my foe. What am I?", "_type": "dict", "Heading": "Quick, No Time!", "Answer": "I am a candle.", "id": 472}, {"Category": "Classic Riddles", "Riddle": "What is black when you buy it, red when you use it, and gray when you throw it away?", "_type": "dict", "Heading": "Shifting Colors", "Answer": "Charcoal.", "id": 473}, {"Category": "Classic Riddles", "Riddle": "A man rode out of town on Sunday, he stayed a whole night at a hotel and rode back to town the next day on Sunday. How is this possible?", "_type": "dict", "Heading": "Sunday!!", "Answer": "His Horse was called Sunday!", "id": 474}, {"Category": "Classic Riddles", "Riddle": "A bus driver was heading down a street in Colorado. He went right past a stop sign without stopping, he turned left where there was a \"no left turn\" sign, and he went the wrong way on a one-way street. Then he went on the left side of the road past a cop car. Still - he didn't break any traffic laws.  Why not?", "_type": "dict", "Heading": "The Bus Driver Riddle", "Answer": "He was walking...not driving.", "id": 475}, {"Category": "Classic Riddles", "Riddle": "Poor people have it. Rich people need it. If you eat it you die. What is it?", "_type": "dict", "Heading": "Do You Have It?", "Answer": "Nothing.", "id": 476}, {"Category": "Classic Riddles", "Riddle": "A pet shop owner had a parrot with a sign on its cage that said \"Parrot repeats everything it hears\". Davey bought the parrot and for two weeks he spoke to it and it didn't say a word. He returned the parrot but the shopkeeper said he never lied about the parrot.\n\r\n\nHow can this be?", "_type": "dict", "Heading": "Talking Parrot - Dress Up Your Pet Day", "Answer": "The parrot was deaf.", "id": 477}, {"Category": "Classic Riddles", "Riddle": "You have three stoves: a gas stove, a wood stove, and a coal stove, but only one match. Which should you light first?", "_type": "dict", "Heading": "One Match, Three Stoves", "Answer": "The match!", "id": 718}, {"Category": "Classic Riddles", "Riddle": "How many seconds are there in one year?", "_type": "dict", "Heading": "How Many Seconds", "Answer": "A: 12 of them: January 2nd, February 2nd, March 2nd, April 2nd, May 2nd, June 2nd, July 2nd, August 2nd, September 2nd, October 2nd, November 2nd, December 2nd.", "id": 719}, {"Category": "Classic Riddles", "Riddle": "What 7 letter word is spelled the same way backwards and forwards?", "_type": "dict", "Heading": "Palindrome ", "Answer": "Racecar.", "id": 720}, {"Category": "Classic Riddles", "Riddle": "I am full of holes but I can still hold water. What am I?", "_type": "dict", "Heading": "Holey H20", "Answer": "A sponge!", "id": 721}, {"Category": "Classic Riddles", "Riddle": "You walk up to a mountain that has two paths. One leads to the other side of the mountain, and the other will get you lost forever. Two twins know the path that leads to the other side. You can ask them only one question. Except! One lies and one tells the truth, and you don't know which is which. So, What do you ask?", "_type": "dict", "Heading": "Which Path?", "Answer": "You ask each twin What would your brother say?. This works because.... Well let's say the correct path is on the left side. So say you asked the liar \"What would your brother say?\" Well, the liar would know his brother was honest and he would say the left side, but since the liar lies, he would say right. If you asked the honest twin the same question, he would say right, because he knows his brother will lie. Therefore, you would know that the correct path was the left!", "id": 722}, {"Category": "Classic Riddles", "Riddle": "How can you make seven even?", "_type": "dict", "Heading": "Is Seven Even Or Odd?", "Answer": "Remove the letter s.", "id": 723}, {"Category": "Classic Riddles", "Riddle": "If a rooster laid a brown egg and a white egg, what kind of chicks would hatch?", "_type": "dict", "Heading": "Rooster Eggs Brain Challenge", "Answer": "Roosters don't lay eggs.", "id": 724}, {"Category": "Classic Riddles", "Riddle": "One day, the police found a man dead inside a hut. In his left hand, he's holding a gun. In his right hand, he has a recording. When the recording is played, the police hear the man talking about how horrible life is and how he wants it to end. The recording ends with a gunshot. The police are about to call it a suicide until you point out a very important clue. What is it?", "_type": "dict", "Heading": "Goodbye, Cruel World", "Answer": "The recording played a gunshot inside it. If the man committed suicide, he wouldn't have been able to stop the recording after he pulled the trigger.", "id": 725}, {"Category": "Classic Riddles", "Riddle": "Romeo and Juliet are found dead on the floor in a bedroom. When they were discovered, there were pieces of glass and some water on the floor. The only furniture in the room is a shelf and a bed. The house is in a remote location, away from everything except for the nearby railroad track. What caused the death of Romeo and Juliet?", "_type": "dict", "Heading": "The Death Of Romeo And Juliet", "Answer": "Romeo and Juliet are fish. The rumble of the train knocked the tank off the shelf, it broke and Romeo and Juliet did not survive.", "id": 726}, {"Category": "Classic Riddles", "Riddle": "When can you add two to eleven and get one as the correct answer?", "_type": "dict", "Heading": "Number Cycle", "Answer": "When you add two hours to eleven o'clock, you get one o'clock.", "id": 727}, {"Category": "Classic Riddles", "Riddle": "I'm tall when I'm young and I'm short when I'm old. What am I?", "_type": "dict", "Heading": "Tall When Young", "Answer": "Candle or Pencil.", "id": 946}, {"Category": "Classic Riddles", "Riddle": "What 5 letter word typed in all capital letters can be read the same upside down?", "_type": "dict", "Heading": "Reading Upside Down", "Answer": "SWIMS.", "id": 947}, {"Category": "Classic Riddles", "Riddle": "A pregnant lady named her children: Dominique, Regis, Michelle, Fawn, Sophie and Lara. What will she name her next child? Jessica, Katie, Abby or Tilly?", "_type": "dict", "Heading": "Next Name Brain Teaser", "Answer": "Tilly. She seems to follow the scale Do, Re, Me, Fa, So, La, and then Ti.", "id": 948}, {"Category": "Classic Riddles", "Riddle": "I'm not clothes but I cover your body;\n\r\n\nThe more I'm used, the thinner I grow.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "I Cover Your Body", "Answer": "Bar of soap.", "id": 949}, {"Category": "Classic Riddles", "Riddle": "A man was found dead next to a 13 story building. The police say it was a suicide, but you say it was a homicide (someone killed him). To prove this, you go to each floor on the building, open the window, and toss a penny out. You do this to each floor until you reach the 13th floor, open the window, and toss a penny out. How does this prove it wasn't a suicide?", "_type": "dict", "Heading": "Building Riddle", "Answer": "If the man committed suicide, he would've left the window open and you wouldn't have had to open it.", "id": 950}, {"Category": "Classic Riddles", "Riddle": "What is it that given one, you'll have either two or none?", "_type": "dict", "Heading": "Given One", "Answer": "A choice.", "id": 951}, {"Category": "Classic Riddles", "Riddle": "What travels around the world but stays in one spot?", "_type": "dict", "Heading": "Around The World", "Answer": "A stamp.", "id": 952}, {"Category": "Classic Riddles", "Riddle": "I'm white, and used for cutting and grinding. When I'm damaged, humans usually remove me or fill me. For most animals I am a useful tool.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "To Cut And Grind", "Answer": "A tooth!", "id": 953}, {"Category": "Classic Riddles", "Riddle": "Railroad Crossing, look out for the cars. Can you spell that, without any R's?", "_type": "dict", "Heading": "Railroad Crossing", "Answer": "That.", "id": 954}, {"Category": "Classic Riddles", "Riddle": "You use a knife to slice my head and weep beside me when I am dead.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "The Knife", "Answer": "An onion.", "id": 955}, {"Category": "Classic Riddles", "Riddle": "A horse was tied to a rope 5 meters long and the horses food was 15 meters away from the horse. How did the horse reach the food?", "_type": "dict", "Heading": "Horse Food", "Answer": "The rope wasn't tied to anything so he could reach the food.", "id": 1096}, {"Category": "Classic Riddles", "Riddle": "Five apples are in a basket. How do you divide them among five girls so that each girl gets an apple, but one apple remains in the basket?", "_type": "dict", "Heading": "Five Apples", "Answer": "Give the fifth girl her apple in the basket.", "id": 1097}, {"Category": "Classic Riddles", "Riddle": "Until I am measured I am not known, Yet how you miss me when I have flown.  What Am I?", "_type": "dict", "Heading": "I Can Fly Riddle", "Answer": "Time.", "id": 1098}, {"Category": "Classic Riddles", "Riddle": "You can carry it everywhere you go, and it does not get heavy. What is it?", "_type": "dict", "Heading": "Just For You", "Answer": "Your name.", "id": 1099}, {"Category": "Classic Riddles", "Riddle": "When will water stop running downhill?", "_type": "dict", "Heading": "Running Water", "Answer": "When it reaches the bottom.", "id": 1100}, {"Category": "Classic Riddles", "Riddle": "There is a dead man in the middle of a field, nothing is around him and there are no footprints of any sort. There is an unopened package next to him. How did he die? HINT: As he approached the field he knew he was going to die.", "_type": "dict", "Heading": "The Dead Man Riddle", "Answer": "Failed Parachute", "id": 1101}, {"Category": "Classic Riddles", "Riddle": "If you drop me, I'm sure to crack. Give me a smile, and I'll always smile back.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Self Image", "Answer": "A mirror.", "id": 1102}, {"Category": "Classic Riddles", "Riddle": "There is a brother and a sister. The boy wants to visit his father in jail, and the sister wants to visit her mother in the hospital. But they both are not allowed in the jail or hospital. All they have is a gun. What do they do?", "_type": "dict", "Heading": "Weird Family", "Answer": "The boy shoots the girl, and then the boy goes to jail for attempted murder and the girl goes to the hospital due to her injuries.", "id": 1103}, {"Category": "Classic Riddles", "Riddle": "Flat as a leaf, round as a ring; Has two eyes, can't see a thing.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Flat As A Leaf.", "Answer": "A button.", "id": 1104}, {"Category": "Classic Riddles", "Riddle": "Tom and his younger sister were fighting. Their mother was tired of the fighting and decided to punish them by making them stand on the same piece of newspaper in such a way that they couldn't touch each other. How did she accomplish this?", "_type": "dict", "Heading": "Newspaper Divider", "Answer": "Tom's mother slid a newspaper under a door, each sibling standing on each side.", "id": 1105}, {"Category": "Classic Riddles", "Riddle": "I am six letters. When you take one away I am twelve. What am I?", "_type": "dict", "Heading": "Six Then Twelve", "Answer": "The word Dozens.", "id": 1246}, {"Category": "Classic Riddles", "Riddle": "You can see it everyday, But cannot touch it at will. What is it?", "_type": "dict", "Heading": "Untouchable", "Answer": "The sky.", "id": 1247}, {"Category": "Classic Riddles", "Riddle": "A magician was boasting one day at how long he could hold his breath under water. His record was 6 minutes. A kid that was listening said, \"that's nothing, I can stay under water for 10 minutes using no types of equipment or air pockets!\" The magician told the kid if he could do that, he'd give him $10,000. The kid did it and won the money. Can you figure out how?", "_type": "dict", "Heading": "Hey, No Fair!", "Answer": "The kid filled a glass of water and held it over his head for 10 minutes.", "id": 1248}, {"Category": "Classic Riddles", "Riddle": "I'm a god, a planet, and measurer of heat.\n\r\n\nWho am I?", "_type": "dict", "Heading": "I'm A God", "Answer": "Mercury.", "id": 1249}, {"Category": "Classic Riddles", "Riddle": "Tool of thief, toy of queen. Always used to be unseen. Sign of joy, sign of sorrow. Giving all likeness borrowed. What am I?", "_type": "dict", "Heading": "To Be Unseen", "Answer": "A mask.", "id": 1250}, {"Category": "Classic Riddles", "Riddle": "What can go up and come down without moving?", "_type": "dict", "Heading": "No Movement", "Answer": "The temperature.", "id": 1251}, {"Category": "Classic Riddles", "Riddle": "What can hold water even though it has holes?", "_type": "dict", "Heading": "What Holds Water With Holes", "Answer": "A Sponge.", "id": 1252}, {"Category": "Classic Riddles", "Riddle": "A father's child, a mother's child, yet no one's son.\n\r\n\nWho am I?", "_type": "dict", "Heading": "No One's Son?", "Answer": "The daughter.", "id": 1253}, {"Category": "Classic Riddles", "Riddle": "The rungs of a 10 foot ladder attached to a ship are 1 foot apart. If the water is rising at the rate of one foot an hour, how long will it take until the water covers over the ladder?", "_type": "dict", "Heading": "Rungs Of A Ladder", "Answer": "It will never cover the ladder because as the water rises, so will the floating ship.", "id": 1254}, {"Category": "Classic Riddles", "Riddle": "What runs without legs?", "_type": "dict", "Heading": "Brand Riddle", "Answer": "Water.", "id": 1255}, {"Category": "Classic Riddles", "Riddle": "Never resting, never still. Moving silently from hill to hill. It does not walk, run or trot, All is cool where it is not. What is it?", "_type": "dict", "Heading": "Hot Rays", "Answer": "Sunshine.", "id": 1396}, {"Category": "Classic Riddles", "Riddle": "There was a man who was born before his father, killed his mother, and married his sister. Yet, there was nothing wrong with what he had done. Why?", "_type": "dict", "Heading": "I'm A Good Guy!", "Answer": "His father was in front of him when he was born, therefore he was born before him. His mother died while giving birth to him. Finally, he grew up to be a minister and married his sister at her ceremony.", "id": 1397}, {"Category": "Classic Riddles", "Riddle": "A man was found murdered on Sunday morning. His wife immediately called the police. The police questioned the wife and staff and got these alibis: The Wife said she was sleeping. The Cook was cooking breakfast. The Gardener was picking vegetables. The Maid was getting the mail. The Butler was cleaning the closet. The police instantly arrested the murderer. Who did it and how did they know?", "_type": "dict", "Heading": "Murder Suspects!", "Answer": "It was the Maid. She said she was getting the mail. There is no mail on Sunday!", "id": 1398}, {"Category": "Classic Riddles", "Riddle": "What has cities, but no houses; forests, but no trees; and water, but no fish?", "_type": "dict", "Heading": "What Has Cites?", "Answer": "A map.", "id": 1399}, {"Category": "Classic Riddles", "Riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breathe on this terrestrial ball.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "No One Ever Saw Me, Nor Ever Will", "Answer": "Tomorrow.", "id": 1400}, {"Category": "Classic Riddles", "Riddle": "A man was just doing his job when his suit was torn. Why did he die three minutes later?", "_type": "dict", "Heading": "Just Doing His Job", "Answer": "He was an astronaut on a space walk, doing repairs.", "id": 1401}, {"Category": "Classic Riddles", "Riddle": "What is the end of everything?", "_type": "dict", "Heading": "End Of Everything", "Answer": "The letter \"g\".", "id": 1402}, {"Category": "Classic Riddles", "Riddle": "When may a man's coat pocket be empty, and yet have something in it?", "_type": "dict", "Heading": "Empty Pocket", "Answer": "When it has a hole in it.", "id": 1403}, {"Category": "Classic Riddles", "Riddle": "What falls down but never breaks?", "_type": "dict", "Heading": "Breaks", "Answer": "Nightfall.", "id": 1404}, {"Category": "Classic Riddles", "Riddle": "If a chicken says, \"All chickens are liars\". Is the chicken telling the truth?", "_type": "dict", "Heading": "Xcvbnm", "Answer": "Answer: Chickens cannot talk.", "id": 1405}, {"Category": "Classic Riddles", "Riddle": "There is a clerk at the butcher shop, he is five feet ten inches tall, and he wears size 13 sneakers. He has a wife and 2 kids. What does he weigh?", "_type": "dict", "Heading": "What Does He Weigh?", "Answer": "Meat.", "id": 1546}, {"Category": "Classic Riddles", "Riddle": "A plane crashed between the border of Canada and America. Where do you bury the survivors?", "_type": "dict", "Heading": "Plane Crash Riddle", "Answer": "They are survivors, you don't bury them.", "id": 1547}, {"Category": "Classic Riddles", "Riddle": "A group of campers have been on vacation so long, that they've forgotten the day of the week. The following conversation ensues.\n\r\n\nDarryl: What's the day? I don't think it is Thursday, Friday or Saturday.\n\r\n\nTracy: Well that doesn't narrow it down much. Yesterday was Sunday.\n\r\n\nMelissa: Yesterday wasn't Sunday, tomorrow is Sunday.\n\r\n\nBen: The day after tomorrow is Saturday.\n\r\n\nAdrienne: The day before yesterday was Thursday.\n\r\n\nSusie: Tomorrow is Saturday.\n\r\n\nDavid: I know that the day after tomorrow is not Friday.\n\r\n\nIf only one person's statement is true, what day of the week is it?", "_type": "dict", "Heading": "Tell Us The Day!", "Answer": "It is Wednesday. If it was any other day of the week, more than one statement would be true. To solve the riddle, evaluate each person's statement and write down what day it could be according to the statement. David's statement indicates it could be any day of the week except for Wednesday. When you list the days that it could be according to everyone's statement, it turns out Wednesday is the day mentioned only one time. Darryl: Sunday, Monday, Tuesday, or Wednesday Tracy: Monday Melissa: Saturday Ben: Thursday Adrienne: Saturday Susie: Friday David: Sunday, Monday, Tuesday, Thursday, Friday or Saturday", "id": 1548}, {"Category": "Classic Riddles", "Riddle": "I'm so fast you can't see me, though everyone else can see straight through me. I don't stop until the day you die. What am I?", "_type": "dict", "Heading": "Riddle Me This?", "Answer": "The blink of an eye.", "id": 1549}, {"Category": "Classic Riddles", "Riddle": "I am white, black and read all over. What am I?", "_type": "dict", "Heading": "Read All Over", "Answer": "Newspaper!", "id": 1550}, {"Category": "Classic Riddles", "Riddle": "What starts with a T, ends with a T and has T in it?", "_type": "dict", "Heading": "Too Many T's", "Answer": "A teapot.", "id": 1551}, {"Category": "Classic Riddles", "Riddle": "You pick it, You peel the outside, You cook the inside, You eat the outside, And throw away the inside. What am I?", "_type": "dict", "Heading": "Pick It", "Answer": "Corn.", "id": 1552}, {"Category": "Classic Riddles", "Riddle": "A murderer is condemned to death. He has to choose between three rooms. The first is full of raging fires, the second is full of assassins with loaded guns, and the third is full of lions that haven't eaten in 3 years. Which room is safest for him?", "_type": "dict", "Heading": "Three Rooms Riddle", "Answer": "The third. Lions that haven't eaten in three years are dead.", "id": 1553}, {"Category": "Classic Riddles", "Riddle": "Some will use me, while others will not, some have remembered, while others have forgot. For profit or gain, I'm used expertly, I can't be picked off the ground or tossed into the sea. Only gained from patience and time, can you unravel my rhyme? What am I?", "_type": "dict", "Heading": "Smarter Than You", "Answer": "I'm Knowledge.", "id": 1554}, {"Category": "Classic Riddles", "Riddle": "A horse is tied to a five-meter rope in front of an old saloon. Six meters behind the horse is a bale of hay. Without breaking his rope, the horse is able to eat the hay whenever he chooses. \n\r\n\nHow is this possible?", "_type": "dict", "Heading": "Tied Up Horse", "Answer": "The rope is not tied to anything else.", "id": 1555}, {"Category": "Classic Riddles", "Riddle": "A beggar's brother died, but the man who died had no brother.\n\r\n\nHow could that be?", "_type": "dict", "Heading": "The Beggar", "Answer": "The beggar was his sister!", "id": 1696}, {"Category": "Classic Riddles", "Riddle": "What is the best key to a good dinner?", "_type": "dict", "Heading": "Riddle #420", "Answer": "A tur-key.", "id": 1697}, {"Category": "Classic Riddles", "Riddle": "I run through hills; I veer around mountains. I leap over rivers and crawl through the forests. Step out your door to find me.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Step Out Your Door To Find Me", "Answer": "Roads.", "id": 1698}, {"Category": "Classic Riddles", "Riddle": "A man went on a trip with a fox, a goose and a sack of corn. He came upon a stream which he had to cross and found a tiny boat to use to cross the stream. He could only take himself and one other - the fox, the goose, or the corn - one at a time. He could not leave the fox alone with the goose or the goose alone with the corn. How does he get all safely over the stream?", "_type": "dict", "Heading": "A Fox, A Goose And A Sack Of Corn", "Answer": "Take the goose over first and come back. Then take the fox over and bring the goose back. Now take the corn over and come back alone to get the goose. Take the goose over and the job is done!", "id": 1699}, {"Category": "Classic Riddles", "Riddle": "I dig out tiny caves and store gold and silver in them. I also build bridges of silver and make crowns of gold. They are the smallest you could imagine. Sooner or later everybody needs my help, yet many people are afraid to let me help them. Who am I?", "_type": "dict", "Heading": "Everyone Hates Me", "Answer": "I am a Dentist.", "id": 1700}, {"Category": "Classic Riddles", "Riddle": "Pick a number from 1-10, multiply it by 2, add ten, divide it by 2, now subtract the number that you have from the number you picked. What is it?", "_type": "dict", "Heading": "Reading Your Mind", "Answer": "Do you have 5?", "id": 1701}, {"Category": "Classic Riddles", "Riddle": "There are 2 cops parked along a one-way street looking for traffic violations. They spot a taxi driver going in the wrong direction, yet they do nothing.\n\r\n\nWhy?", "_type": "dict", "Heading": "Traffic Violations", "Answer": "The taxi driver wasn't driving at the time, he was walking.", "id": 1702}, {"Category": "Classic Riddles", "Riddle": "Mountains will crumble and temples will fall, and no man can survive its endless call. What is it?", "_type": "dict", "Heading": "Everlasting Things", "Answer": "Time.", "id": 1703}, {"Category": "Classic Riddles", "Riddle": "If it takes 5 microwaves 5 minutes to cook 5 chickens, how long does it take 100 microwaves to cook 100 chickens?", "_type": "dict", "Heading": "Chicken Riddles", "Answer": "5 minutes. We can assume that one chicken is placed in each microwave and that each chicken takes 5 minutes to cook.", "id": 1704}, {"Category": "Classic Riddles", "Riddle": "Glittering points that downward thrust, sparkling spears that never rust.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Sparkling Spear", "Answer": "An Icicle.", "id": 1705}, {"Category": "Classic Riddles", "Riddle": "Lighter than what I am made of, More of me is hidden Than is seen. What am I?", "_type": "dict", "Heading": "Hidden Weight", "Answer": "An iceberg.", "id": 1824}, {"Category": "Classic Riddles", "Riddle": "I'm like a doll, But I'm not for playing; \nI stand up straight, but if windy I may be laying; \nI'm well-known and famous for having no brain; \nI work outside both day and night in sunshine or in rain. \n\r\n\nWhat am I?", "_type": "dict", "Heading": "Like A Doll ", "Answer": "A Scarecrow.", "id": 1825}, {"Category": "Classic Riddles", "Riddle": "It runs and runs but can never flee. It is often watched, yet never sees. When long it brings boredom, When short it brings fear.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Runs But Can Never Flee", "Answer": "Time, which is often watched when you stare at a clock.", "id": 1826}, {"Category": "Classic Riddles", "Riddle": "The more there is the less you see. What is it?", "_type": "dict", "Heading": "Think Literally", "Answer": "Fog.", "id": 1827}, {"Category": "Classic Riddles", "Riddle": "What has to be taken before you can get it?", "_type": "dict", "Heading": "What Has Been Taken", "Answer": "Your picture.", "id": 1828}, {"Category": "Classic Riddles", "Riddle": "You can't see me, but I can see you; To be more specific, I see through. What am I?", "_type": "dict", "Heading": "I See Through", "Answer": "An X-Ray.", "id": 1829}, {"Category": "Classic Riddles", "Riddle": "They fill me up and you empty me, almost everyday; if you raise my arm, I work the opposite way. What am I?", "_type": "dict", "Heading": "Opposite Way", "Answer": "A mailbox.", "id": 1830}, {"Category": "Classic Riddles", "Riddle": "I have no voice and yet I speak to you, I tell of all things in the world that people do. I have leaves, but I am not a tree, I have pages, but I am not a bride or royalty. I have a spine and hinges, but I am not a man or a door, I have told you all, I cannot tell you more. What am I?", "_type": "dict", "Heading": "Read My Lips", "Answer": "A Book.", "id": 1831}, {"Category": "Classic Riddles", "Riddle": "If you're 8 feet away from a door and with each move you advance half the distance to the door. How many moves will it take to reach the door?", "_type": "dict", "Heading": "Advance Half The Distance?", "Answer": "Infinity! Technically you will never reach the door, as you can only move half the distance, no matter how small.", "id": 1832}, {"Category": "Classic Riddles", "Riddle": "The more of these you take, the more appear behind you.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "More Appear", "Answer": "Steps.", "id": 1833}, {"Category": "Classic Riddles", "Riddle": "How do you spell hard water with three letters?", "_type": "dict", "Heading": "Hard Water", "Answer": "Ice.", "id": 1934}, {"Category": "Classic Riddles", "Riddle": "Lovely and round, I shine with pale light, grown in the darkness, A lady's delight. What am I?", "_type": "dict", "Heading": "A Lady's Delight Riddle", "Answer": "A Pearl.", "id": 1935}, {"Category": "Classic Riddles", "Riddle": "Pronounced as one letter, And written with three, Two letters there are, And two only in me. I'm double, I'm single, I'm black, blue, and gray, I'm read from both ends, And the same either way. What am I?", "_type": "dict", "Heading": "Same Either Way", "Answer": "An eye.", "id": 1936}, {"Category": "Classic Riddles", "Riddle": "The leaves are on the fruit, The fruits is on the leaves.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Leaves On Fruit, Fruit On Leaves", "Answer": "A pineapple.", "id": 1937}, {"Category": "Classic Riddles", "Riddle": "I look flat, but I am deep, Hidden realms I shelter. Lives I take, but food I offer. At times I am beautiful. I can be calm, angry and turbulent. I have no heart, but offer pleasure as well as death. No man can own me, yet I encompass what all men must have. What am I?", "_type": "dict", "Heading": "Flat, Yet Deep", "Answer": "An ocean.", "id": 1938}, {"Category": "Classic Riddles", "Riddle": "My voice is tender, my waist is slender and I'm often invited to play. Yet wherever I go I must take my bow or else I have nothing to say. What am I?", "_type": "dict", "Heading": "Tender Voiced", "Answer": "A violin.", "id": 1939}, {"Category": "Classic Riddles", "Riddle": "I have four wings, but cannot fly, I never laugh and never cry; On the same spot I'm always found, toiling away with little sound. What am I?", "_type": "dict", "Heading": "Four Wings Around", "Answer": "A Windmill.", "id": 1940}, {"Category": "Classic Riddles", "Riddle": "I am two-faced but bare only one, I have no legs but travel widely. Men spill much blood over me, kings leave there imprint on me. I have greatest power when given away, yet lust for me keeps me locked away.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Lust Keeps Me Locked Away", "Answer": "A Coin.", "id": 1941}, {"Category": "Classic Riddles", "Riddle": "There is a bus full of people travelling over San Francisco and no one gets off the bus throughout the journey. But when it gets to the other side there is not a single person left. How is this possible?", "_type": "dict", "Heading": "Bus Full", "Answer": "They are all married.", "id": 1942}, {"Category": "Classic Riddles", "Riddle": "A husband was called by the police telling him that his wife was killed and that he should get to the crime scene as soon as possible. Shocked, the husband dropped the phone and drove to the crime scene in 20 minutes, where he was arrested and charged for murder. How did the police know it was him?", "_type": "dict", "Heading": "Arrested", "Answer": "The police told him to get to the crime scene, but they didn't specify where. The husband couldn't have known where the crime scene was unless he'd been there when the wife was dead or dying.", "id": 1943}, {"Category": "Classic Riddles", "Riddle": "Why should you never iron a 4-leaf clover?", "_type": "dict", "Heading": "Lucky Clover", "Answer": "You don't want to press your luck!", "id": 2039}, {"Category": "Classic Riddles", "Riddle": "If a dog is tied to a piece of rope that is 6m long, how can he reach a bone that is 7m away?", "_type": "dict", "Heading": "If A Dog Is Tied To A Piece Of Rope Riddle", "Answer": "The other end is not tied to anything.", "id": 2040}, {"Category": "Classic Riddles", "Riddle": "With pointed fangs it sits in wait, With piercing force its doles out fate, Over bloodless victims proclaiming its might, Eternally joining in a single bite. What am I?", "_type": "dict", "Heading": "With Pointed Fangs It Sits In Wait... What Am I?", "Answer": "I'm a Stapler.", "id": 2041}, {"Category": "Classic Riddles", "Riddle": "What demands an answer, but asks no question?", "_type": "dict", "Heading": "Get The Message?", "Answer": "A Telephone.", "id": 2042}, {"Category": "Classic Riddles", "Riddle": "You're in a magical bathroom with no windows and the only way things can get in and out is by an open door. You decide to have a bath so you turn on the tap, you shut the door and the handle breaks so you can't open it, you then turn off the tap and the knob breaks so water keeps coming. How do you save yourself from drowning?", "_type": "dict", "Heading": "Trapped!", "Answer": "Pull out the plug in the bath.", "id": 2043}, {"Category": "Classic Riddles", "Riddle": "What English word has three consecutive double letters?", "_type": "dict", "Heading": "Double Letters", "Answer": "Bookkeeper.", "id": 2044}, {"Category": "Classic Riddles", "Riddle": "What has 88 teeth but never brushes them?", "_type": "dict", "Heading": "88 Teeth", "Answer": "A Piano.", "id": 2045}, {"Category": "Classic Riddles", "Riddle": "I went into the woods and got it. I sat down to seek it. I brought it home with me because I couldn't find it.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Can't Find It", "Answer": "A splinter.", "id": 2046}, {"Category": "Classic Riddles", "Riddle": "Two men are in a desert. They both have packs on. One of the guys is dead. The guy who is alive has his pack open, the guy who is dead has his pack closed. What is in the pack?", "_type": "dict", "Heading": "In His Pack", "Answer": "A parachute (that didn't open)", "id": 2047}, {"Category": "Classic Riddles", "Riddle": "You are a bus driver at a station. 10 get on the bus and no one gets off. You drive 10 miles to another station where 3 people get on and 1 gets off. You drive another 10 miles only to get 25 people on and 5 people go off. Next you drive 3 miles while 12 people exit the bus. You drive back to the place knowing that a couple more stops along the way untill the ride is done. At the 2nd to last station 5 people get on and 2 get off. And at the last station (5.5 miles) 25 people get on for no reason and 1 gets off. What is the bus drivers eye color?", "_type": "dict", "Heading": "Bus Driver", "Answer": "Brown/blue/green (i don't know how i would put it though so if you guessed your eye color you got it right :) )", "id": 2048}, {"Category": "Classic Riddles", "Riddle": "What building has the most stories?", "_type": "dict", "Heading": "Tallest Buildings", "Answer": "The library.", "id": 2135}, {"Category": "Classic Riddles", "Riddle": "I'm made of eight letters,\n\r\n\nBut hold a ninth inside;\n\r\n\nPay a very small fee,\n\r\n\nAnd send me for a ride.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Send Me For A Ride", "Answer": "An Envelope.", "id": 2136}, {"Category": "Classic Riddles", "Riddle": "Squeeze me and I cry tears as red as flesh, but my heart is made of stone.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Tears As Red As Flesh ", "Answer": "A cherry.", "id": 2137}, {"Category": "Classic Riddles", "Riddle": "No legs have I to dance, \n No lungs have I to breathe, \n No life have I to live or die \n And yet I do all three. \n What am I?", "_type": "dict", "Heading": "No Legs Have I To Dance", "Answer": "Fire.", "id": 2138}, {"Category": "Classic Riddles", "Riddle": "A hole leading in, a hole leading out, we connect to a cavern that is slimy all throughout. \n\r\n\nWhat are we?", "_type": "dict", "Heading": "The Holes", "Answer": "A nose.", "id": 2139}, {"Category": "Classic Riddles", "Riddle": "A cop was walking past a restaurant when he heard someone scream - \"No John, not the gun!\" He ran inside and and saw a doctor, a lawyer, a milkman, and a dead body on the floor. He promptly walked over to the milkman and arrested him. He didn't witness the shooting and there was no apparent evidence to prove who shot the person and no one told him who the killer was.\n\r\n\nHow did the policeman instantly know it was the milkman?", "_type": "dict", "Heading": "The Doctor,a Lawyer And A Milkman.", "Answer": "The milkman was the only male. The doctor and lawyer were females, so the cop knew that \"John\" was the milkman.", "id": 2140}, {"Category": "Classic Riddles", "Riddle": "Marble walls as white as milk, lined with skin as soft as silk, in a fountain crystal clear, a golden apple will appear, there is no key to this stronghold, yet theives break in and steal the gold. What is it?", "_type": "dict", "Heading": "White As Milk", "Answer": "An egg.", "id": 2141}, {"Category": "Classic Riddles", "Riddle": "This thing runs but cannot walk, sometimes sings but never talks. Lacks arms, has hands; lacks a head but has a face. What is it?", "_type": "dict", "Heading": "Spinning Hand", "Answer": "A Clock.", "id": 2142}, {"Category": "Classic Riddles", "Riddle": "A word I know, six letters it contains. Subtract just one, and twelve is what remains. What is the word?", "_type": "dict", "Heading": "Subtract One", "Answer": "Dozens!", "id": 2143}, {"Category": "Classic Riddles", "Riddle": "The cost of making only the maker knows, Valueless if bought, but sometimes traded. A poor man may give one as easily as a king. When one is broken pain and deceit are assured. What am I?", "_type": "dict", "Heading": "A Poor Man May Give One", "Answer": "A Promise.", "id": 2144}, {"Category": "Classic Riddles", "Riddle": "I am big on Saturday and Sunday. Small on Tuesday, Wednesday, and Thursday. I'm not on Monday or Friday. What am I?", "_type": "dict", "Heading": "Sizes", "Answer": "The letter S.", "id": 2218}, {"Category": "Classic Riddles", "Riddle": "What falls but never breaks? What breaks but never falls?", "_type": "dict", "Heading": "Breaks But Never Falls", "Answer": "Night and Day!", "id": 2219}, {"Category": "Classic Riddles", "Riddle": "This thing devours all things. All man, all beasts, all flowers and trees. Even the fiery sun, and the shadowy moon, will one day be devoured by this thing. Stone it grinds, metal it bites. And it shall make wood rot. Is it powerful? Well it is rather not, but it kills powerful things a lot. Its immortal yet it is not some type of god. What is it?", "_type": "dict", "Heading": "The Devourer", "Answer": "Time.", "id": 2220}, {"Category": "Classic Riddles", "Riddle": "In a stable there are men and horses. In all, there are 22 heads and 72 feet. How many men and how many horses are in the stable?", "_type": "dict", "Heading": "In The Stable", "Answer": "14 horses and 8 men. 14x4 plus 8x2 = 72 feet.", "id": 2221}, {"Category": "Classic Riddles", "Riddle": "What bird can be heard at mealtimes?", "_type": "dict", "Heading": "Birds Are Loud", "Answer": "A swallow.", "id": 2222}, {"Category": "Classic Riddles", "Riddle": "I'm in the book, but not on any leaf; \nI'm in the mouth, but not in lip or teeth; \nI'm in the atmosphere, but never in the air; \nI wait on every one, but never on a pair; \nI am with you wherever you may go; \nAnd every thing you do I’m sure to know; \nThough when you did it I should not be there, \nYet when ’twas done, you’d find me in the chair.\nWhat am I?", "_type": "dict", "Heading": "Guess Who I Am", "Answer": "The letter \"O\".", "id": 2223}, {"Category": "Classic Riddles", "Riddle": "A man builds a house with all 4 sides facing south. A bear walks past the house. What color is the bear?", "_type": "dict", "Heading": "Color Of The Bear", "Answer": "White, the house is built directly on the North Pole.", "id": 2224}, {"Category": "Classic Riddles", "Riddle": "A rich person doesn't need it A poor person has it And if you eat it you will die. What is it?", "_type": "dict", "Heading": "Needs", "Answer": "Nothing.", "id": 2225}, {"Category": "Classic Riddles", "Riddle": "What's the least number of chairs you would need around a table to sit four fathers, two grandfathers, and four sons?", "_type": "dict", "Heading": "Number Of Chairs", "Answer": "Four. The four fathers could be grandfathers and are definitely sons already.", "id": 2226}, {"Category": "Classic Riddles", "Riddle": "If a train was on its way to Florida and it tipped over, where would they bury the survivors?", "_type": "dict", "Heading": "Tipped Over Train", "Answer": "They wouldn't need to, the survivors are still alive!", "id": 2227}, {"Category": "Classic Riddles", "Riddle": "With pointed fangs it sits in wait, \n With piercing force its doles out fate, \n Over bloodless victims proclaiming its might, \n Eternally joining in a single bite. \n What am I?", "_type": "dict", "Heading": "With Pointed Fangs It Sits In Wait,", "Answer": "A Stapler.", "id": 2298}, {"Category": "Classic Riddles", "Riddle": "If you break me I do not stop working, \nIf you touch me I may be snared, \nIf you lose me nothing will matter. \nWhat am I?", "_type": "dict", "Heading": "Don't Break Me Brain Challenge", "Answer": "Your heart.", "id": 2299}, {"Category": "Classic Riddles", "Riddle": "If there is a Yellow house on Bluebird Lane, a Green house on Orange Street, a Pink house on Kitten Road, a Black house on Whitehorse Pike and a Purple house on Firebird hill, where is the White house?", "_type": "dict", "Heading": "Where's The White House?", "Answer": "Washington, D.C.", "id": 2300}, {"Category": "Classic Riddles", "Riddle": "You're both in and outside of me; You guide me but don't ride me; I can make a statement with a tongue but no mouth. What am I?", "_type": "dict", "Heading": "Tongue But No Mouth ", "Answer": "Shoes.", "id": 2301}, {"Category": "Classic Riddles", "Riddle": "You are on an island in the middle of a lake. The lake is in a remote part of the country and there has never been a bridge connecting the island to the mainland. Every day a tractor and wagon gives hay rides around the island. Puzzled as to how the tractor had gotten onto the island, you ask around and find out that the tractor was not transported to the island by boat or by air. Nor was it built on the island. Explain how the tractor got there?", "_type": "dict", "Heading": "Hay Rides", "Answer": "It was driven over in winter, when the lake was frozen.", "id": 2302}, {"Category": "Classic Riddles", "Riddle": "A man went on a trip with a fox, a goose and a sack of corn. He came upon a stream which he had to cross and found a tiny boat to use to cross the stream. He could only take himself and one other - the fox, the goose, or the corn - at a time. He could not leave the fox alone with the goose or the goose alone with the corn.\n\r\n\nHow does he get all safely over the stream?", "_type": "dict", "Heading": "Fox, Goose And A Sack Of Corn", "Answer": "Take the goose over first and come back. Then take the fox over and bring the goose back. Now take the corn over and come back alone to get the goose. Take the goose over and the job is done!", "id": 2303}, {"Category": "Classic Riddles", "Riddle": "I turn around once. What is out will not get in. I turn around again. What is in will not get out. What am I?", "_type": "dict", "Heading": "In And Out", "Answer": "A Key.", "id": 2304}, {"Category": "Classic Riddles", "Riddle": "It goes up, but at the same time goes down. Up toward the sky, and down toward the ground. It's present tense and past tense too, come for a ride, just me and you. What is it?", "_type": "dict", "Heading": "Up Down Past Present", "Answer": "A See-Saw.", "id": 2305}, {"Category": "Classic Riddles", "Riddle": "I move without wings, between silken strings, I leave as you find, my substance behind.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Between Silken Strings", "Answer": "A Spider.", "id": 2306}, {"Category": "Classic Riddles", "Riddle": "I am born in fear, raised in truth, and I come to my own in deed. When comes a time that I'm called forth, I come to serve the cause of need.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Born In Fear", "Answer": "Courage.", "id": 2307}, {"Category": "Classic Riddles", "Riddle": "Trains travel from one town to another town all day, always on the same track, always going nonstop and at the same speed. The noon train took 80 minutes to complete the trip, but the 4 PM train took an hour and 20 minutes. Why?", "_type": "dict", "Heading": "Trains", "Answer": "80 minutes is the same as an hour and 20 minutes.", "id": 2376}, {"Category": "Classic Riddles", "Riddle": "A pipe, a carrot, and a couple sticks are lying together in a field. Why?", "_type": "dict", "Heading": "Pipe, Carrot, And Sticks", "Answer": "They're what is left of a melted snowman.", "id": 2377}, {"Category": "Classic Riddles", "Riddle": "Heart of stone within a tree, I’ll help your words to outlive thee. But if you push me as I stand, the more I move, the less I am. What am I?", "_type": "dict", "Heading": "Heart Of Stone", "Answer": "A pencil.", "id": 2378}, {"Category": "Classic Riddles", "Riddle": "I can travel from there to here by disappearing, and here to there by reappearing.  What am I?", "_type": "dict", "Heading": "From There To Here", "Answer": "The letter \"T\".", "id": 2379}, {"Category": "Classic Riddles", "Riddle": "My thunder comes before the lightning; My lightning comes before the clouds; My rain dries all the land it touches. What am I?", "_type": "dict", "Heading": "Rain That Dries", "Answer": "A volcano.", "id": 2380}, {"Category": "Classic Riddles", "Riddle": "Two dogs are sitting on a porch - a fat dog and a thin dog. The little dog is the son of the fat dog, but the fat dog is not the father of the thin dog. Can you explain?", "_type": "dict", "Heading": "Fat And Thin Dogs ", "Answer": "The fat dog is the mother.", "id": 2381}, {"Category": "Classic Riddles", "Riddle": "Which one of Santa's reindeer do you see at a competition?", "_type": "dict", "Heading": "Christmas Riddle", "Answer": "Dancer.", "id": 2382}, {"Category": "Classic Riddles", "Riddle": "I say everything I hear to others around. I'm not an animal, nor part of the human race. I will, immediately, repeat after you; But only if my tail is in place. What am I?", "_type": "dict", "Heading": "Repeat After Me", "Answer": "A microphone.", "id": 2383}, {"Category": "Classic Riddles", "Riddle": "If you drop the soap on the floor, is the floor clean or the soap dirty?", "_type": "dict", "Heading": "Soap Dirty Or Floor Clean", "Answer": "It depends on the floor.", "id": 2384}, {"Category": "Classic Riddles", "Riddle": "Almost everyone sees me without noticing me, For what is beyond is what he or she seeks. What am I?", "_type": "dict", "Heading": "Unnoticed", "Answer": "A window.", "id": 2385}, {"Category": "Classic Riddles", "Riddle": "What goes through a door but never goes in or comes out?", "_type": "dict", "Heading": "Never Goes In Or Out A Door", "Answer": "A keyhole.", "id": 2436}, {"Category": "Classic Riddles", "Riddle": "We capture light, and yet we don't. We reflect rays of sun, and yet we don't. Without us all the world is gray and dull for everyone.\n\r\n\nWhat are we?", "_type": "dict", "Heading": "Capturing Light", "Answer": "Colors.", "id": 2437}, {"Category": "Classic Riddles", "Riddle": "If you feed me, I live, but if you water me, I die. What am I?", "_type": "dict", "Heading": "If You Feed Me", "Answer": "A Fire", "id": 2438}, {"Category": "Classic Riddles", "Riddle": "Late afternoons I often bathe. I'll soak in water piping hot. My essence goes through my see through clothes. Used up am I; I've gone to pot. What am I?", "_type": "dict", "Heading": "In Piping Hot Water", "Answer": "I'm a tea bag!", "id": 2439}, {"Category": "Classic Riddles", "Riddle": "I have two arms, but fingers none. I have two feet, but cannot run. I carry well, but I have found I carry best with my feet OFF the ground. What am I?", "_type": "dict", "Heading": "I Can Move Riddle", "Answer": "A Wheelbarrow.", "id": 2440}, {"Category": "Classic Riddles", "Riddle": "Two sentries were on duty outside a barracks. One faced up the road to watch for anyone approaching from the North. The other looked down the road to see if anyone approached from the South. Suddenly one of them said to the other, \"Why are you smiling?\" How did he know that his companion was smiling?", "_type": "dict", "Heading": "Sentries", "Answer": "Although the guards were looking in opposite directions, they were not back to back. They were facing each other.", "id": 2441}, {"Category": "Classic Riddles", "Riddle": "You go in me for brushing, \n\r\n\nFor flushing, \n\r\n\nFor rushing; \n\r\n\nBut please go in me one at a time, \n\r\n\nOr someone might be blushing. \n\r\n\nWhat am I?", "_type": "dict", "Heading": "One At A Time", "Answer": "A bathroom.", "id": 2442}, {"Category": "Classic Riddles", "Riddle": "I can slash but I have no knife, I can dash but I have no legs, I can pound but I have no hammer, I can star but I have no stage.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Star Without A Stage", "Answer": "A Keyboard.", "id": 2443}, {"Category": "Classic Riddles", "Riddle": "A man goes out drinking every night, returning to his home in the wee hours of every morning. No matter how much he drinks, he never gets a hangover. This drink is very well known, but is rarely consumed, served warm and taken straight from its source. The man is a sucker for a free drink, especially since he can't live without it. What is his favorite drink?", "_type": "dict", "Heading": "You Enjoy That?", "Answer": "Blood, he's a vampire!", "id": 2444}, {"Category": "Classic Riddles", "Riddle": "One word in this sentence is misspelled. What word is it?", "_type": "dict", "Heading": "Not Spelled Right", "Answer": "MISSPELLED. It isn't spelled wrong, the one word in this sentence IS \"misspelled.\"", "id": 2445}, {"Category": "Classic Riddles", "Riddle": "I am weightless, but you can see me. Put me in a bucket, and I'll make it lighter. What am I?", "_type": "dict", "Heading": "Weightless", "Answer": "A hole.", "id": 2496}, {"Category": "Classic Riddles", "Riddle": "When I am filled I can point the way, When I am empty nothing moves me, I have two skins, one without and one within. What am I?", "_type": "dict", "Heading": "Without And Within", "Answer": "I am a glove.", "id": 2497}, {"Category": "Classic Riddles", "Riddle": "What does man love more than life Fear more than death or mortal strife What the poor have, the rich require, and what contented men desire, What the miser spends and the spendthrift saves And all men carry to their graves?", "_type": "dict", "Heading": "And What's Higher Than God...Riddle", "Answer": "Nothing.", "id": 2498}, {"Category": "Classic Riddles", "Riddle": "Two words, my answer is only two words. To keep me, you must give me.", "_type": "dict", "Heading": "Give Me To Keep Me", "Answer": "\"Your word\".", "id": 2499}, {"Category": "Classic Riddles", "Riddle": "What never gets any wetter, no matter how much it rains?", "_type": "dict", "Heading": "Never Gets Wetter", "Answer": "The sea.", "id": 2500}, {"Category": "Classic Riddles", "Riddle": "In spring I am gay in handsome array; in summer more clothing I wear; when colder it grows I fling off my clothes; and in winter quite naked appear. What am I?", "_type": "dict", "Heading": "Changing And Changing", "Answer": "A Tree.", "id": 2501}, {"Category": "Classic Riddles", "Riddle": "What has no hands but might knock on your door, and if it does you better open up?", "_type": "dict", "Heading": "Knock, Knock.", "Answer": "Opportunity.", "id": 2502}, {"Category": "Classic Riddles", "Riddle": "What is that which every one can divide, but no one can see where it has been divided?", "_type": "dict", "Heading": "Division Riddle", "Answer": "Water.", "id": 2503}, {"Category": "Classic Riddles", "Riddle": "Two words, my answer is only two words. To keep me, you must give me. What am I?", "_type": "dict", "Heading": "Two Words", "Answer": "Your word.", "id": 2504}, {"Category": "Classic Riddles", "Riddle": "The marathon man timed himself and found out that if he wore a bright white outfit he ran 20 miles in 80 minutes, but when he wore a dark outfit, he ran 20 miles in one hour and twenty minutes. What does this mean for his next race?", "_type": "dict", "Heading": "Marathon Man", "Answer": "Absolutely nothing, as 80 minutes equals an hour and twenty minutes.", "id": 2505}, {"Category": "Classic Riddles", "Riddle": "Three lives have I. Gentle enough to soothe the skin, Light enough to caress the sky, Hard enough to crack rocks. What am I?", "_type": "dict", "Heading": "Three Lives Riddle", "Answer": "I am Water.", "id": 2556}, {"Category": "Classic Riddles", "Riddle": "There once was an evil wizard. He took 3 woman from their homes and turned them into rose bushes that looked exactly alike. He put them in his garden. One of the woman had a husband and children and begged the wizard to let her see them. He agreed. At night, he brought the woman to her house. In the morning he came and took her home. One day the husband decided to go rescue her. So he snuck into the wizard's garden. He looked and looked at the 3 identical rose bushes trying to figure out which could be his wife. Suddenly, he knew the answer and he took his wife home. How did he know which rose bush was his wife?", "_type": "dict", "Heading": "Three Rose Bushes", "Answer": "The wizard brought the rosebush to her home at night and returned her to the garden in the morning. Therefore, she was the only plant without dew.", "id": 2557}, {"Category": "Classic Riddles", "Riddle": "Sometimes I move fast,\n\r\n\nSometimes I move slow;\n\r\n\nBut my speed is truly constant,\n\r\n\nAnd nowhere I go.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Truly Constant", "Answer": "Time.", "id": 2558}, {"Category": "Classic Riddles", "Riddle": "I am the only thing that always tells the truth. I show off everything that I see. I come in all shapes and sizes. So tell me what I must be! What am I?", "_type": "dict", "Heading": "All Shapes And Sizes", "Answer": "I must be a mirror, of course.", "id": 2559}, {"Category": "Classic Riddles", "Riddle": "Often held but never touched, always wet but never rusts, often bites but seldom bit, to use me well you must have wit.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Held But Never Touched", "Answer": "Your tongue.", "id": 2560}, {"Category": "Classic Riddles", "Riddle": "You throw me away, I find my way back; Traditionally I'm wooden, With an arch in my back. What am I?", "_type": "dict", "Heading": "I Find My Way Back", "Answer": "A Boomerang.", "id": 2561}, {"Category": "Classic Riddles", "Riddle": "What has 4 legs when it is young, 2 legs when its not old but is about to be, and has 3 legs when it is old. What am I?", "_type": "dict", "Heading": "Ages Of Evolution", "Answer": "I am a human. I crawl on 4 legs when I am a baby I walk on 2 legs when I am an adult, and I have a cane while walking when I am old.", "id": 2562}, {"Category": "Classic Riddles", "Riddle": "What is often returned but never borrowed?", "_type": "dict", "Heading": "You're Welcome", "Answer": "Thanks.", "id": 2563}, {"Category": "Classic Riddles", "Riddle": "You are in a cold room and you want to get warm. How do you get warm?", "_type": "dict", "Heading": "Trying To Get Warm", "Answer": "Go into the corner. It's always 90 degrees.", "id": 2564}, {"Category": "Classic Riddles", "Riddle": "I am always hungry, I must always be fed, The finger I lick Will soon turn red.", "_type": "dict", "Heading": "Hungry For...", "Answer": "I am Fire.", "id": 2565}, {"Category": "Classic Riddles", "Riddle": "There was a green house. \n Inside the green house there was a white house \n Inside the white house there was a red house. \n Inside the red house there were lots of babies \n What am I?", "_type": "dict", "Heading": "Lots Of Houses Lots Of Babies", "Answer": "A watermelon.", "id": 2616}, {"Category": "Classic Riddles", "Riddle": "Mary's father has five children. They are Nana, Nene, Nini, and Nono.\n\r\n\nWhat is the fifth childs name?", "_type": "dict", "Heading": "Father Of 5 Children", "Answer": "Mary.", "id": 2617}, {"Category": "Classic Riddles", "Riddle": "Rock and roll, rock and roll.\n\r\n\nWhat rocks but does not roll?", "_type": "dict", "Heading": "Rock And Roll", "Answer": "A Rocking chair", "id": 2618}, {"Category": "Classic Riddles", "Riddle": "The cost of making only the maker knows, Valueless if bought, but sometimes traded. A poor man may give one as easily as a king. When one is broken pain and deceit are assured. What is it?", "_type": "dict", "Heading": "What Am I Riddle - Valueless", "Answer": "Promise.", "id": 2619}, {"Category": "Classic Riddles", "Riddle": "Used to threaten, used to defeat. Sometimes it grows, sometimes it shrinks. Used to conquer, used to protect. It marks your downfall, it marks your success. The true god of war, the creator of mess. What is it?", "_type": "dict", "Heading": "The God Of War", "Answer": "Power.", "id": 2620}, {"Category": "Classic Riddles", "Riddle": "At the sound of me, men may dream, Or stamp their feet. At the sound of me, women may laugh, Or sometimes weep. What am I?", "_type": "dict", "Heading": "I Play Emotions Riddle", "Answer": "I am Music!", "id": 2621}, {"Category": "Classic Riddles", "Riddle": "I make you weak at the worst of all times. I keep you safe, I keep you fine. I make your hands sweat, and your heart grow cold, I visit the weak, but seldom the bold. What am I?", "_type": "dict", "Heading": "Brave Enough?", "Answer": "Your fears.", "id": 2622}, {"Category": "Classic Riddles", "Riddle": "My tongue is long, my breath is strong, \nAnd yet I breed no strife; \nMy voice you hear both far and near, \nAnd yet I have no life.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Hear My Voice", "Answer": "A bell.", "id": 2623}, {"Category": "Classic Riddles", "Riddle": "Poke your fingers in my eyes and I will open wide my jaws. Linen cloth, quills, or paper, my greedy lust devours them all. What am I?", "_type": "dict", "Heading": "Greedy Lust", "Answer": "Shears, or scissors.", "id": 2624}, {"Category": "Classic Riddles", "Riddle": "Which word in the English language becomes shorter when it is lengthened?", "_type": "dict", "Heading": "Shorter Word Challenge", "Answer": "Short.", "id": 2625}, {"Category": "Classic Riddles", "Riddle": "Duels of good and evil, \n A fighter of good am I, \n Revealed beside watched words, \n King of the black night sky. \n \n What am I?", "_type": "dict", "Heading": "A Clever Word Riddle", "Answer": "The dark.", "id": 2676}, {"Category": "Classic Riddles", "Riddle": "What's the difference between a jeweler and a jailer?", "_type": "dict", "Heading": "Our Jobs", "Answer": "A jeweler sells watches and a jailer watches cells.", "id": 2677}, {"Category": "Classic Riddles", "Riddle": "What is it that you ought to keep after you have given it to someone else?", "_type": "dict", "Heading": "Some Trust", "Answer": "A promise, of course.", "id": 2678}, {"Category": "Classic Riddles", "Riddle": "You can't keep this until you have given it. What is it?", "_type": "dict", "Heading": "Give And Keep", "Answer": "Your word.", "id": 2679}, {"Category": "Classic Riddles", "Riddle": "Without a bridle, or a saddle, across a thing I ride a-straddle. And those I ride, by help of me, though almost blind, are made to see.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "No Saddle!", "Answer": "Eye glasses.", "id": 2680}, {"Category": "Classic Riddles", "Riddle": "Where is the AD before BC, tomorrow before yesterday, and the eight is first?", "_type": "dict", "Heading": "Letter Search", "Answer": "In a dictionary.", "id": 2681}, {"Category": "Classic Riddles", "Riddle": "How do you make \"one\" disappear?", "_type": "dict", "Heading": "Be Gone!", "Answer": "Add a \"g\" and your Gone !", "id": 2682}, {"Category": "Classic Riddles", "Riddle": "My teeth are sharp, my back is straight, to cut things up it is my fate.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "To Cut Things Up Is My Fate", "Answer": "A Saw.", "id": 2683}, {"Category": "Classic Riddles", "Riddle": "Rearrange the following letters to make just one word. \"STOODUWERNJ\" What is it?", "_type": "dict", "Heading": "One Word Puzzle", "Answer": "Just one word.", "id": 2684}, {"Category": "Classic Riddles", "Riddle": "It's been around for millions of years, but it's no more than a month old. What is it?", "_type": "dict", "Heading": "Old And Young", "Answer": "The moon.", "id": 2685}, {"Category": "Classic Riddles", "Riddle": "When I left, I didn't know where I was going; when I got there, I didn't know where I was; when I returned, I didn't know where I had been.\n\r\n\nWho was I?", "_type": "dict", "Heading": "Unknown", "Answer": "Christopher Columbus - when he found the Americas.", "id": 2736}, {"Category": "Classic Riddles", "Riddle": "White bird, featherless, flyin' out o' paradise, flyin' over sea and land, dyin' in my hand. What is it?", "_type": "dict", "Heading": "Featherless Bird", "Answer": "A snowflake!", "id": 2737}, {"Category": "Classic Riddles", "Riddle": "My name is two letters. You call many people by this name, but yet their first name is not this. What is it?", "_type": "dict", "Heading": "My Name", "Answer": "Mr.", "id": 2738}, {"Category": "Classic Riddles", "Riddle": "There is a frog, dead in the middle of an island. If he swims north, the distance to the mainland is 2 meters. If he swims south, the distance to the mainland is 3 meters. If he swims east or west, the distance is 4 meters. Which way does he swim?", "_type": "dict", "Heading": "Stranded Frog", "Answer": "He doesn't swim at all, he is dead.", "id": 2739}, {"Category": "Classic Riddles", "Riddle": "A simple peasant bought a number of camels and is taking them to his farm. As he rides contentedly along he counts them - he counts 29. He was sure he had bought 30 camel, so in alarm he jumps off his camel and counts the camels again. To his delight there are 30. Half an hour later, he counts his camels and once more there are just 29. Confused, he climbs off his camel and counts again. Once more there are 30. Can you explain?", "_type": "dict", "Heading": "Camel Count - 29 Or 30?", "Answer": "When he is on the camel he omits to count it.", "id": 2740}, {"Category": "Classic Riddles", "Riddle": "Crimson I am born, yellow I dance, ebony I die. What am I?", "_type": "dict", "Heading": "3nigma", "Answer": "Fire.", "id": 2741}, {"Category": "Classic Riddles", "Riddle": "Walk on the living, they don't even mumble. Walk on the dead, they mutter and grumble. What are they?", "_type": "dict", "Heading": "Stop Complaining", "Answer": "Fallen leaves.", "id": 2742}, {"Category": "Classic Riddles", "Riddle": "If you have 10 peaches and take 7 peaches away, how many do you have?", "_type": "dict", "Heading": "How Many Peaches Riddle", "Answer": "7, you took 7 peaches away with you.  Duhhhhh", "id": 2743}, {"Category": "Classic Riddles", "Riddle": "What can climb mountains, cross streams, handle hundreds of feet each day, yet never moves? What is it?", "_type": "dict", "Heading": "Walk On Me", "Answer": "A trail!", "id": 2744}, {"Category": "Classic Riddles", "Riddle": "I am more powerful than god and more evil than the devil. I am what rich people want and what poor people have. I can never die. What am I?", "_type": "dict", "Heading": "The Ultimate Riddle", "Answer": "I am nothing.", "id": 2745}, {"Category": "Classic Riddles", "Riddle": "What always was, yet I can never be?", "_type": "dict", "Heading": "What Always Was?", "Answer": "Yesterday.", "id": 2796}, {"Category": "Classic Riddles", "Riddle": "Two men were playing tennis. They played five sets and each man won three sets. How can this be possible?", "_type": "dict", "Heading": "Tennis Knowledge", "Answer": "The two men were partners playing doubles.", "id": 2797}, {"Category": "Classic Riddles", "Riddle": "A new medical building containing 100 offices had just been completed. Mark was hired to paint the numbers 1 to 100 on the doors. How many times will Mark have to paint the number nine?", "_type": "dict", "Heading": "Tricky Nines", "Answer": "The answer is 20! 9, 19, 29, 39, 49, 59, 69, 79, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99.", "id": 2798}, {"Category": "Classic Riddles", "Riddle": "What can you put in a barrel, that will make the barrel lighter?", "_type": "dict", "Heading": "The Barrel", "Answer": "A Hole.", "id": 2799}, {"Category": "Classic Riddles", "Riddle": "If it takes 3 people to dig 1 hole how many people does it takes for 1/2 an hole?", "_type": "dict", "Heading": "Hole 1/2", "Answer": "You can't dig 1/2 an hole because once you begin to dig it is an hole.", "id": 2800}, {"Category": "Classic Riddles", "Riddle": "What has eyes but can't see, a tongue but can't talk, and a soul but can never find love?", "_type": "dict", "Heading": "A Soul That Can", "Answer": "A shoe.", "id": 2801}, {"Category": "Classic Riddles", "Riddle": "All about, but cannot be seen, Can be captured, cannot be held, No throat, but can be heard. What is it?", "_type": "dict", "Heading": "All About Brain Teaser", "Answer": "The wind.", "id": 2802}, {"Category": "Classic Riddles", "Riddle": "Dark with white markings, And smooth like a rock. Where learning occurs, I help convey thought. What am I?", "_type": "dict", "Heading": "Educational Presentations", "Answer": "Blackboard/chalkboard.", "id": 2803}, {"Category": "Classic Riddles", "Riddle": "A man was looking through a 6th floor window, \n thought for a minute then jumped, \n but did not die or get hurt at all. \n How?", "_type": "dict", "Heading": "6th Floor", "Answer": "He jumped in the window.\n He was outside the window \n He was a window washer!!!", "id": 2804}, {"Category": "Classic Riddles", "Riddle": "While walking down the street I met a man. He tipped his hat and drew his cane and in this riddle I told his name.\n\r\n\nWhat is the man's name?", "_type": "dict", "Heading": "Man's Name?", "Answer": "And drew = ANDREW.", "id": 2805}, {"Category": "Classic Riddles", "Riddle": "I can be all colours of the rainbow, Or have no colour at all. Sometimes I'm empty, Sometimes I'm full. What am I?", "_type": "dict", "Heading": "Rhyming What Am I? ", "Answer": "Glass.", "id": 2856}, {"Category": "Classic Riddles", "Riddle": "The Pope has it but he does not use it. Your father has it but your mother uses it. Nuns do not need it. Your lady friend's husband has it and she uses it. What is it?", "_type": "dict", "Heading": "Sorry Ladies", "Answer": "A Last Name.", "id": 2857}, {"Category": "Classic Riddles", "Riddle": "Nothing on the outside Nothing on the inside Light as a feather Yet ten men cannot lift it.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Light As A Feather", "Answer": "A bubble.", "id": 2858}, {"Category": "Classic Riddles", "Riddle": "A mile from end to end, Yet as close to you as a friend. A precious commodity, freely given. Seen on the dead and on the living. Found on the rich, poor, short and tall, But shared among children most of all.", "_type": "dict", "Heading": "Just A Simple... ", "Answer": "A simple smile.", "id": 2859}, {"Category": "Classic Riddles", "Riddle": "A group of privates were standing in the blistering sun facing due west. Their sergeant shouted at them: Right turn! About turn! Left turn!\n\r\n\nIn which direction are they now facing?", "_type": "dict", "Heading": "The Confused Soldiers", "Answer": "East.", "id": 2860}, {"Category": "Classic Riddles", "Riddle": "How many birth days does the average person have?", "_type": "dict", "Heading": "Birth Days", "Answer": "One!", "id": 2861}, {"Category": "Classic Riddles", "Riddle": "Why can't you trust the law of gravity?", "_type": "dict", "Heading": "Law Of Gravity", "Answer": "Because it will always let you down.", "id": 2862}, {"Category": "Classic Riddles", "Riddle": "Which word is the odd one out: First Second Third Forth Fifth Sixth Seventh Eighth?", "_type": "dict", "Heading": "Odd One", "Answer": "Forth. It is incorrectly spelled.", "id": 2863}, {"Category": "Classic Riddles", "Riddle": "I know a word of letters three. Add two, and fewer there will be! What Word Am I?", "_type": "dict", "Heading": "Three Letter Word Trivia Challenge", "Answer": "Few.", "id": 2864}, {"Category": "Classic Riddles", "Riddle": "Tear off one and scratch its head, what was red is now black instead. What is It?", "_type": "dict", "Heading": "What Was Red", "Answer": "A Matchstick!", "id": 2865}, {"Category": "Classic Riddles", "Riddle": "What was the biggest island in the world before the discovery of Australia by Captain Cook?", "_type": "dict", "Heading": "Largest Island", "Answer": "Australia was always the biggest island in the world, even before it was discovered.", "id": 2916}, {"Category": "Classic Riddles", "Riddle": "Big as a biscuit, deep as a cup, even a river can't fill it up. What is it?", "_type": "dict", "Heading": "Can't Fill It Up", "Answer": "A kitchen strainer.", "id": 2917}, {"Category": "Classic Riddles", "Riddle": "Whoever makes it, tells it not. Whoever takes it, knows it not. Whoever knows it, wants it not.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Tell No Tale", "Answer": "Counterfeit money.", "id": 2918}, {"Category": "Classic Riddles", "Riddle": "What is something you don’t own but you can give it to anyone you meet? You only have one, but you can give it away as many times as you want without losing it. What is it?", "_type": "dict", "Heading": "Giving What Is It Riddle", "Answer": "Your heart.", "id": 2919}, {"Category": "Classic Riddles", "Riddle": "For some in the world, it is as precious as gold. Yet, this thing, is never sold. It is kept, but never used. It's a weakness that cannot be removed. A weapon that can be used against god. If they have it, you know it, then they have lost. What is it?", "_type": "dict", "Heading": "The Weapon And Treasure", "Answer": "A Secret.", "id": 2920}, {"Category": "Classic Riddles", "Riddle": "Round as a button, Deep as a well. If you want me to talk, You must first pull my tail.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Round As A Button, Deep As A Well", "Answer": "A bell.", "id": 2921}, {"Category": "Classic Riddles", "Riddle": "What is that which is less tired the longer it runs?", "_type": "dict", "Heading": "Runs Longer", "Answer": "A wheel.", "id": 2922}, {"Category": "Classic Riddles", "Riddle": "A fireman is running to get a net under a lady who looks like she might jump off the balcony of her 20 story apartment building. There is nothing below her except a 20 story fall. The fireman is still 100 yards away when she falls and can't nearly get there in time. The woman is not hurt more than a bruise. How is that possible?", "_type": "dict", "Heading": "Who Does That?", "Answer": "She fell back into her apartment, jumping from the balcony into the inside.", "id": 2923}, {"Category": "Classic Riddles", "Riddle": "What is the longest and yet the shortest thing in the world; the swiftest and yet the slowest; the most divisible and the most extended; the least valued and the most regretted; without which nothing can be done; which devours every thing, however small, and yet gives life and spirits to every object, however great?", "_type": "dict", "Heading": "Longest And Shortest", "Answer": "Time.", "id": 2924}, {"Category": "Classic Riddles", "Riddle": "A dozen Royals gathered round, Entertained by two who clowned. Each King there had servants ten, Though none of them were also men. The lowest servant sometimes might, Defeat the King in a fair fight. A weapon stout, a priceless jewel, The beat of life, a farmer's tool. \n\r\n\nWhat is it?", "_type": "dict", "Heading": "The Royals", "Answer": "A Deck of Cards.", "id": 2925}, {"Category": "Classic Riddles", "Riddle": "I'm in the book, but not on any leaf; \nI'm in the mouth, but not in lip or teeth; \nI'm in the atmosphere, but never in the air; \nI wait on every one, but never on a pair; \nI am with you wherever you may go; \nAnd every thing you do I'm sure to know; \nThough when you did it I should not be there, \nYet when 'twas done, you'd find me in the chair. \n\r\n\nWhat am I?", "_type": "dict", "Heading": "I’m In The Book, But Not On Any Leaf", "Answer": "The letter O.", "id": 2976}, {"Category": "Classic Riddles", "Riddle": "I am a word of five letters. Take away my first and I am the name of what adorns the estate of many of the nobility of England. Take away my first and second, and I am the name of a place where all the world was once congregated. Take away my last, and I am the name of a beautiful mineral. Take away my two last, and I am the name of a fashionable place of resort. I am small in stature, but capable of doing a great deal of mischief, as I once did in London in the year 1666.", "_type": "dict", "Heading": "Five Letter Word Riddle", "Answer": "Spark.", "id": 2977}, {"Category": "Classic Riddles", "Riddle": "In a tunnel of darkness lies a beast of iron. It can only attack when pulled back.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "A Violent Beast", "Answer": "A bullet.", "id": 2978}, {"Category": "Classic Riddles", "Riddle": "There once was a book that was only owned by the wealthy, but now everyone can have it. You can't buy it in a bookstore or take it from a library. What book is it?", "_type": "dict", "Heading": "For All!", "Answer": "A telephone book.", "id": 2979}, {"Category": "Classic Riddles", "Riddle": "Man walks over, man walks under, in times of war he burns asunder.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Over And Under", "Answer": "A Bridge.", "id": 2980}, {"Category": "Classic Riddles", "Riddle": "I am a word of three syllables, each of which is a word; my first is an article in common use; my second, an animal of uncommon intelligence; my third, though not an animal, is used in carrying burdens. My whole is a useful art. What am I?", "_type": "dict", "Heading": "Three Syllable Word", "Answer": "Pen-man-ship.", "id": 2981}, {"Category": "Classic Riddles", "Riddle": "Why is the best baker most in want of bread?", "_type": "dict", "Heading": "Baker Riddle", "Answer": "Because he kneads (needs) it most.", "id": 2982}, {"Category": "Classic Riddles", "Riddle": "Four letters form me quite complete, \nAs all who breathe do show; \nReversed, you'll find I am the seat \nOf infamy and woe. \nTransposed, you'll see I'm base and mean, \nAgain of Jewish race; \nTransposed once more, I oft am seen \nTo hide a lovely face.\n\r\n\nWhat are the five words?", "_type": "dict", "Heading": "Five Words From Four Letters", "Answer": "Live, evil, vile, Levi, veil.", "id": 2983}, {"Category": "Classic Riddles", "Riddle": "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?", "_type": "dict", "Heading": "Blindingly Helpful", "Answer": "Sand.", "id": 2984}, {"Category": "Classic Riddles", "Riddle": "I can flutter and take your breath away. I can take a beating, but do not bruise. If I stopped you would be sure to lose. Everyday I am with you.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Beating", "Answer": "Your heart.", "id": 2985}, {"Category": "Classic Riddles", "Riddle": "Why is green grass like a mouse?", "_type": "dict", "Heading": "Grass Like A Mouse", "Answer": "Green grass is like a mouse, because the cattle eat it (cat’ll eat it).", "id": 3033}, {"Category": "Classic Riddles", "Riddle": "Iron roof and glass walls, burns and burns but never falls.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "What Has Airon Roof And Glass Walls?", "Answer": "A lantern.", "id": 3034}, {"Category": "Classic Riddles", "Riddle": "How high would you have to count before you would use the letter A in the English language spelling of a whole number.", "_type": "dict", "Heading": "The Letter A Count", "Answer": "One thousand.", "id": 3035}, {"Category": "Classic Riddles", "Riddle": "How many black beans will make five white ones?", "_type": "dict", "Heading": "Black And White Beans", "Answer": "Five when peeled.", "id": 3036}, {"Category": "Classic Riddles", "Riddle": "A dagger thrust at my own heart, Dictates the way I'm swayed. Left I stand, and right I yield, To the twisting of the blade. What am I?", "_type": "dict", "Heading": "Opened With A Twist", "Answer": "A Lock.", "id": 3037}, {"Category": "Classic Riddles", "Riddle": "What letters of the alphabet come too late for supper?", "_type": "dict", "Heading": "Letters Of The Alphabet Riddle", "Answer": "Those that come after T.", "id": 3038}, {"Category": "Classic Riddles", "Riddle": "In camps about the centre I appear; \n\r\n\nIn smiling meadows seen throughout the year; \n\r\n\nThe silent angler views me in the streams, \n\r\n\nAnd all must trace me in their morning dreams, \n\r\n\nFirst in the mob conspicuous I stand, \n\r\n\nProud of the lead, and ever in command. \n\r\n\nWhat am I?", "_type": "dict", "Heading": "Morning Dreams", "Answer": "The letter M.", "id": 3039}, {"Category": "Classic Riddles", "Riddle": "Up and down,up and down, touching neither sky nor ground. What is it?", "_type": "dict", "Heading": "Up And Down Riddle", "Answer": "A pump handle.", "id": 3040}, {"Category": "Classic Riddles", "Riddle": "This thing all things devours: Birds, beasts, trees, flowers; Gnaws iron, bites steel; Grinds hard stones to meal; Slays king, ruins town, And beats high mountain down. What am I?", "_type": "dict", "Heading": "Devours Everything!", "Answer": "Time!", "id": 3041}, {"Category": "Classic Riddles", "Riddle": "Why should doctors attend to window-sashes?", "_type": "dict", "Heading": "Doctor Patient Riddle", "Answer": "Because they have so many panes (pains).", "id": 3042}, {"Category": "Classic Riddles", "Riddle": "Why is a lumberjack like a stage actor?", "_type": "dict", "Heading": "Lumberjack Riddle", "Answer": "He is known by his axe (acts).", "id": 3083}, {"Category": "Classic Riddles", "Riddle": "What is that which, supposing it's greatest breadth to be four inches, length nine inches, and depth three inches and contains a solid foot?", "_type": "dict", "Heading": "Foot Long Riddle", "Answer": "A shoe.", "id": 3084}, {"Category": "Classic Riddles", "Riddle": "What goes in the water red, and comes out black?", "_type": "dict", "Heading": "Comes Out Black", "Answer": "Iron.", "id": 3085}, {"Category": "Classic Riddles", "Riddle": "If a fender cost six dollars, what will a ton of coal come to?", "_type": "dict", "Heading": "Not A Guitar", "Answer": "To ashes.", "id": 3086}, {"Category": "Classic Riddles", "Riddle": "Why is a parish bell like a good story?", "_type": "dict", "Heading": "Parish Bell", "Answer": "Because it is often tolled (told).", "id": 3087}, {"Category": "Classic Riddles", "Riddle": "Why is a gooseberry pie like counterfeit money?", "_type": "dict", "Heading": "Gooseberry Riddle", "Answer": "Because it is not currant (current).", "id": 3088}, {"Category": "Classic Riddles", "Riddle": "As I went across the bridge, I met a man with a load of wood which was neither straight nor crooked. What kind of wood was it?", "_type": "dict", "Heading": "Wacky Wood", "Answer": "Sawdust.", "id": 3089}, {"Category": "Classic Riddles", "Riddle": "What is that which the dead and living do at the same time?", "_type": "dict", "Heading": "Dead And Living", "Answer": "Lie.", "id": 3090}, {"Category": "Classic Riddles", "Riddle": "The head of a whale is six feet long; his tail is as long as his head and half his body, and his body is half of his whole length. How long is the whale?", "_type": "dict", "Heading": "How Long Is The Whale?", "Answer": "Forty-eight feet.", "id": 3091}, {"Category": "Classic Riddles", "Riddle": "Why is a rose-bud like a promissory note?", "_type": "dict", "Heading": "Rose Riddle", "Answer": "It matures by falling dew.", "id": 3092}, {"Category": "Classic Riddles", "Riddle": "Why is France like a skeleton?", "_type": "dict", "Heading": "France Skeleton Riddle", "Answer": "Because only the \nbony part\n is left.", "id": 3133}, {"Category": "Classic Riddles", "Riddle": "My first is a part of the day,\n\r\n\n\r\n\n\r\n\nMy last a conductor of light,\n\r\n\nMy whole to take measure of time,\n\r\n\nIs useful by day and by night.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Conductor Of Light", "Answer": "An Hour-glass.", "id": 3134}, {"Category": "Classic Riddles", "Riddle": "What is that which is invisible, but never out of sight?", "_type": "dict", "Heading": "Invisible Riddle", "Answer": "The Letter I.", "id": 3135}, {"Category": "Classic Riddles", "Riddle": "When is a boat like a knife?", "_type": "dict", "Heading": "Boat Like A Knife", "Answer": "When it is a cutter.", "id": 3136}, {"Category": "Classic Riddles", "Riddle": "What kin is that child to it's father who is not it's father's own son?", "_type": "dict", "Heading": "Father And Child Riddle", "Answer": "His daughter.", "id": 3137}, {"Category": "Classic Riddles", "Riddle": "Whether old Homer tippled wine or beer, \nJulep or cider, history is not clear; \nBut plain it is—the bard, though wont to roam, \nBut for one liquid, never had left home.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Wine Or Beer", "Answer": "The letter R.", "id": 3138}, {"Category": "Classic Riddles", "Riddle": "Black within, red without, with four courners, round about. What is it?", "_type": "dict", "Heading": "Four Corners", "Answer": "A chiminey.", "id": 3139}, {"Category": "Classic Riddles", "Riddle": "In what year did Christmas Day and New Year's Day fall in the same year?", "_type": "dict", "Heading": "Playing With Dates", "Answer": "It happens every year.", "id": 3140}, {"Category": "Classic Riddles", "Riddle": "Why is a nail, fast in the wall, like an old man?", "_type": "dict", "Heading": "Nail In The Wall", "Answer": "Because it is in firm (infirm).", "id": 3141}, {"Category": "Classic Riddles", "Riddle": "Why is a man with wooden legs like one who has an even bargain?", "_type": "dict", "Heading": "Man With A Wooden Leg Riddle", "Answer": "Because he has nothing to boot.", "id": 3142}, {"Category": "Classic Riddles", "Riddle": "What biblical name is there which expresses a father calling his son by name, and his son replying?", "_type": "dict", "Heading": "Biblical Name Riddle", "Answer": "Ben-ha-dad.", "id": 3183}, {"Category": "Classic Riddles", "Riddle": "Round as an apple, Deep as a cup, All the King's horses Can't pull it up.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Round As An Apple", "Answer": "It is a well.", "id": 3184}, {"Category": "Classic Riddles", "Riddle": "Why does a miller wear a white hat?", "_type": "dict", "Heading": "White Hat", "Answer": "To keep his head warm.", "id": 3185}, {"Category": "Classic Riddles", "Riddle": "My first is a very uncomfortable state,\n\r\n\nIn cold weather it mostly abounds.\n\r\n\nMy second’s an instrument formed of hard steel,\n\r\n\nThat will cause the stout foe to stagger and reel,\n\r\n\nAnd when used, is a symptom of hate.\n\r\n\nMy whole is an author of greatest renown,\n\r\n\nWhose fame to the last day of time will go down.\n\r\n\nWho am I?", "_type": "dict", "Heading": "Guess Who Riddle", "Answer": "Shakespeare.", "id": 3186}, {"Category": "Classic Riddles", "Riddle": "Why is a dandy like a haunch of venison?", "_type": "dict", "Heading": "Dandy Riddle", "Answer": "He is a bit of a buck.", "id": 3187}, {"Category": "Classic Riddles", "Riddle": "What two reasons why whispering in company is not proper?", "_type": "dict", "Heading": "Don't Whisper", "Answer": "It is not aloud (allowed). \n\r\n\n\r\n\n\r\n\nPrivate earing (privateering) is unlawful.", "id": 3188}, {"Category": "Classic Riddles", "Riddle": "What vessel is that which is always asking leave to move?", "_type": "dict", "Heading": "What Vessel", "Answer": "Canister.", "id": 3189}, {"Category": "Classic Riddles", "Riddle": "Why is there no danger of starving in a desert?", "_type": "dict", "Heading": "No Starving In A Desert", "Answer": "Because of the sand which is (sandwiches) under your feet.", "id": 3190}, {"Category": "Classic Riddles", "Riddle": "What river in Bavaria answers the question, Who is there?", "_type": "dict", "Heading": "Bavarian River", "Answer": "I, ser.", "id": 3191}, {"Category": "Classic Riddles", "Riddle": "An archaeologist finds a coin dated 48 B.C. How did he know it was a fake?", "_type": "dict", "Heading": "Old Coin", "Answer": "BC is before Christ. Christ was not yet born when the coin would have been made and the date would be impossible.", "id": 3192}, {"Category": "Classic Riddles", "Riddle": "I heard of an invading, vanquishing army sweeping across the land, liquid-quick; conquering everything, quelling resistance. With it came darkness, dimming the light. Humans hid in their houses, while outside spears pierced, shattering stone walls. Uncountable soldiers smashed into the ground, but each elicited life as he died; when the army had vanished, advancing northward, the land was green and growing, refreshed. What is it?", "_type": "dict", "Heading": "Invasion!", "Answer": "A rainstorm.", "id": 3233}, {"Category": "Classic Riddles", "Riddle": "Why are beautiful women like bread?", "_type": "dict", "Heading": "Beautiful Women", "Answer": "Because they are often toasted.", "id": 3234}, {"Category": "Classic Riddles", "Riddle": "Why is the letter F like an incendiary?", "_type": "dict", "Heading": "The Letter F", "Answer": "Because it makes ire fire.", "id": 3235}, {"Category": "Classic Riddles", "Riddle": "We are five little objects of an everyday sort. You will find us all in a tennis court. What are we?", "_type": "dict", "Heading": "Five Objects", "Answer": "Vowels.", "id": 3236}, {"Category": "Classic Riddles", "Riddle": "Why is a man in debt like a misty morning?", "_type": "dict", "Heading": "Man In Debt", "Answer": "Because he is surrounded with dues (dews).", "id": 3237}, {"Category": "Classic Riddles", "Riddle": "How is it that a person born in Massachusetts, whose parents were both born in Massachusetts, is not born a U.S. Citizen?", "_type": "dict", "Heading": "Massachusetts", "Answer": "If he was born before 1783, then Massachusetts would still be a British colony.", "id": 3238}, {"Category": "Classic Riddles", "Riddle": "My first is appropriate, my second ’tis nine to one if you guess it. My whole elevates the sole above the earth. What am I?", "_type": "dict", "Heading": "Nine To One If You Guess It", "Answer": "Pat-ten.", "id": 3239}, {"Category": "Classic Riddles", "Riddle": "As destructive as life, As healing as death; An institutioner of strife, Just as prone to bless. It is all that is good, Yet with an evil trend; As it was the beginning of things, It can also be the end. What is it?", "_type": "dict", "Heading": "Destructive And Healing", "Answer": "It is fire!", "id": 3240}, {"Category": "Classic Riddles", "Riddle": "What is that which has many leaves, but no stem?", "_type": "dict", "Heading": "Many Leaves But No Stem", "Answer": "A book.", "id": 3241}, {"Category": "Classic Riddles", "Riddle": "Why are your nose and chin always at variance?", "_type": "dict", "Heading": "Nose And Chin", "Answer": "Because words are passing between them.", "id": 3242}, {"Category": "Classic Riddles", "Riddle": "Why ought a fisherman to be very wealthy?", "_type": "dict", "Heading": "Wealthy Fisherman", "Answer": "Because his is all \nnet\n profit.", "id": 3283}, {"Category": "Classic Riddles", "Riddle": "Why is the letter F like death?", "_type": "dict", "Heading": "F Like Death Riddle", "Answer": "Because without it life is a lie, or it makes life a lie.", "id": 3284}, {"Category": "Classic Riddles", "Riddle": "Why is a conundrum like a monkey?", "_type": "dict", "Heading": "Monkey Conundrum", "Answer": "Because it is far fetched and full of nonsense.", "id": 3285}, {"Category": "Classic Riddles", "Riddle": "You do not want to have it, But when you do have it, You do not want to lose it.  What is it?", "_type": "dict", "Heading": "Make Your Mind Up", "Answer": "A lawsuit.", "id": 3286}, {"Category": "Classic Riddles", "Riddle": "I give you a group of three. One is sitting down, and will never get up. The second eats as much as is given to him, yet is always hungry. The third goes away and never returns.", "_type": "dict", "Heading": "A Naughty Trio Riddle", "Answer": "Stove, fire, and smoke.", "id": 3287}, {"Category": "Classic Riddles", "Riddle": "A man but an animal, a horn with two hands. What am I?", "_type": "dict", "Heading": "Mythology Lesson", "Answer": "A Minotaur.", "id": 3288}, {"Category": "Classic Riddles", "Riddle": "A harvest sown and reaped on the same day In an unplowed field, Which increases without growing, Remains whole though it is eaten Within and without, Is useless and yet The staple of nations. \n\r\n\nWhat is it?", "_type": "dict", "Heading": "Nations", "Answer": "War.", "id": 3289}, {"Category": "Classic Riddles", "Riddle": "Why is swearing like an old coat?", "_type": "dict", "Heading": "Swearing", "Answer": "Because it is a bad habit.", "id": 3290}, {"Category": "Classic Riddles", "Riddle": "Ripped from my mother's womb, Beaten and burned, I become a blood-thirsty slayer. What am I?", "_type": "dict", "Heading": "Blood Thirsty", "Answer": "Iron ore.", "id": 3291}, {"Category": "Classic Riddles", "Riddle": "My head and tail both equal are, My middle slender as a bee. Whether I stand on head or heel Is quite the same to you or me. But if my head should be cut off, The matter's true, though passing strange Directly I to nothing change.\n\r\n\nWhat Am I?", "_type": "dict", "Heading": "Head Or Heel", "Answer": "The figure eight.", "id": 3292}, {"Category": "Classic Riddles", "Riddle": "Why is a small horse like a young musk-melon?", "_type": "dict", "Heading": "Muskmelon Riddle", "Answer": "Because it makes a \nman go\n.", "id": 3333}, {"Category": "Classic Riddles", "Riddle": "Why is an old man like a window?", "_type": "dict", "Heading": "Old Man Window", "Answer": "Because he is full of pains (panes).", "id": 3334}, {"Category": "Classic Riddles", "Riddle": "What do we all do when we first get into bed?", "_type": "dict", "Heading": "Bedtime Riddle", "Answer": "Make an impression.", "id": 3335}, {"Category": "Classic Riddles", "Riddle": "I am not found on any ground,\nBut always in the air; \nThough charged each cloud with thunder loud, \nYou can not find me there. \nNow, if from France you choose to dance \nYour way just into Spain, \nI there am seen, and near the queen, \nIn hail, in mist, and rain.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Enigma, I Am Found On The Ground...", "Answer": "The letter I.", "id": 3336}, {"Category": "Classic Riddles", "Riddle": "How is it possible to always find what your looking for in the last place you look?", "_type": "dict", "Heading": "The Last Place You Looked", "Answer": "If you find what your are looking for then you would stop looking so it would be in the last place you look.", "id": 3337}, {"Category": "Classic Riddles", "Riddle": "A box without hinges, key or lid, Yet golden treasure inside is hid.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Golden Treasure", "Answer": "An egg.", "id": 3338}, {"Category": "Classic Riddles", "Riddle": "Why are two heads better than one?", "_type": "dict", "Heading": "Two Heads Are Better Than One.", "Answer": "They are four-sighted (fore-sighted).", "id": 3339}, {"Category": "Classic Riddles", "Riddle": "Inside a burning house, this thing is best to make. And best to make it quickly, before the fire's too much to take! What is it?", "_type": "dict", "Heading": "Make What?", "Answer": "Haste!", "id": 3340}, {"Category": "Classic Riddles", "Riddle": "2, 3, 5, 9, 17, _ What is the next number in the sequence?", "_type": "dict", "Heading": "What's The Next Number?", "Answer": "33. The pattern:  Double the previous number and subtract 1.", "id": 3341}, {"Category": "Classic Riddles", "Riddle": "Why is the largest city in Ireland likely to be the largest city in the world?", "_type": "dict", "Heading": "Largest City In The World Riddle", "Answer": "Because it is every year doubling (Dublin).", "id": 3342}, {"Category": "Classic Riddles", "Riddle": "NASA was considering sending canaries into space to study them under zero gravity. The project was scrapped when someone realized that in spite of having sufficient water supplies, they could die of dehydration within a few hours. Why?", "_type": "dict", "Heading": "Bird Facts", "Answer": "Birds, unlike humans, need gravity to swallow. Humans can swallow even while hanging upside down.", "id": 3383}, {"Category": "Classic Riddles", "Riddle": "My first is a negative greatly in use, \nBy which people begin when they mean to refuse; \nMy second is Fashion, or so called in France, \nBut, like other whims, is the servant of chance. \nAn article always in use is my whole, \nWith texture and form under fashion’s control; \nBut, alas! not a thing can it see which goes by, \nAlthough many have four sights, and all have one eye.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Baby's Got Back", "Answer": "But-ton.", "id": 3384}, {"Category": "Classic Riddles", "Riddle": "I have four of these, With matching extremities. They can do many things, And hardly ever bring me pain. Unless I stick them with a pin, Or burn them sometimes when... What is it that I can wiggle at will? And use in other means still?", "_type": "dict", "Heading": "Matching Extremities", "Answer": "Fingers.", "id": 3385}, {"Category": "Classic Riddles", "Riddle": "What animal would you get crossed a duck, a beaver, and an otter?", "_type": "dict", "Heading": "Odd Animals", "Answer": "A platypus.", "id": 3386}, {"Category": "Classic Riddles", "Riddle": "At the sound of me, men may dream or stomp their feet at the sound of me, women may laugh or sometimes weep. What am I?", "_type": "dict", "Heading": "Sounds", "Answer": "Music.", "id": 3387}, {"Category": "Classic Riddles", "Riddle": "When young, I am sweet in the sun. When middle-aged, I make you gay. When old, I am valued more than ever. What am I?", "_type": "dict", "Heading": "Sweet In The Sun Brain Game Trivia Question", "Answer": "Wine", "id": 3388}, {"Category": "Classic Riddles", "Riddle": "If a man carried my burden he would break his back. I am not big but leave silver in my tracks. What am I?", "_type": "dict", "Heading": "Not Big", "Answer": "A snail.", "id": 3389}, {"Category": "Classic Riddles", "Riddle": "Why is a bullet like a tender glance?", "_type": "dict", "Heading": "Bullet Vs Glance", "Answer": "Because it pierces hearts.", "id": 3390}, {"Category": "Classic Riddles", "Riddle": "A ship that puts a road in order,\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Puts A Road In Order", "Answer": "A smoothing iron.", "id": 3391}, {"Category": "Classic Riddles", "Riddle": "How did the court know the judge was ready for bed?", "_type": "dict", "Heading": "Please Rise", "Answer": "He was wearing his robe.", "id": 3392}, {"Category": "Classic Riddles", "Riddle": "I am the son of a chemist and a mathematician. People call me iron 59. What is my name?", "_type": "dict", "Heading": "What’s His Name?", "Answer": "Felix. Fe=iron LIX-59", "id": 3433}, {"Category": "Classic Riddles", "Riddle": "My first is found on the ocean wave, \nIn the spring, the pit, and the mine; \nMy second below earth’s surface you have, \nWhere seldom the sun can shine. \nMy whole your dinner-table must grace, \nAnd seldom fails to obtain a place.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Teeth", "Answer": "Salt-cellar.", "id": 3434}, {"Category": "Classic Riddles", "Riddle": "A nonstop train leaves Moscow for Leningrad at 60 mph. Another nonstop train leaves Leningrad for Moscow at 40 mph. How far apart are the trains 1 hour before they pass each other?", "_type": "dict", "Heading": "Two Trains", "Answer": "100 miles (60+40)", "id": 3435}, {"Category": "Classic Riddles", "Riddle": "Long and slinky like a trout, never sings till its guts come out.  What is it?", "_type": "dict", "Heading": "Bang!", "Answer": "It is a gun.", "id": 3436}, {"Category": "Classic Riddles", "Riddle": "Four jolly men sat down to play, \n And played all night till break of day. \n They played for cash and not for fun, \n With a separate score for every one. \n When it came time to square accounts, \n they all had made quite fair amounts. \n Now, not one has lost and all have gained - \n Tell me now, this can you explain?", "_type": "dict", "Heading": "Four Jolly Men Play", "Answer": "The four jolly men are members of an orchestra hired to play at a dance.", "id": 3437}, {"Category": "Classic Riddles", "Riddle": "There is one word in the English language which is universally considered a preventive of harm; change a certain letter in it, and you make it an act of cruelty. What are the words?", "_type": "dict", "Heading": "Change One Letter", "Answer": "Prescription—proscription.", "id": 3438}, {"Category": "Classic Riddles", "Riddle": "Where do Turkeys go to dance?", "_type": "dict", "Heading": "Turkey Dance Riddle", "Answer": "The Butter Ball.", "id": 3439}, {"Category": "Classic Riddles", "Riddle": "Five hundred begins it, five hundred ends it,\r\nFive in the middle is seen;\r\nFirst of all figures, the first of all letters,\r\nTake up their stations between.\r\nJoin all together, and then you will bring\r\nBefore you the name of an eminent king.", "_type": "dict", "Heading": "I'm Pretty Important Riddle", "Answer": "David (Roman numerals).", "id": 3440}, {"Category": "Classic Riddles", "Riddle": "Three-fourths of a cross, and a circle complete, An upright where two semicircles meet, A rectangle triangle standing on feet, Two semicircles, and a circle complete. What is it?", "_type": "dict", "Heading": "Guess What It Is Riddle", "Answer": "Tobacco.", "id": 3441}, {"Category": "Classic Riddles", "Riddle": "Half-way up the hill, I see thee at last. Lying beneath me with thy sounds and sights - A city in the twilight, dim and vast, With smoking roofs, soft bells, and gleaming lights. What is it?", "_type": "dict", "Heading": "Sounds And Sights", "Answer": "The past.", "id": 3442}, {"Category": "Classic Riddles", "Riddle": "There is a creature which could double its size every day. So, if the creature is put in a tank then it will fill the tank in 10 days.\n\r\n\nHow many days would it take for the creature to fill 1/2 and 1/4 of the tank?", "_type": "dict", "Heading": "Growing Creature", "Answer": "9 days to fill 1/2 and 8 days to fill 1/4 of the tank.  If the creature fills the tank in 10 days and it doubles every day, on the ninth day it would fill 1/2 the tank. Thus on the 8th day it will fill 1/4 of tank.", "id": 3483}, {"Category": "Classic Riddles", "Riddle": "My first is in chocolate but not in ham, my second's in cake and also in jam, my third at tea-time is easily found, my whole is a friend who's often around. What am I?", "_type": "dict", "Heading": "Furry Friend", "Answer": "A Cat!", "id": 3484}, {"Category": "Classic Riddles", "Riddle": "Why are trees in winter like troublesome visitors?", "_type": "dict", "Heading": "Troublesome Trees", "Answer": "Because it's a long time before they leave.", "id": 3485}, {"Category": "Classic Riddles", "Riddle": "Of no use to one Yet absolute bliss to two. The small boy gets it for nothing. The young man has to lie for it. The old man has to buy it. The baby's right, The lover's privilege, The hypocrite's mask. To the young girl, faith; To the married woman, hope; To the old maid, charity. What am I?", "_type": "dict", "Heading": "Of No Use", "Answer": "A kiss.", "id": 3486}, {"Category": "Classic Riddles", "Riddle": "My first may be fashioned of iron or wood, \nAnd at window or door for safety is placed; \nIn village or town it does more harm than good, \nLeading people their health, time, and money to waste. \nMy second’s a lady, bewitching and fair, \nAnd for love of her people will labor and strive; \nWill rise before dawn, and be wearied with care, \nAnd pursue her with ardor as long as they live. \nMy whole is what ladies admire and approve, \nThe shopkeeper’s boast—the purchaser’s prize; \n’Tis a ninepenny chintz—’tis a one-shilling glove— \nIt is something which makes people open their eyes.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Shopping Riddle", "Answer": "Bar-gain.", "id": 3487}, {"Category": "Classic Riddles", "Riddle": "Why was the dog kicked out of the flea circus?", "_type": "dict", "Heading": "Flea Circus Thief", "Answer": "Because he stole the show!", "id": 3488}, {"Category": "Classic Riddles", "Riddle": "What do bumblebees sing in the shower?", "_type": "dict", "Heading": "Singing Bee", "Answer": "BeeBop.", "id": 3489}, {"Category": "Classic Riddles", "Riddle": "What animal probably likes doors?", "_type": "dict", "Heading": "An Animal And A Door", "Answer": "A doormouse.", "id": 3490}, {"Category": "Classic Riddles", "Riddle": "Runs over fields and woods all day Under the bed at night sits not alone, With long tongue hanging out, Awaiting for a bone. What am I?", "_type": "dict", "Heading": "Tongue Hanging", "Answer": "A shoe.", "id": 3491}, {"Category": "Classic Riddles", "Riddle": "A hundred stones are placed, in a straight line, a yard distant from each other. How many yards must a person walk, who undertakes to pick them up, and place them in a basket stationed one yard from the first stone?", "_type": "dict", "Heading": "A Hundred Stones", "Answer": "In solving this question it is clear that to pick up the first stone and put it into the basket, the person must walk two yards, one in going for the stone and another in returning with it; that for the second stone he must walk four yards, and so on increasing by two as far as the hundredth, when he must walk two hundred yards, so that the sum total will be the product of 202 multiplied by 50, or 10,100 yards. If any one does not see why we multiply 202 by 50 in getting the answer, we refer him to his arithmetic.", "id": 3492}, {"Category": "Classic Riddles", "Riddle": "What is the shape of a kiss?", "_type": "dict", "Heading": "Shape Of A Kiss", "Answer": "Elliptical—a-lip-tickle.", "id": 3533}, {"Category": "Classic Riddles", "Riddle": "What do computer programmers sing in the shower?", "_type": "dict", "Heading": "Singing Smart", "Answer": "Disc-o.", "id": 3534}, {"Category": "Classic Riddles", "Riddle": "’Tis found in our troubles, ’tis mixed with our pleasures, \n’Tis laid up above with our heavenly treasures; \n’Tis whispered in heaven, and ’tis muttered in hell, \nAnd it findeth a place in each sybilline spell; \nIn Paradise nestled, ’mid Eden’s fair flowers, \nIt has sported with Eve in rose-perfumed bowers; \n’Tis muttered in curses, yet breathed in our prayers; \nFrom the path of our duty it tempts us in snares. \nDeep, deep in our hearts you will find it engraved; \nThough in misery sunk, yet from sin it is saved. \n’Tis found in the stream that flows on to the ocean; \nThough in bustle forever, ’tis ne’er in commotion. \n’Tis wafted afar o’er the land in each breath; \nIn the grave ’tis decaying—you'll find it in death. \nIt is floating away on the broad stream of time, \nYet it findeth a place in eternity’s clime. \nIn the legends of nations it holdeth a place; \nThere’s no charm without it to the beautiful face. \nIn thunder you'll hear it, if closely you listen; \nIn moonbeam and sunbeam forever ’twill glisten. \nIn the dew-drop it sparkles; ’tis found in the forest; \nIt whispers in peace when our need is the sorest. \nWhat am I?", "_type": "dict", "Heading": "Enigma, Tis Whispered In Heaven", "Answer": "The letter E.", "id": 3535}, {"Category": "Classic Riddles", "Riddle": "How do you communicate with a monster that lives on the seabed?", "_type": "dict", "Heading": "Under The Sea", "Answer": "Drop him a line.", "id": 3536}, {"Category": "Classic Riddles", "Riddle": "How do you make an orange giggle in the tub?", "_type": "dict", "Heading": "Giggling Orange", "Answer": "Tickle its navel.", "id": 3537}, {"Category": "Classic Riddles", "Riddle": "A man has Ten Horses and nine stables as shown here. [] [] [] [] [] [] [] [] [] The man wants to fit Ten Horses into nine stables. How can he fit Ten horses into nine stables?", "_type": "dict", "Heading": "Ten Horses In Nine Stables", "Answer": "One letter for each stable. [T][E][N] [H][O][R][S][E][S]", "id": 3538}, {"Category": "Classic Riddles", "Riddle": "Half of me will mend, the other half will imprison. When I am together, I will poison. Who am I?", "_type": "dict", "Heading": "Toxic Combination", "Answer": "Hemlock,", "id": 3539}, {"Category": "Classic Riddles", "Riddle": "Untainted, Eternal, Marooned A place where the living will move. A shrine beneath the sun. Greeted by the morning's crest. Our sanctity, Our rest. For when our day is done. What am I?", "_type": "dict", "Heading": "A Shrine Beneath The Sun", "Answer": "The riddle \n\"A shrine beneath the sun\"\n is unanswered. Do you know the answer?  If so, click \nANSWER \n and add your answer in the comments section.", "id": 3540}, {"Category": "Classic Riddles", "Riddle": "There is a house. One enters it blind and comes out seeing. What is it?", "_type": "dict", "Heading": "From Blind To Sight. What Is It Riddle?", "Answer": "A school.", "id": 3541}, {"Category": "Classic Riddles", "Riddle": "Why is an avaricious man like one with a short memory?", "_type": "dict", "Heading": "Avaricious Riddle", "Answer": "Because he is always for getting.", "id": 3542}, {"Category": "Classic Riddles", "Riddle": "What animal has no wings, but yet will fly?", "_type": "dict", "Heading": "No Wings, Can Fly", "Answer": "A caterpillar has no wings, but will fly when it matures and becomes a butterfly.", "id": 3582}, {"Category": "Classic Riddles", "Riddle": "It goes through the door \n without pinching \n It sits on the stove\n without burning \n It sits on the table\n Not ashamed", "_type": "dict", "Heading": "The Hot Riddle", "Answer": "The Sun", "id": 3583}, {"Category": "Classic Riddles", "Riddle": "What did the faucet say to the shower?", "_type": "dict", "Heading": "Square Peg", "Answer": "\"You're a big drip.\"", "id": 3584}, {"Category": "Classic Riddles", "Riddle": "Did you hear about the soilder who bought a camouflage sleeping bag?", "_type": "dict", "Heading": "Camo Bag", "Answer": "He can't find it", "id": 3585}, {"Category": "Classic Riddles", "Riddle": "A woman went into a bank to cash an insurance refund check. By mistake the teller gave her dollars for cents and cents for dollars. She put the money in her purse but accidentally dropped a nickel on the floor. When she got home, she found that she had exactly twice the amount of the check she had cashed. She didn't have any money in her wallet before going to the bank. What was the exact amount of that check?", "_type": "dict", "Heading": "Refund Check", "Answer": "The amount must have been $31.63. She received $63.31. After she dropped a nickel there would remain the sum of $63.26, which is twice the amount of the check.", "id": 3586}, {"Category": "Classic Riddles", "Riddle": "If I say I am lying, am I telling the truth?", "_type": "dict", "Heading": "Lies And Truths", "Answer": "This is impossible to solve, because if I were telling the truth, then I would be lying, which doesn't make sense since I am telling the truth. If I am lying, then what I said was true and that doesn't make sense either.", "id": 3587}, {"Category": "Classic Riddles", "Riddle": "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?", "_type": "dict", "Heading": "The Good And The Bad", "Answer": "I am Sand.", "id": 3588}, {"Category": "Classic Riddles", "Riddle": "Joe has ten coins totaling $1.19. From these coins, he cannot make exact change for a dollar, half-dollar, quarter, dime, or nickel.\n\r\n\nWhat are the coins?", "_type": "dict", "Heading": "Wha Are The Coins?", "Answer": "A half-dollar, a quarter, four dimes, and four pennies.", "id": 3589}, {"Category": "Classic Riddles", "Riddle": "It speaks with a hard tongue, it cannot breathe, for it has no lung. What is it?", "_type": "dict", "Heading": "Sound", "Answer": "A Bell.", "id": 3590}, {"Category": "Classic Riddles", "Riddle": "Join a noun and adjective, and make a verb. What is the word?", "_type": "dict", "Heading": "Two-thirds Super Majority", "Answer": "Impeach.", "id": 3591}, {"Category": "Classic Riddles", "Riddle": "Granny looked up from her rocking chair and said: As far as I can tell, there is only one anagram of the word trinket.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Wise Granny", "Answer": "The word knitter.", "id": 3622}, {"Category": "Classic Riddles", "Riddle": "It stands on one leg with its heart in its head. What is it?", "_type": "dict", "Heading": "Heart In Head", "Answer": "A cabbage.", "id": 3623}, {"Category": "Classic Riddles", "Riddle": "What is bought by the yard and worn by the foot?", "_type": "dict", "Heading": "It's A Material Thing", "Answer": "Carpet.", "id": 3624}, {"Category": "Classic Riddles", "Riddle": "About the size of a squash, He robs the whole village. What is it?", "_type": "dict", "Heading": "Village Robber", "Answer": "A rat.", "id": 3625}, {"Category": "Classic Riddles", "Riddle": "When is the best time to have lunch?", "_type": "dict", "Heading": "The Lunch", "Answer": "after breakfast", "id": 3626}, {"Category": "Classic Riddles", "Riddle": "A riddle in which the answer is a 6 letter word.\n\r\n\nA monument - men all agree - am I in all sincerity. Half cat, half hindrance made. If head and tail removed should be, then most of all you strengthen me; replace my head, then stand you see on which my tail is laid. What is it?", "_type": "dict", "Heading": "Lewis Carroll", "Answer": "A Tablet.", "id": 3627}, {"Category": "Classic Riddles", "Riddle": "What did the pen say to the paper?", "_type": "dict", "Heading": "Pen And Paper", "Answer": "Lets run away and WRITE", "id": 3628}, {"Category": "Classic Riddles", "Riddle": "A forest exists somewhere on Earth. This forest has no life except for trees. After a storm, a tree was hit by lightning and falls.\n\r\n\nWhat sound would it make?", "_type": "dict", "Heading": "Existence", "Answer": "None. Sound does not exist if it is unheard.", "id": 3629}, {"Category": "Classic Riddles", "Riddle": "Why is a farm-yard like a hotel?", "_type": "dict", "Heading": "Farm Yard Riddle", "Answer": "It is generally patronized by gobblers.", "id": 3630}, {"Category": "Classic Riddles", "Riddle": "My first is a fluid, my second a solid, my whole a plant. What is it?", "_type": "dict", "Heading": "The Initials Form An Object Of Interest, And The Finals Its Receptacle.", "Answer": "Liquorice.", "id": 3631}, {"Category": "Classic Riddles", "Riddle": "A train just leaves a station and enters a tunnel. Where is the best place for a claustrophobic person to sit?", "_type": "dict", "Heading": "Claustrophobia", "Answer": "In the back. See, the train is still accelerating as it is leaving the station so the train will be moving faster when the back of the train enters the tunnel.", "id": 3660}, {"Category": "Classic Riddles", "Riddle": "Not born, but from a Mother's body drawn, I hang until half of me is gone. I sleep in a cave until I grow old, then valued for my hardened gold. What am I?", "_type": "dict", "Heading": "Smelly But Good", "Answer": "Cheese.", "id": 3661}, {"Category": "Classic Riddles", "Riddle": "A clock chimes 5 times in 4 seconds. How many times will it chime in 10 seconds?", "_type": "dict", "Heading": "Clock Chimes", "Answer": "11 times. It chimes at zero and then once every second for 10 seconds.", "id": 3662}, {"Category": "Classic Riddles", "Riddle": "Who are the two brothers who live on opposite sides of the road yet never see each other?", "_type": "dict", "Heading": "Opposite Sides", "Answer": "A person's eyes, the nose is the road.", "id": 3663}, {"Category": "Classic Riddles", "Riddle": "How can you hold a piece of string, one end in each hand, and tie a knot in the string with out letting go of either end?", "_type": "dict", "Heading": "A Knotty Problem", "Answer": "Cross your arms before you seize the ends of the string. Uncross your arms and it will tie a knot!", "id": 3664}, {"Category": "Classic Riddles", "Riddle": "A horse travels a certain distance each day. Strangely enough, two of its legs travel 30 miles each day and the other two legs travel nearly 31 miles. It would seem that two of the horse's legs must be one mile ahead of the other two legs, but of course this can't be true, since the horse is normal. How is this possible?", "_type": "dict", "Heading": "Horse Travel Brain Teaser", "Answer": "The horse operates a mill and travels in a circular clockwise direction. The two outside legs will travel a greater distance than the two inside legs.", "id": 3665}, {"Category": "Classic Riddles", "Riddle": "The answer I give is yes, but what I mean is no. What was the question?", "_type": "dict", "Heading": "That's Confusing", "Answer": "Do you mind?", "id": 3666}, {"Category": "Classic Riddles", "Riddle": "Black I am and much admired, men seek me until they're tired. When they find me, they break my head, and take from me my resting bed. What am I?", "_type": "dict", "Heading": "Not Appreciated", "Answer": "Coal", "id": 3667}, {"Category": "Classic Riddles", "Riddle": "Ben walked into a hardware store and asked the price of some items. The salesman said: One costs $1, Eight costs $1, Seventeen cost $2, One hundred four costs $3 and One thousand seventy two costs $4. What was Ben buying?", "_type": "dict", "Heading": "What Is Ben Buying", "Answer": "Ben was buying home address numbers and they cost $1 per digit.", "id": 3668}, {"Category": "Classic Riddles", "Riddle": "Jack has 8 bricks 7 of them weights the same amount and one is slightly heavier. Using a balance scale, how can Jack find the heavier brick in two weighings?", "_type": "dict", "Heading": "Odd Brick Out", "Answer": "First he split them in to piles of 3, 3, and 2 bricks. Then he weighs both groups of 3 with each other. If they balance he knows the brick is one of the 2 unweighed bricks and he can weigh them to find the heaver one. If the the stacks of 3 bricks do not balance, he will weigh 2 of the 3 bricks. If they balance he will know the brick left unweighed is heavier, or if they do not balance, he will find the heavier one.", "id": 3669}, {"Category": "Classic Riddles", "Riddle": "Read my riddle, I pray. What God never sees, what the king seldom sees, and what we see every day. What is it?", "_type": "dict", "Heading": "What Is It Riddle?", "Answer": "An equal.", "id": 3690}, {"Category": "Classic Riddles", "Riddle": "What is it that when you take away the whole, you still have some left over?", "_type": "dict", "Heading": "From The Whole", "Answer": "Wholesome!", "id": 3691}, {"Category": "Classic Riddles", "Riddle": "What can go up a chimney down, but cannot go down a chimney up?", "_type": "dict", "Heading": "One Way Out", "Answer": "An umbrella.", "id": 3692}, {"Category": "Classic Riddles", "Riddle": "You are in a room that is completely bricked in on all four sides, including the ceiling and floor. You have nothing but a mirror and a wooden table in the room with you. How do you get out?", "_type": "dict", "Heading": "All Four Sides", "Answer": "You look in the mirror you see what you saw, you take the saw and you cut the table in half, two halves make a whole, and you climb out the hole.", "id": 3693}]