[{"Category": "Difficult Riddles", "Riddle": "Mr. and Mrs. Mustard have six daughters and each daughter has one brother. How many people are in the Mustard family?", "_type": "dict", "Heading": "The Mustard Family", "Answer": "There are nine Mustards in the family. Since each daughter shares the same brother, there are six girls, one boy and Mr. and Mrs. Mustard.", "id": 157}, {"Category": "Difficult Riddles", "Riddle": "I am something people love or hate. I change peoples appearances and thoughts. If a person takes care of them self I will go up even higher. To some people I will fool them. To others I am a mystery. Some people might want to try and hide me but I will show. No matter how hard people try I will Never go down. What am I?", "_type": "dict", "Heading": "Priceless", "Answer": "Age.", "id": 158}, {"Category": "Difficult Riddles", "Riddle": "Only one color, but not one size, \n Stuck at the bottom, yet easily flies. \n Present in sun, but not in rain, \n Doing no harm, and feeling no pain. \n What is it?", "_type": "dict", "Heading": "Only One Color, But Not One Size,", "Answer": "It's a shadow!", "id": 159}, {"Category": "Difficult Riddles", "Riddle": "Who is that with a neck and no head, two arms and no hands?  What is it?", "_type": "dict", "Heading": "No Hands", "Answer": "A shirt.", "id": 160}, {"Category": "Difficult Riddles", "Riddle": "If eleven plus two equals one, what does nine plus five equal?", "_type": "dict", "Heading": "Simple Addition", "Answer": "11 o'clock plus 2 hours = 1 o'clock\n\r\n\n9 o'clock plus 5 hours = 2 o'clock", "id": 161}, {"Category": "Difficult Riddles", "Riddle": "Can you write down eight eights so that they add up to one thousand?", "_type": "dict", "Heading": "Eight Eights", "Answer": "888 + 88 + 8 + 8 + 8 = 1000.", "id": 162}, {"Category": "Difficult Riddles", "Riddle": "It can't be seen, can't be felt, can't be heard, and can't be smelt. It lies behind stars and under hills, And empty holes it fills. It comes first and follows after, Ends life, and kills laughter. What is it?", "_type": "dict", "Heading": "Ends Life Riddle", "Answer": "The dark.", "id": 163}, {"Category": "Difficult Riddles", "Riddle": "What English word retains the same pronunciation, even after you take away four of its five letters?", "_type": "dict", "Heading": "New Words", "Answer": "Queue.", "id": 164}, {"Category": "Difficult Riddles", "Riddle": "What is it that given one, you'll have either two or none?", "_type": "dict", "Heading": "Given One", "Answer": "A choice.", "id": 165}, {"Category": "Difficult Riddles", "Riddle": "Three playing cards in a row. Can you name them with these clues? There is a two to the right of a king. A diamond will be found to the left of a spade. An ace is to the left of a heart. A heart is to the left of a spade. Now, identify all three cards.", "_type": "dict", "Heading": "Playing Cards", "Answer": "Ace of Diamonds, King of Hearts, Two of Spades.", "id": 166}, {"Category": "Difficult Riddles", "Riddle": "George, Helen, and Steve are drinking coffee. Bert, Karen, and Dave are drinking soda. Using logic, is Elizabeth drinking coffee or soda?", "_type": "dict", "Heading": "Coffee Or Soda", "Answer": "Elizabeth is drinking coffee. The letter E appears twice in her name, as it does in the names of the others that are drinking coffee.", "id": 417}, {"Category": "Difficult Riddles", "Riddle": "When John was six years old he hammered a nail into his favorite tree to mark his height. Ten years later at age sixteen, John returned to see how much higher the nail was. If the tree grew by five centimeters each year, how much higher would the nail be?", "_type": "dict", "Heading": "A Growing Tree", "Answer": "The nail would be at the same height since trees grow at their tops.", "id": 418}, {"Category": "Difficult Riddles", "Riddle": "Which of the following words don't belong in the group and why? CORSET, COSTER, SECTOR, ESCORT, COURTS", "_type": "dict", "Heading": "Don't Belong", "Answer": "Courts. All of the others are anagrams of each other.", "id": 419}, {"Category": "Difficult Riddles", "Riddle": "I am four times as old as my daughter. In 20 years time I shall be twice as old as her.\n\r\n\nHow old are we now?", "_type": "dict", "Heading": "4x As Old", "Answer": "I am 40 and my daughter is 10.", "id": 420}, {"Category": "Difficult Riddles", "Riddle": "There was a man who was born before his father, killed his mother, and married his sister. Yet, there was nothing wrong with what he had done. Why?", "_type": "dict", "Heading": "I'm A Good Guy!", "Answer": "His father was in front of him when he was born, therefore he was born before him. His mother died while giving birth to him. Finally, he grew up to be a minister and married his sister at her ceremony.", "id": 421}, {"Category": "Difficult Riddles", "Riddle": "Lily is a lilypad in a small pond. Lilly doubles her size each day, On the 20th day she covers the whole pond. On what day was Lily half the size of the pond?", "_type": "dict", "Heading": "Lily The Lillypad", "Answer": "Day 19, it's not 10 because on day 20 she doubled from day 19, so 19 must be half the size of the pond.", "id": 422}, {"Category": "Difficult Riddles", "Riddle": "What common English verb becomes its own past tense by rearranging its letters?", "_type": "dict", "Heading": "Recycling Letters", "Answer": "Eat and Ate.", "id": 423}, {"Category": "Difficult Riddles", "Riddle": "It is a 5 letter word if you take away first letter it is something you get from sun, if you remove second letter you will get something to eat, if you remove third letter you get a word you use in pointing at and if you remove the fourth letter you get something to drink. What is it?", "_type": "dict", "Heading": "Find It", "Answer": "Wheat.", "id": 424}, {"Category": "Difficult Riddles", "Riddle": "Which word is the odd one out: Seventy, Brawl, Clover, Proper, Carrot, Swing, Change, Travel, Sacred, Stone?", "_type": "dict", "Heading": "Which Word Does Not Belong?", "Answer": "Carrot. When the first and last letters are removed from the other words, they still spell another word.", "id": 425}, {"Category": "Difficult Riddles", "Riddle": "The ages of a father and son add up to 66. \n The father's age is the son's age reversed. \n How old could they be? \n (3 possible solutions).", "_type": "dict", "Heading": "Age Of Father And Son", "Answer": "51 and 15. 42 and 24. 60 and 06.", "id": 426}, {"Category": "Difficult Riddles", "Riddle": "What two whole, positive numbers that have a one-digit answer when multiplied and a two-digit answer when added?", "_type": "dict", "Heading": "Numbers Added And Multiplied Riddle", "Answer": "1 and 9.", "id": 668}, {"Category": "Difficult Riddles", "Riddle": "You want to boil a two-minute egg. If you only have a three-minute timer (hourglass), a four-minute timer and a five-minute timer, how can you boil the egg for only two minutes?", "_type": "dict", "Heading": "Boiling An Egg", "Answer": "Once the water is boiling, turn the three-minute timer and five-minute timer over. When the three-minute timer runs out, put the egg in the boiling water. When the five-minute timer runs out, two minutes have elapsed and it is time take the egg out of the water. You don't need the four-minute timer for this riddle.", "id": 669}, {"Category": "Difficult Riddles", "Riddle": "How much will a 38° angle measure when looked at under a microscope that magnifies ten times?", "_type": "dict", "Heading": "Angle Measure Riddle", "Answer": "It will still be 38°.", "id": 670}, {"Category": "Difficult Riddles", "Riddle": "Lighter than what I am made of, More of me is hidden Than is seen. What am I?", "_type": "dict", "Heading": "Hidden Weight", "Answer": "An iceberg.", "id": 671}, {"Category": "Difficult Riddles", "Riddle": "When asked how old she was, Suzie replied, \"In two years I will be twice as old as I was five years ago.\" How old is she?", "_type": "dict", "Heading": "Impossible Age", "Answer": "She's 12!", "id": 672}, {"Category": "Difficult Riddles", "Riddle": "What was never scared but became petrified, can't make a bird but can make a bat, can't live in a house but would die to have one.  What is it?", "_type": "dict", "Heading": "Always Around", "Answer": "A tree.", "id": 673}, {"Category": "Difficult Riddles", "Riddle": "How old is your son? asked a man to his neighbour. My son is five times as old as my daughter and my wife is five times as old as my son. Iam twice as old as my wife whereas my grandmother, who is celebrating her eighty-first birthday is as old as all of us put togeather.\n\r\n\nHow old is the man's son?", "_type": "dict", "Heading": "Grandmothers Birthday", "Answer": "Five.", "id": 674}, {"Category": "Difficult Riddles", "Riddle": "It has five wheels, though often think four, You cannot use it without that one more, You can put things in it, you can strap things on top, You can't find it in the market, but you can still go shop. What is it?", "_type": "dict", "Heading": "Wheels", "Answer": "A car.", "id": 675}, {"Category": "Difficult Riddles", "Riddle": "I am a three digit number. \n My tens digit is five more than my ones digit. \n My hundreds digit is eight less than my tens digit. \n What number am I?", "_type": "dict", "Heading": "I Am A Three Digit Number", "Answer": "Number 194.", "id": 676}, {"Category": "Difficult Riddles", "Riddle": "Different lights do make me strange, thus into different sizes I will change. What am I?", "_type": "dict", "Heading": "Always Change", "Answer": "I am the pupil of an eye.", "id": 677}, {"Category": "Difficult Riddles", "Riddle": "If 4+2=26, 8+1=79 and 6+5=111. Then, what is 7+3?", "_type": "dict", "Heading": "Expert Level Mathematics", "Answer": "410.4+2=26 is because 4-2=2 and 4+2=6,so it is 26. Therefore, 7-3=4 and 7+3=10(410).", "id": 896}, {"Category": "Difficult Riddles", "Riddle": "My thunder comes before the lightning; My lightning comes before the clouds; My rain dries all the land it touches. What am I?", "_type": "dict", "Heading": "Rain That Dries", "Answer": "A volcano.", "id": 897}, {"Category": "Difficult Riddles", "Riddle": "Find the four digit number in which the first digit is one fourth of the last digit, the second digit is 6 times the first digit, and the third digit is the second digit plus 3. What is it?", "_type": "dict", "Heading": "Four Digit Number", "Answer": "1694.", "id": 898}, {"Category": "Difficult Riddles", "Riddle": "Something very extraordinary happened on the 6th of May, 1978 at 12:34 a.m. What was it?", "_type": "dict", "Heading": "Sequences Of Time", "Answer": "At that moment, the time and day could be written as: 12:34, 5/6/78.", "id": 899}, {"Category": "Difficult Riddles", "Riddle": "My tongue is long, my breath is strong, \nAnd yet I breed no strife; \nMy voice you hear both far and near, \nAnd yet I have no life.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Hear My Voice", "Answer": "A bell.", "id": 900}, {"Category": "Difficult Riddles", "Riddle": "On my own, I am darkness, a black abyss. But, Life brings me light with its gentle kiss. I am quiet and cold, but warmth I can hold. Alongside beauties and wonders, sights to be told. My surface may be bare, this I'm aware. But, beautiful secrets I am eager to share. My mouth so large, I swallow you whole. To be in my belly is your goal. What may lie within can drive men to sin. Greed and desire, gluttony's kin. For some, I am fear. For others, hope. My perception shaped from life's scope. From the earth I have come, and forever will stay, even if parts of me crumble away. What am I?", "_type": "dict", "Heading": "Riddle MB This*", "Answer": "A cave.", "id": 901}, {"Category": "Difficult Riddles", "Riddle": "Without a bridle, or a saddle, across a thing I ride a-straddle. And those I ride, by help of me, though almost blind, are made to see.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "No Saddle!", "Answer": "Eye glasses.", "id": 902}, {"Category": "Difficult Riddles", "Riddle": "White bird, featherless, flyin' out o' paradise, flyin' over sea and land, dyin' in my hand. What is it?", "_type": "dict", "Heading": "Featherless Bird", "Answer": "A snowflake!", "id": 903}, {"Category": "Difficult Riddles", "Riddle": "There's one \"sport\" in which neither the spectators nor the participants know the score or the leader until the contest ends.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "What's The Score?", "Answer": "Boxing.", "id": 904}, {"Category": "Difficult Riddles", "Riddle": "Four letters form me quite complete, \nAs all who breathe do show; \nReversed, you'll find I am the seat \nOf infamy and woe. \nTransposed, you'll see I'm base and mean, \nAgain of Jewish race; \nTransposed once more, I oft am seen \nTo hide a lovely face.\n\r\n\nWhat are the five words?", "_type": "dict", "Heading": "Five Words From Four Letters", "Answer": "Live, evil, vile, Levi, veil.", "id": 905}, {"Category": "Difficult Riddles", "Riddle": "How high would you have to count before you would use the letter A in the English language spelling of a whole number.", "_type": "dict", "Heading": "The Letter A Count", "Answer": "One thousand.", "id": 1046}, {"Category": "Difficult Riddles", "Riddle": "There are two numbers whose product added to the sum of their squares is 109, and the difference of whose squares is 24. What are the two numbers?", "_type": "dict", "Heading": "Two Numbers Math Riddle", "Answer": "5 and 7.\n\r\n\n(5)² = 25\n(7)² = 49\n(5x7)+25+49=109\n49-25=24", "id": 1047}, {"Category": "Difficult Riddles", "Riddle": "I am not found on any ground,\nBut always in the air; \nThough charged each cloud with thunder loud, \nYou can not find me there. \nNow, if from France you choose to dance \nYour way just into Spain, \nI there am seen, and near the queen, \nIn hail, in mist, and rain.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Enigma, I Am Found On The Ground...", "Answer": "The letter I.", "id": 1048}, {"Category": "Difficult Riddles", "Riddle": "2, 3, 5, 9, 17, _ What is the next number in the sequence?", "_type": "dict", "Heading": "What's The Next Number?", "Answer": "33. The pattern:  Double the previous number and subtract 1.", "id": 1049}, {"Category": "Difficult Riddles", "Riddle": "Two schoolgirls were traveling from the city to a dacha (summer cottage) on an electric train.\n\r\n\n\"I notice,\" one of the girls said \"that the dacha trains coming in the opposite direction pass us every 5 minutes. What do you think-how many dacha trains arrive in the city in an hour, given equal speeds in both directions?\"\n\r\n\n\"Twelve, of course,\" the other girl answered, \"because 60 divided by 5 equals 12.\"\n\r\n\nThe first girl did not agree. What do you think?", "_type": "dict", "Heading": "Riding The Train", "Answer": "If the girls had been on a standing train, the first girl's calculations would have been correct, but their train was moving. It took 5 minutes to meet a second train, but then it took the second train 5 more minutes to reach where the girls met the first train. So the time between trains is 10 minutes, not 5, and only 6 trains per hour arrive in the city.", "id": 1050}, {"Category": "Difficult Riddles", "Riddle": "Combine plus signs and five 2's to get 28. Combine plus signs and eight 8's to get 1,000.", "_type": "dict", "Heading": "With The Same Figures", "Answer": "22+2+2+2=28; 888+88+8+8+8=1,000", "id": 1051}, {"Category": "Difficult Riddles", "Riddle": "Gaze at this sentence for just about sixty seconds and then explain what makes it quite different from the average sentence. Quick!\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Quick!", "Answer": "It contains all of the letters in the alphabet.", "id": 1052}, {"Category": "Difficult Riddles", "Riddle": "There is a certain club which is for men only. There are 600 men who belong to this club and 5% of these men wear one earring. Of the other 95% membership, half wear two earrings and the other half wear none. How many earrings are being worn in this club?", "_type": "dict", "Heading": "Mens Club", "Answer": "Six hundred. We know that 5%, or 30 of the men are wearing one earring. Of the other 95%, or 570, we know that half are wearing two earrings and the other half none. This is the same as if they all wore one.", "id": 1053}, {"Category": "Difficult Riddles", "Riddle": "I come in a cone but I am not food;\n\r\n\nI will be skewed if you screw with my hue;\n\r\n\nI come by the millions but you can probably only name a few.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Come By The Millions", "Answer": "Colors.", "id": 1054}, {"Category": "Difficult Riddles", "Riddle": "My first is a negative greatly in use, \nBy which people begin when they mean to refuse; \nMy second is Fashion, or so called in France, \nBut, like other whims, is the servant of chance. \nAn article always in use is my whole, \nWith texture and form under fashion’s control; \nBut, alas! not a thing can it see which goes by, \nAlthough many have four sights, and all have one eye.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Baby's Got Back", "Answer": "But-ton.", "id": 1055}, {"Category": "Difficult Riddles", "Riddle": "Eight years ago, Bill was eight times the age of his son Bill Jr. Today, if you add their ages together, they add up to 52. How old are Bill and his son?", "_type": "dict", "Heading": "Bill And Bill Jr.", "Answer": "Bill is 40, and Bill Jr. is 12.", "id": 1196}, {"Category": "Difficult Riddles", "Riddle": "One fourth of the population of a newly discovered planet have 4 legs. The rest have two legs. There are 60 legs total. How big is the population of the newly discovered planet?", "_type": "dict", "Heading": "How Many Are There Math Riddle", "Answer": "24.", "id": 1197}, {"Category": "Difficult Riddles", "Riddle": "My first is found on the ocean wave, \nIn the spring, the pit, and the mine; \nMy second below earth’s surface you have, \nWhere seldom the sun can shine. \nMy whole your dinner-table must grace, \nAnd seldom fails to obtain a place.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Teeth", "Answer": "Salt-cellar.", "id": 1198}, {"Category": "Difficult Riddles", "Riddle": "A nonstop train leaves Moscow for Leningrad at 60 mph. Another nonstop train leaves Leningrad for Moscow at 40 mph. How far apart are the trains 1 hour before they pass each other?", "_type": "dict", "Heading": "Two Trains", "Answer": "100 miles (60+40)", "id": 1199}, {"Category": "Difficult Riddles", "Riddle": "Four jolly men sat down to play, \n And played all night till break of day. \n They played for cash and not for fun, \n With a separate score for every one. \n When it came time to square accounts, \n they all had made quite fair amounts. \n Now, not one has lost and all have gained - \n Tell me now, this can you explain?", "_type": "dict", "Heading": "Four Jolly Men Play", "Answer": "The four jolly men are members of an orchestra hired to play at a dance.", "id": 1200}, {"Category": "Difficult Riddles", "Riddle": "There is one word in the English language which is universally considered a preventive of harm; change a certain letter in it, and you make it an act of cruelty. What are the words?", "_type": "dict", "Heading": "Change One Letter", "Answer": "Prescription—proscription.", "id": 1201}, {"Category": "Difficult Riddles", "Riddle": "A 300 ft. train is traveling 300 ft. per minute must travel through a 300 ft. long tunnel.  How long will it take the train to travel through the tunnel?", "_type": "dict", "Heading": "Train Math Riddle", "Answer": "Two minutes. It takes the front of the train one minute and the rest of the train will take two minutes to clear the tunnel.", "id": 1202}, {"Category": "Difficult Riddles", "Riddle": "Three-fourths of a cross, and a circle complete, An upright where two semicircles meet, A rectangle triangle standing on feet, Two semicircles, and a circle complete. What is it?", "_type": "dict", "Heading": "Guess What It Is Riddle", "Answer": "Tobacco.", "id": 1203}, {"Category": "Difficult Riddles", "Riddle": "My first may be fashioned of iron or wood, \nAnd at window or door for safety is placed; \nIn village or town it does more harm than good, \nLeading people their health, time, and money to waste. \nMy second’s a lady, bewitching and fair, \nAnd for love of her people will labor and strive; \nWill rise before dawn, and be wearied with care, \nAnd pursue her with ardor as long as they live. \nMy whole is what ladies admire and approve, \nThe shopkeeper’s boast—the purchaser’s prize; \n’Tis a ninepenny chintz—’tis a one-shilling glove— \nIt is something which makes people open their eyes.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Shopping Riddle", "Answer": "Bar-gain.", "id": 1204}, {"Category": "Difficult Riddles", "Riddle": "Why is an orange not like a church bell?", "_type": "dict", "Heading": "Church Bell", "Answer": "Because it is never peeled (pealed) but once.", "id": 1205}, {"Category": "Difficult Riddles", "Riddle": "Tom volunteered to be the chief organizer for the world's tether ball championships. There were 657 contestants from around the world. The tournament was set up whereby the winner would advance and the loser would be eliminated. Since there was an odd number of participants, the initial pairing leaves one player out. That player gets a bye and automatically advances to the next round. How many matches will Tom have to schedule to determine the tether ball champion?", "_type": "dict", "Heading": "Hard Job", "Answer": "656 matches will be needed.", "id": 1346}, {"Category": "Difficult Riddles", "Riddle": "A hundred stones are placed, in a straight line, a yard distant from each other. How many yards must a person walk, who undertakes to pick them up, and place them in a basket stationed one yard from the first stone?", "_type": "dict", "Heading": "A Hundred Stones", "Answer": "In solving this question it is clear that to pick up the first stone and put it into the basket, the person must walk two yards, one in going for the stone and another in returning with it; that for the second stone he must walk four yards, and so on increasing by two as far as the hundredth, when he must walk two hundred yards, so that the sum total will be the product of 202 multiplied by 50, or 10,100 yards. If any one does not see why we multiply 202 by 50 in getting the answer, we refer him to his arithmetic.", "id": 1347}, {"Category": "Difficult Riddles", "Riddle": "’Tis found in our troubles, ’tis mixed with our pleasures, \n’Tis laid up above with our heavenly treasures; \n’Tis whispered in heaven, and ’tis muttered in hell, \nAnd it findeth a place in each sybilline spell; \nIn Paradise nestled, ’mid Eden’s fair flowers, \nIt has sported with Eve in rose-perfumed bowers; \n’Tis muttered in curses, yet breathed in our prayers; \nFrom the path of our duty it tempts us in snares. \nDeep, deep in our hearts you will find it engraved; \nThough in misery sunk, yet from sin it is saved. \n’Tis found in the stream that flows on to the ocean; \nThough in bustle forever, ’tis ne’er in commotion. \n’Tis wafted afar o’er the land in each breath; \nIn the grave ’tis decaying—you'll find it in death. \nIt is floating away on the broad stream of time, \nYet it findeth a place in eternity’s clime. \nIn the legends of nations it holdeth a place; \nThere’s no charm without it to the beautiful face. \nIn thunder you'll hear it, if closely you listen; \nIn moonbeam and sunbeam forever ’twill glisten. \nIn the dew-drop it sparkles; ’tis found in the forest; \nIt whispers in peace when our need is the sorest. \nWhat am I?", "_type": "dict", "Heading": "Enigma, Tis Whispered In Heaven", "Answer": "The letter E.", "id": 1348}, {"Category": "Difficult Riddles", "Riddle": "What is significant about 3661 seconds past midnight on 1st January 2001?", "_type": "dict", "Heading": "Date Significance", "Answer": "The time and date will be 01:01:01 on 01/01/01.", "id": 1349}, {"Category": "Difficult Riddles", "Riddle": "What is the 4 digit number in which the first digit is one-fifth of the last, and the second and third digits are the last digit multiplied by 3?", "_type": "dict", "Heading": "The 4 Digit Number", "Answer": "1155.", "id": 1350}, {"Category": "Difficult Riddles", "Riddle": "I am not found on any ground, \nBut always in the air; \nThough charged each cloud with thunder loud, \nYou can not find me there. \nNow, if from France you choose to dance \nYour way just into Spain, \nI there am seen, and near the queen, \nIn hail, in mist, and rain.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Enigma Riddle", "Answer": "The letter I.", "id": 1351}, {"Category": "Difficult Riddles", "Riddle": "Walking home one day, you take a short cut along the train tracks. The tracks cross a narrow bridge over a deep gorge. At the point you are 3/8 of the way across the bridge, you hear the train whistle somewhere behind you. You charge across the bridge, and jump off the track as the train is about to run you down. As it happens, if you had gone the other way, you would have reached safety just before being run over as well. If you can run ten miles per hour, how fast is the train moving?", "_type": "dict", "Heading": "Cut Along The Tracks", "Answer": "The train is moving at 40 miles per hour. Imagine that a friend is walking with you. When the train whistle blows, you head away from the train, he heads toward it. When he reaches safety, you will be 6/8 (or 3/4)of the way across the bridge, and the train will have just reached the bridge. For the train to cross 4/4 of the bridge in the time you cross the remaining 1/4, the train must be moving four times your speed.", "id": 1352}, {"Category": "Difficult Riddles", "Riddle": "Twelve flags stand equidistant along the track at the stadium. The runners start at the first flag. A runner reaches the eighth flag 8 seconds after he starts. If he runs at an even speed, how many seconds does he need altogether to reach the twelfth flag?", "_type": "dict", "Heading": "At The Stadium", "Answer": "Not 12 seconds. There are 7 segments from the first flag tot the eighth, and 11 from the first to the twelfth. He runs each segment in 8/7 seconds; therefore, 11 segments take 88/7= 12 4/7 seconds.", "id": 1353}, {"Category": "Difficult Riddles", "Riddle": "A boy has as many sisters as brothers, but each sister has only half as many sisters as brothers.\n\r\n\nHow many brothers and sisters are there in the family?", "_type": "dict", "Heading": "How Many?", "Answer": "Four brothers and three sisters.", "id": 1354}, {"Category": "Difficult Riddles", "Riddle": "My only timepiece is a wall clock. One day I forgot to wind it and it stopped. I went to visit a friend whos watch is always correct, stayed awhile, and then went home. There I made a simple calculation and set the clock right.\n\r\n\nHow did I do this even though I had no watch on me to tell how long it took me to return from my friend's house?", "_type": "dict", "Heading": "The Stopped Clock", "Answer": "Before I left, I wound the wall clock. When I returned, the change in time equaled how long it took to go to my friends house and return, plus the time I spent there. But I knew the latter because I looked at my friends watch when I arrived and left.\n\r\n\nSubtracting the time of the visit from the time I was absent from my house, and dividing by 2, I obtained the time it took me to return home. I added this time to what my friend watch showed when I left, and set the sum on my wall clock.", "id": 1355}, {"Category": "Difficult Riddles", "Riddle": "Granny looked up from her rocking chair and said: As far as I can tell, there is only one anagram of the word trinket.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Wise Granny", "Answer": "The word knitter.", "id": 1496}, {"Category": "Difficult Riddles", "Riddle": "Lazy Larry agreed to work on a job for his brother-in-law for thirty hours at eight dollars an hour, on the condition that he would forfeit ten dollars per hour for every hour that he idled. At the end of the thirty hours Larry wasn't owed any money and didn't owe his brother-in-law any money either. How many hours did Larry work and how many hours did he idle?", "_type": "dict", "Heading": "Lazy Larry", "Answer": "Lazy Larry worked 16-2/3 hours and idled 13-1/3 hours. 16-2/3 hours, at $8.00 an hour amounts to the same amount as 13-1/3 hours at $10.00 per hour.", "id": 1497}, {"Category": "Difficult Riddles", "Riddle": "A house has 6 stories, each the same height. How many times as long is the ascent to the sixth floor as the ascent to the third?", "_type": "dict", "Heading": "Stairs", "Answer": "2 1/2 times (5/2, not 6/3).", "id": 1498}, {"Category": "Difficult Riddles", "Riddle": "Try deciphering this code - S T O E E I T A E S S S I N O Y (Hint - count and you will have the answer!)", "_type": "dict", "Heading": "Code Riddle", "Answer": "Did you count the number of letters? There are 16 of them. Divide them in groups of 4. Then, put each group below the other, and read column wise. Here's how you do it... S T O E E I T A E S S S I N O Y The answer to the code is See it is not so easy.", "id": 1499}, {"Category": "Difficult Riddles", "Riddle": "A man had a bar of lead that weighed 40 lbs., and he divided it into four pieces in such a way as to allow him to weigh any number of pounds from one to forty. What are the weights of the four pieces?", "_type": "dict", "Heading": "Divide Into Four Pieces", "Answer": "1, 3, 9, 27, are the weights of the four pieces.", "id": 1500}, {"Category": "Difficult Riddles", "Riddle": "As defendants, we deny all involvement in the unscrupulous dealings which have come to light in the recent government investigation.  What country name is hidden in the previous sentence?", "_type": "dict", "Heading": "Hidden Country", "Answer": "Sweden. \"defendant\ns\n, \nwe den\ny\".", "id": 1501}, {"Category": "Difficult Riddles", "Riddle": "A man has nine children, born at regular intervals. The sum of their squares of their ages is equal to the square of his own age.\n\r\n\nWhat are  the ages of the children?", "_type": "dict", "Heading": "Children Squared", "Answer": "2  -  5  -  8  -  11  -  14  -  17  -  20  -  23  -  26", "id": 1502}, {"Category": "Difficult Riddles", "Riddle": "A man bumps into his mathematician friend on the street that he hasn't seen in 5 years. The man asks the mathematician how old his children are. The mathematician, who always replies in riddles said, \"I now have three children. The sum of their ages is equal to the number of windows on the building in front of you and the product of their ages equals 36.\" The friend then says \"I need one more piece of information.\" The mathematician then replies \"My youngest child has blue eyes.\" What are the ages of the mathematicians three children?", "_type": "dict", "Heading": "Speaking In Riddles", "Answer": "They are 6, 6, and 1.", "id": 1503}, {"Category": "Difficult Riddles", "Riddle": "When I asked her how old she was, she smiled and said cryptically: \"The day before yesterday I was 22, but next year I'll be 25.\" What is her birthday and when was the date of our conversation?", "_type": "dict", "Heading": "How Old Are You?", "Answer": "We conversed on January 1 and her birthday was on December 31. So, the day before yesterday on Dec. 30th she was 22 and he turned 23 on Dec. 31. So her next birthday, when she turns 24, would be Dec. 31 of the same year the question was asked.  However, next years birthday would be the following year on Dec. 31, when she would be 25.", "id": 1504}, {"Category": "Difficult Riddles", "Riddle": "What is the next 3 letters in this riddle? o t t f f s s _ _ _", "_type": "dict", "Heading": "Next 3 Letters", "Answer": "e n t They represent the first letter when writing the numbers one thru ten.", "id": 1505}, {"Category": "Difficult Riddles", "Riddle": "What is the difference between a school boy studying and a farmer watching his cattle?", "_type": "dict", "Heading": "Vague Differences", "Answer": "One is stocking his mind, while the other is minding his stock.", "id": 1646}, {"Category": "Difficult Riddles", "Riddle": "Suppose you want to send in the mail a valuable object to a friend. You have a box which is big enough to hold the object. The box has a locking ring which is large enough to have a lock attached and you have several locks with keys. However, your friend does not have the key to any lock that you have. You cannot send the key in an unlocked box since it may be stolen or copied. How do you send the valuable object, locked, to your friend - so it may be opened by your friend?", "_type": "dict", "Heading": "Mailing A Valuable Object", "Answer": "Send the box with a lock attached and locked. Your friend attaches his or her own lock and sends the box back to you. You remove your lock and send it back to your friend. Your friend may then remove the lock she or he put on and open the box.", "id": 1647}, {"Category": "Difficult Riddles", "Riddle": "A horse travels a certain distance each day. Strangely enough, two of its legs travel 30 miles each day and the other two legs travel nearly 31 miles. It would seem that two of the horse's legs must be one mile ahead of the other two legs, but of course this can't be true, since the horse is normal. How is this possible?", "_type": "dict", "Heading": "Horse Travel Brain Teaser", "Answer": "The horse operates a mill and travels in a circular clockwise direction. The two outside legs will travel a greater distance than the two inside legs.", "id": 1648}, {"Category": "Difficult Riddles", "Riddle": "My first is often at the front door. My second is found in the cereal family. My third is what most people want. My whole is one of the United States. What am I?", "_type": "dict", "Heading": "How Do You Get The Whole United States To Agree?", "Answer": "MATRIMONY (mat rye money). Which is certainly a \"united state\"!", "id": 1649}, {"Category": "Difficult Riddles", "Riddle": "You are standing in front of a room with one lightbulb inside of it. You cannot see if it is on or off. Outside the room, there are 3 switches in the off positions. You may turn the switches any way you want to. You stop turning the switches, enter the room and know which switch controls the lightbulb. How?", "_type": "dict", "Heading": "3 Switches", "Answer": "You turn 2 switches \"on\" and leave 1 switch \"off\" and wait about a minute. Then enter the room, but just before you enter, turn one switch from \"on\" to \"off\". Once in the room, feel the lightbulb - if it is warm, but off, it has to be the last switch you turned off. If it is on, it has to be the switch left on. If it is cold and is off, it has to be the switch you left in the off position.", "id": 1650}, {"Category": "Difficult Riddles", "Riddle": "Three pirates, One Eye, Long John, and Peg Leg, were gambling with pieces of gold. All the winnings were piled up on the table.  One Eye said, 'I have won 1/2' and took a large handful or two. Long John said, 'I have won 1/3' and took a handful. Peg Leg said, ' I have won 1/6' and took a small handful.  One Eye said, ' I have taken too much' and returned a half. Long John said, 'I have taken too much' and returned a third. Peg Leg said, 'I have taken too much and returned a sixth.  The money on the table was then shared out equally and they had 42 pieces each.  One Eye said, 'I have now 1/2 of the total originally.' Long John said, ' I now have 1/3 of the originally.'  Peg Leg said, 'I have now 1/6 of the originally.'\n\r\n\nHow much was on the table originally?", "_type": "dict", "Heading": "Pirates", "Answer": "282 Pieces.", "id": 1651}, {"Category": "Difficult Riddles", "Riddle": "I can come in a can,\n\r\n\nI can come as a punch,\n\r\n\nI can come as a win,\n\r\n\nYou can eat me for lunch.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Come As A Punch", "Answer": "Beet/Beat", "id": 1652}, {"Category": "Difficult Riddles", "Riddle": "What word starting with BR, that with the addition of the letter E, becomes another word that sounds the same as the first?", "_type": "dict", "Heading": "Same Pronunciation", "Answer": "Braking becomes Breaking.", "id": 1653}, {"Category": "Difficult Riddles", "Riddle": "My first is a creature whose breeding is unclear. My second, a price you must pay. My whole can be found in the river of Time and refers to events of today. What am I?", "_type": "dict", "Heading": "Events Of Today", "Answer": "Current.", "id": 1654}, {"Category": "Difficult Riddles", "Riddle": "Marking mortal privation, when firmly in place. An enduring summation, inscribed in my face.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Mortal Privation", "Answer": "A Tombstone.", "id": 1655}, {"Category": "Difficult Riddles", "Riddle": "Two cyclists began a training run, one starting from Moscow and the other starting from Simferopol.\n\r\n\nWhen the riders were 180 miles apart, a fly took an interest. Starting on one cyclists shoulder, the fly flew ahead to meet the other cyclist. After reaching him the fly then turned around and yet back. \n\r\n\nThe restless fly continued to shuttleback and fourth until the pair met; then settled on the nose of one rider.\n\r\n\nThe flys speed was 30 mph. Each cyclist speed was 15 mph.\n\r\n\nHow many miles did the fly travel?", "_type": "dict", "Heading": "The Restless Fly", "Answer": "The cyclists took 6 hours to meet. The fly traveled 6*30=180 miles.", "id": 1784}, {"Category": "Difficult Riddles", "Riddle": "I move very slowly at an imperceptible rate, although I take my time, I am never late. I accompany life, and survive past demise, I am viewed with esteem in many women's eyes.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "I Accompany Life", "Answer": "I am your hair.", "id": 1785}, {"Category": "Difficult Riddles", "Riddle": "I am a perching barrel, filled with meat, Taking hits from leaps and dives. Look inside, but do not eat, The meat in there is still alive!", "_type": "dict", "Heading": "Perching Barrel", "Answer": "A thimble on a finger.", "id": 1786}, {"Category": "Difficult Riddles", "Riddle": "Express 100 with 5 1s. Express 100 three ways with five 5s. You can use brackets, parentheses and these signs +,-,X, /", "_type": "dict", "Heading": "One Hundred", "Answer": "111-11=100\n\r\n\n(5 x 5 x 5)-(5 x 5)=100; (5+5+5+5)x 5=100;(5 x 5)(5-(5/5)=100.", "id": 1787}, {"Category": "Difficult Riddles", "Riddle": "You want to send a valuable object to a friend. You have a box which is more than large enough to contain the object. You have several locks with keys. The box has a locking ring which is more than large enough to have a lock attached. But your friend does not have the key to any lock that you have. How do you do it? Note that you cannot send a key in an unlocked box, since it might be copied.", "_type": "dict", "Heading": "Locked And Safe", "Answer": "Attach a lock to the ring. Send it to her. She attaches her own lock and sends it back. You remove your lock and send it back to her. She removes her lock.", "id": 1788}, {"Category": "Difficult Riddles", "Riddle": "One sunny afternoon, three men go for a ride on a hot air balloon over the Sahara desert. An hour into the trip, the balloon begins to lose altitude. A month later, someone found one of the ballooners laying on the desert sand dead, naked, and holding half a toothpick. What happened to him?", "_type": "dict", "Heading": "Air Ballooning", "Answer": "As the balloon lost altitude, the men took of their clothes and threw them overboard to decrease the weight of the balloon. The balloon continued to drop so the men drew straws to see who would be forced to jump. The dead man in the desert drew the shortest one (the half toothpick).", "id": 1789}, {"Category": "Difficult Riddles", "Riddle": "The title of the problem tells you how to approach these four questions.\n\r\n\n(A).  A bus leaves Moscow for Tula at noon. An hour later a cyclist leaves Tula for mosco, moving slower than the bus. When the bus and cyclist meet, which one of the two will be farther from Moscow?\n\r\n\n(B). Which is worth more: a pound of $10 gold peices or half a pound of $20 gold pieces?\n\r\n\n(C). At six o'clock the wall clock struck 6 times. Checking with my watch, I noticed the time between the first and last strokes was 30 seconds. How long will the clock take to strike 12 at midnight?\n\r\n\n(D). Three swallows fly outward from a point. When will they all be on the same plane in space?\n\r\n\nNow check the answers. Did you fall into any of the traps which lurk in these simple problems?", "_type": "dict", "Heading": "Speedily Yet Cautiously ", "Answer": "(A). Neither\n\r\n\n(B). A pound of metal is always more than half a pound of the same metal.\n\r\n\n(C). Six strokes took 30 seconds, therefore 12 strokes will take 60 seconds. But when the clock struck six, there were only 5 intervals between strokes, and each interval was 30/5=6 seconds. Between the first and twelfth strokes there will be 11 intervals of 6 seconds each, therefore 12 strokes will take 66 seconds.\n\r\n\n(D). There is always a plane that contains any 3 points", "id": 1790}, {"Category": "Difficult Riddles", "Riddle": "I have ten or more daughters. I have less than ten daughters. I have at least one daughter. If only one of these statements is true, how many daughters do I have?", "_type": "dict", "Heading": "My Daughters", "Answer": "If I have any daughters, there will always be two statements which are true. Therefore, I have no daughters.", "id": 1791}, {"Category": "Difficult Riddles", "Riddle": "If you like pretty gems that sparkle and shine, I invite you to dig in my virtual mine. My first is purple, fit for a king, My second is green where Dorothy did her thing. My third is red, July's birthstone as well, My fourth is seen in strings and is found inside a shell. My fifth is hard, pure Carbon and expensive to buy, My sixth is Crocodolite, striped like the big cat's eye. Seventh is two words, a man-made fake of April's stone, Eighth is very dark and found at Lightning Ridge alone. Now take from each gem, one letter in its turn, And you will find the stuff for which even the god's yearn.", "_type": "dict", "Heading": "Virtual Mine", "Answer": "Answer: Ambrosia The gems are: Amethyst Emerald ( Emerald City in the Wizard of Oz ) Ruby Pearl Diamond Tiger's eye Cubic Zirconium (Fake diamond) Black Opal Taking the first letter of Amethyst, second of Emerald, etc.. gives Ambrosia - The food of the gods.", "id": 1792}, {"Category": "Difficult Riddles", "Riddle": "(A) Use two digits to make the smallest possible positve intiger.\n\r\n\n(B) Five 3s can express 37:  37=33+3+3/3\n\r\n\nFind another way to do it.\n\r\n\n(C) Use six identical dgits to make 100. (Several solutions are possible.)\n\r\n\n(D) Use five 4s to make 55.\n\r\n\n(E) Use four 9s to make 20.", "_type": "dict", "Heading": "Arithmetical Nuts To Crack", "Answer": "(A) 1 X 1; 1/1;2/2;ect....;1-0;2-1;and many others.\n\r\n\n(B) 37=333/3X3; 37=3 X 3 X 3 + 3/.3\n\r\n\n(C) 99 + 99/99; 55+55- 5- 5; (666-66)/6\n\r\n\n(D) 44 + 44/4=55.\n\r\n\n(E) 9 + 99/9=20.", "id": 1793}, {"Category": "Difficult Riddles", "Riddle": "When I'm used, I'm useless, once offered, soon rejected. In desperation oft expressed, the intended not protected.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Used Uselessly", "Answer": "A poor alibi or excuse.", "id": 1894}, {"Category": "Difficult Riddles", "Riddle": "In yon vast field of cultivated space, I there am found with members of my race; Decapitate me - if you've no objection - You then will find what brings me to perfection; Take one more cut, and then you'll plainly see What Iam destined, day by day, to be. What am I?", "_type": "dict", "Heading": "Beheadment Riddle", "Answer": "WHEAT\n  HEAT\n   EAT", "id": 1895}, {"Category": "Difficult Riddles", "Riddle": "As I traveled up and down our great glorious country, I found myself in a place where the tempature goes up sharply in the day and down at night. This had an effect on my watch, I noticed it was 1/2 a minute faster at nightfall, but at dawn it had lost 1/3 minute, making it only 1/6 minute fast.\n\r\n\nOne morning- May 1- my watch showed the right time. By what date was it 5 minutes faster?", "_type": "dict", "Heading": "My Watch", "Answer": "In 24 hours the watch gained 1/2-1/3= 1/6 minute. It would seem it would be 5 minutes fast in 5 X 6= 30 days; that is,the morning of May 31. But already on the morning of May 28 the was 27/6= 4 1/2 minutes fast. At the close of the day the watch gained 1/2 minute more, so it was 5 minutes fast on may 28.", "id": 1896}, {"Category": "Difficult Riddles", "Riddle": "Who spends the day at the window, goes to the table for meals and hides at night?", "_type": "dict", "Heading": "Incognito!", "Answer": "A fly.", "id": 1897}, {"Category": "Difficult Riddles", "Riddle": "An alarm clock runs 4 minutes slow every hour. It was set right 3 1/2 hours ago. Now another clock which is correct shows noon. \n\r\n\nIn how many minutes, to the nearest minutes, to the nearest minute, will the alarm clock show noon?", "_type": "dict", "Heading": "The Alarm Clock", "Answer": "In 3 1/2 hours the alarm clock has become 14 minutes slow. At noon the alarm clock will fall behind approximently an additional minute. Its hands will show noon in 15 minutes.", "id": 1898}, {"Category": "Difficult Riddles", "Riddle": "The hand sows, the eyes harvest?", "_type": "dict", "Heading": "Sewing Hand", "Answer": "To read and to write.", "id": 1899}, {"Category": "Difficult Riddles", "Riddle": "You have accidently left out the plug and are attempting to fill the bath with both taps full on. The hot tap takes 6 minutes to fill the bath. The cold tap takes 2 minutes and the water empties through the plug hole in 4 minutes.\n\r\n\nIn how many minutes will the bath be filled?", "_type": "dict", "Heading": "Filling A Bath", "Answer": "2 minutes and 24 seconds.", "id": 1900}, {"Category": "Difficult Riddles", "Riddle": "Many-manned scud-thumper, Maker of worn wood, Shrub-ruster, Sky-mocker, Rave! Portly pusher, Wind-slave.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Wild-slave", "Answer": "The ocean!", "id": 1901}, {"Category": "Difficult Riddles", "Riddle": "An eye in a blue face Saw an eye in a green face. \"That eye is like to this eye\" Said the first eye, \"But in low place Not in high place.\"", "_type": "dict", "Heading": "Blue And Green Faces", "Answer": "The sun on the daisies.", "id": 1902}, {"Category": "Difficult Riddles", "Riddle": "A hunter met two shepherds, one of whom had three loaves and the other, five loaves. All the loaves were the same size. The three men agreed to share the eight loaves equally between them. After they had eaten, the hunter gave the shepherds eight bronze coins as payment for his meal. How should the two shepherds fairly divide this money?", "_type": "dict", "Heading": "Two Shepherds", "Answer": "The shepherd who had three loaves should get one coin and the shepherd who had five loaves should get seven coins. If there were eight loaves and three men, each man ate two and two-thirds loaves. So the first shepherd gave the hunter one-third of a loaf and the second shepherd gave the hunter two and one-third loaves. The shepherd who gave one-third of a loaf should get one coin and the one who gave seven-thirds of a loaf should get seven coins.", "id": 1903}, {"Category": "Difficult Riddles", "Riddle": "What number squared = 12345678987654321?", "_type": "dict", "Heading": "Ben's Riddle Game", "Answer": "111,111,111", "id": 1999}, {"Category": "Difficult Riddles", "Riddle": "A student zips on his scooter to ride to the train station to get to college. His home is close to two stops; the first one is a mile from home, and the second is two miles from home in the opposite direction. In the morning, he always gets on at the first stop and in the afternoon, he always gets off at the second one.\n\r\n\nWhy?", "_type": "dict", "Heading": "Getting Around", "Answer": "The sations and his home are on a hill, which allows him to ride down easily on his scooter.", "id": 2000}, {"Category": "Difficult Riddles", "Riddle": "A watchmaker was telephoned urgently to make a house call to replace the broken hands on a clock. He was sik so he sent his apprentice.\n\r\n\nThe apprentice was thorough. When he finished inspecting the clock it was dark. Assuming his work was done, he attached the new hands and set the clock by his pocket watch. It was sic o'clock, so he set the big hand at the 12 and the little hand at the 6.\n\r\n\nThe apprectice returned, but soon the telephone rang. He picked up to his angry client:\n\r\n\n\"You didn't do the job right. The clock shows the wrong time.\"\n\r\n\nSurprised he hurried back. He found the clock showing not much past eight. He handed is watch to the client and showed her that her clock was not even one second late. The client had to agree.\n\r\n\nEarly the nect morning, the client telephoned to say the clock has apparently gone berserk, hands were moving around the clock at will. The apprentice again rushed over, the clock showed a little past seven. After checking his watch he yelled:\n\r\n\n\"You are making fun of me! Your clock shows the right time!\"\n\r\n\nHave you figured out whats going on?", "_type": "dict", "Heading": "The Wondrous Clock", "Answer": "As the problem says the apprentice mixed up the hands so that the minute hand was short and the hour hand was long.\n\r\n\nThe first time the apprentice returned to the client was about 2 hours and 10 minutes after he had set the clock at six.The long had moved olny from twelve to a little past two. The little made two whole circles and an additional 10 minutes. Thus the clock showed the correct time.\n\r\n\nThe next day around 7:o5 a.m.he came a second time,13 hours and 15 minutes after he had set the clock for six. The long had, acting as the hour hand,covered 13 hours to reach 1. The short hand made 13 full circles and 5 minutes, reaching 7, So the clock showed the correct time again.", "id": 2001}, {"Category": "Difficult Riddles", "Riddle": "A man phoned his daughter to ask her to buy a few things he needed for a trip. He told her she would find enough dollar bills for the purchase in an envolope on his desk. She found the note with 98 written on it.\n\r\n\nIn the store she bought $90 dollars worth of things, but when it was time to pay she not only did have $8 left over but she was short.\n\r\n\nBy how much and why?", "_type": "dict", "Heading": "Two Jokes", "Answer": "(A). $4. She had read 86 upside down.\n\r\n\n(B). Turn 9 upside down and exchange it with the 8. Both columms will add to 18.", "id": 2002}, {"Category": "Difficult Riddles", "Riddle": "When the celebrated German mathematician Karl Friedrich Gauss (1777-1855) was nine he was asked to add all the integers from 1 through 100. He quickly added 1 to 100, 2 to 99, and so on for 50 pairs of numbers each adding to 101.\n\r\n\nAnswer: 50 X 101=5,050.\n\r\n\nNow find the sum of all the digits in integers from 1 through 1,000,000,000.\n\r\n\nThat's all the digits in all the numbers, not all the numbers themselves.", "_type": "dict", "Heading": "1 To 1,000,000,000", "Answer": "The numbers can be grouped by pairs:\n\r\n\n999,999,999 and 0;\n\r\n\n999,999,998 and 1'\n\r\n\n999,999,997 and 2;\n\r\n\nand so on....\n\r\n\nThere are half a billion pairs, and the sum of the digits in each pair is 81. The digits in the unpaired number, 1,000,000,000, add to 1. Then:\n\r\n\n(500,000,000 X 81) + 1= 40,500,000,001.", "id": 2003}, {"Category": "Difficult Riddles", "Riddle": "The king dies and two men, the true heir and an impostor, both claim to be his long-lost son. Both fit the description of the rightful heir: about the right age, height, coloring and general appearance. Finally, one of the elders proposes a test to identify the true heir. One man agrees to the test while the other flatly re-fuses. The one who agreed is immediately sent on his way, and the one who re-fused is correctly identified as the rightful heir. Can you figure out why?", "_type": "dict", "Heading": "Impostor!", "Answer": "The test was a blood test. The elder remembered that the true prince was a hemophiliac.", "id": 2004}, {"Category": "Difficult Riddles", "Riddle": "How many cats are in a small room if in each of the four corners a cat is sitting, and opposite each cat there sit three cats, and a each cat's tail another is sitting?", "_type": "dict", "Heading": "Don't Think Too Long", "Answer": "Four cats, each near a tail of a cat in an adjacent corner.", "id": 2005}, {"Category": "Difficult Riddles", "Riddle": "A soccer fan, upset by the defeat of his favorite team, slept restlessly. In his dream a goalkeeper was practicing in a large unfurnished room, tossing a soccer ball against the wall and then catching it.\n\r\n\nBut the goalkeeper grew smaller and smaller and then changed into a ping-pong ball while the soccer ball was swelled up into a huge cast-iron ball. The iron ball circled round madly, trying to crush the ping-pong ball, how did the ping-pong find safety whithout leaving the floor?", "_type": "dict", "Heading": "Soccer Fan's Nightmare", "Answer": "If the ping-pong ball rolls flush against the wall, the cast-iron ball cannot crush it.\n\r\n\nThose who know geometry can determine that if the diameter of a large ball is at least 5.83 (3+2(square root of 2) times as large as the diameter of a little ball, then the little ball will be safe if it hugs the wall.\n\r\n\nA cast-iron ball that is larger than a soccer ball is more than 4.83 times as large in diameter as a ping-pong ball.", "id": 2006}, {"Category": "Difficult Riddles", "Riddle": "Draw four rectangles on a piece of paper. Put nine x's in the four rectangles so that there is an uneven number of x's in each rectangle.", "_type": "dict", "Heading": "Rectangles", "Answer": "Draw one large rectangle. Then draw the three smaller rectangles within the large rectangle. Place three x's in each small rectangle. There will be nine x's in the large rectangle.", "id": 2007}, {"Category": "Difficult Riddles", "Riddle": "While playing with a metal washer shaped like a ring, Dave accidently pushed it on his finger too far and couldn't get it off. Trying to remove it using soap and water didn't work. The hospital sent him to a service station thinking they could cut the metal. Since the ring was made with a specially hardened steel, it couldn't be cut. Just then Bob arrived on the scene and suggested an easy way to remove the washer in just a few minutes. What was his solution?", "_type": "dict", "Heading": "Metal Washer Ring", "Answer": "Bob suggested that Dave hold his finger in the air while someone wound a piece of string tightly around his finger just above the metal ring. The string forced the swelling down. As they unwounded the string from the end nearest the ring, someone else slid the ring up. They continued winding and unwinding the string until the ring could be easily removed.", "id": 2008}, {"Category": "Difficult Riddles", "Riddle": "A camel travels a certain distance each day. Strangely enough, two of its legs travel 30 miles each day and the other two legs travel nearly 31 miles. It would seem that two of the camel's legs must be one mile ahead of the other two legs, but of course this can't be true.\n\r\n\nSince the camel is normal, how is this situation possible?", "_type": "dict", "Heading": "The Wierd Camel", "Answer": "The camel operates a mill and travels in a circular clockwise direction. The two outside legs will travel a greater distance than the two inside legs.", "id": 2095}, {"Category": "Difficult Riddles", "Riddle": "Can you divide the watch face with 2 straight lines so that the sums of the sums of the numbers in each part are equal?", "_type": "dict", "Heading": "A Watch Face", "Answer": "The sum of the numbers on the watch face is 78. If the two lines cross, there must be 4 equal parts, but 78 is not divisible by 4. Then the lines do not cross, giving three parts with the sum of 26 each. Once you see the pairs on the face that add to 13(12+1,11+2, and so far) the answer will be easy to find.", "id": 2096}, {"Category": "Difficult Riddles", "Riddle": "Some say we are red, some say we are green. Some play us, some spray us.\n\r\n\nWhat are we?", "_type": "dict", "Heading": "Red Or Green", "Answer": "Pepper.", "id": 2097}, {"Category": "Difficult Riddles", "Riddle": "I'm one of five, I'm not alive. The one who sent me forth became king, The one who received me died.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "One Of Five", "Answer": "A Stone from the popular Biblical story, David had five stones. He used one of the stones to kill Goliath.", "id": 2098}, {"Category": "Difficult Riddles", "Riddle": "0,1,2,3,4,5,6,7,8,9 \n\r\n\nUse the digits above once each only to compose two fractions which when added togeather equal 1.", "_type": "dict", "Heading": "Two Fractions", "Answer": "35/70 + 148/296 = 1", "id": 2099}, {"Category": "Difficult Riddles", "Riddle": "Oh, what a surprise! Oh, what a miracle! It sprouted without a seed, It stood without a trunk.", "_type": "dict", "Heading": "What A Surprise!", "Answer": "The world.", "id": 2100}, {"Category": "Difficult Riddles", "Riddle": "A boy presses a side of a blue pencil to a side of a yellow pencil, holding both pencils vertically. One inch of the pressed side of the blue pencil, measuring from its lower end, is smeared with paint. The yellow pencil is held steady while the boy slides the blue pencil down 1 inch, continueing to press it against the yellow one. He returns the blue pencil to its former position, then again it slides down 1 inch. He continues until he has lowered the blue pencil 5 times and raised it 5 times- 10 moves in all.\n\r\n\nSupposed that during this time the paint neither dries nor diminishes in quantity. How many inches of each pencil will be sneared with paint after the tenth move?", "_type": "dict", "Heading": "Down And Up", "Answer": "At the start, 1inch of the yellow pencil gets smeared with wet paint. As the blue pencil is moved downward, a second inch of the blue pencils smears a second inch of the yellow pencil.\n\r\n\nEach pair of down and up movesof the blue pencil smears 1 more inch of each pencil. 5 pairs of moves will smear 5 inches. This together with the initial inch, makes 6 inches for each pencil.", "id": 2101}, {"Category": "Difficult Riddles", "Riddle": "A mother has three sick children. She has a 24-ounce bottle of medicine and needs to give each child eight ounces of the medicine. She is unable to get to the store and has only three clean containers, which measure 5, 11 and 13 ounces. The electricity is out and she has no way of heating water to wash the containers and doesn't want to spread germs. How can she divide the medicine to give each child an equal portion without having any two children drink from the same container?", "_type": "dict", "Heading": "Bottle Of Medicine", "Answer": "Fill the 5 oz. and 11 oz. Containers from the 24 oz. container. This leaves 8 oz. in the 24 oz. bottle. Next empty the 11 oz. bottle by pouring the contents into the 13 oz. bottle. Fill the 13 oz. bottle from the 5 oz. container (with 2 oz.) and put the remaining 3 oz. in the 11 oz. bottle. This leaves the 5 oz. container empty. Now pour 5 oz. from the 13 oz. bottle into the 5 oz. bottle leaving 8 oz. in the 13 oz. bottle. Finally pour the 5 oz. bottle contents into the 11 oz. bottle giving 8 oz. in this container.", "id": 2102}, {"Category": "Difficult Riddles", "Riddle": "Rearrange all the letters in each of the sentences to form, in each case, a well known proverb.\n\r\n\n1. I don't admit women are faint.\n\r\n\n2. It rocks. The broad flag of the free.\n\r\n\n3. Strong lion's share almost gone.", "_type": "dict", "Heading": "Proverb Word Play", "Answer": "1. Time and tide wait for no man.\n\r\n\n2. Birds of a feather flock together.\n\r\n\n3. A rolling sone gathers no moss.", "id": 2103}, {"Category": "Difficult Riddles", "Riddle": "You have two container, a 5 gallon and a 3 gallon container. How do you measure out 4 gallons?", "_type": "dict", "Heading": "Gallons Of Water", "Answer": "Fill up the 3 gallon container and pour the 3 gallons into the 5 gallon container.\nThen, fill the 3 gallon container back up, and pour it into the 5 gallon container.\nThe 3 gallon container will have 1 gallon left. \nEmpty the 5 gallon container.\nPour the remining 1 gallon into the 5 gallon container.\nThen fill the 3 gallon container back up and pour it into the 5 gallon container.\nThus, you have 4 gallons.", "id": 2104}, {"Category": "Difficult Riddles", "Riddle": "You can use me to stop,\n\r\n\nYou take me to smoke;\n\r\n\nNot only do I stop, But I am a stop,\n\r\n\nAnd the result of pool's first stroke.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Take Me To Smoke", "Answer": "Brake/ Break", "id": 2168}, {"Category": "Difficult Riddles", "Riddle": "What's the most romantic part about the ocean?", "_type": "dict", "Heading": "Romantic", "Answer": "When the buoy meets gull.", "id": 2169}, {"Category": "Difficult Riddles", "Riddle": "My first is often at the front door. My second is found in the cereal family. My third is what most people want. My whole is one of the United States.", "_type": "dict", "Heading": "A United State Brain Teaser", "Answer": "Matrimoney. (mat + rye + money). Matrimony is certainly a \"united state\"!", "id": 2170}, {"Category": "Difficult Riddles", "Riddle": "Hickory-Dickory-Dock! The mouse ran up the clock. The clock struck one and down did come. Hickory-Dickory-Dock!\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Hickory Dickory Dock!", "Answer": "A guillotine.", "id": 2171}, {"Category": "Difficult Riddles", "Riddle": "If it is 1,800 kilometers to America, 1,200 kilometers to Japan, 2,400 kilometers to New Zealand, and 1,400 kilometers to Brazil- \n\r\n\nHow far is Morocco?", "_type": "dict", "Heading": "Lets Travel ", "Answer": "The answer is 1,700 kilometers, as vowels in the countries' names are worth 300 kilometers and the consonats are worth 200 kilometers.", "id": 2172}, {"Category": "Difficult Riddles", "Riddle": "You are given a set of scales and 12 marbles. The scales are of the old balance variety. That is, a small dish hangs from each end of a rod that is balanced in the middle. The device enables you to conclude either that the contents of the dishes weight the same or that the dish that falls lower has heavier contents than the other. The 12 marbles appear to be identical. In fact, 11 of them are identical, and one is of a different weight. Your task is to identify the unusual marble and discard it. You are allowed to use the scales three times if you wish, but no more. Note that the unusual marble may be heavier or lighter than the others. You are asked to both identify it and determine whether it is heavy or light", "_type": "dict", "Heading": "Marbles", "Answer": "Most people seem to think that the thing to do is weight six coins against six coins, but if you think about it, this would yield you no information concerning the whereabouts of the only different coin. As we already know that one side will be heavier than the other. So that the following plan can be followed, let us number the coins from 1 to 12. For the first weighing let us put on the left pan coins 1,2,3,4 and on the right pan coins 5,6,7,8. There are two possibilities. Either they balance, or they don't. If they balance, then the different coin is in the group 9,10,11,12. So for our second weighing we would put 1,2 in the left pan and 9,10 on the right. If these balance then the different coin is either 11 or 12. Weigh coin 1 against 11. If they balance, the different coin is number 12. If they do not balance, then 11 is the different coin. If 1,2 vs 9,10 do not balance, then the different coin is either 9 or 10. Again, weigh 1 against 9. If they balance, the different coin is number 10, otherwise it is number 9. That was the easy part. What if the first weighing 1,2,3,4 vs 5,6,7,8 does not balance? Then any one of these coins could be the different coin. Now, in order to proceed, we must keep track of which side is heavy for each of the following weighings. Suppose that 5,6,7,8 is the heavy side. We now weigh 1,5,6 against 2,7,8. If they balance, then the different coin is either 3 or 4. Weigh 4 against 9, a known good coin. If they balance then the different coin is 3, otherwise it is 4. Now, if 1,5,6 vs 2,7,8 does not balance, and 2,7,8 is the heavy side, then either 7 or 8 is a different, heavy coin, or 1 is a different, light coin. For the third weighing, weigh 7 against 8. Whichever side is heavy is the different coin. If they balance, then 1 is the different coin. Should the weighing of 1,5, 6 vs 2,7,8 show 1,5,6 to be the heavy side, then either 5 or 6 is a different heavy coin or 2 is a light different coin. Weigh 5 against 6. The heavier one is the different coin. If they balance, then 2 is a different light coin.", "id": 2173}, {"Category": "Difficult Riddles", "Riddle": "There are 100 light bulbs lined up in a row in a long room. Each bulb has its own switch and is currently switched off. The room has an entry door and an exit door. There are 100 people lined up outside the entry door. Each bulb is numbered consecutively from 1 to 100. So is each person. Person No. 1 enters the room, switches on every bulb, and exits. Person No. 2 enters and flips the switch on every second bulb (turning off bulbs 2, 4, 6, ...). Person No. 3 enters and flips the switch on every third bulb (changing the state on bulbs 3, 6, 9, ...). This continues until all 100 people have passed through the room. What is the final state of bulb No. 64? And how many of the light bulbs are illuminated after the 100th person has passed through the room?", "_type": "dict", "Heading": "The Lightbulb", "Answer": "First think who will operate each bulb, obviously person #2 will do all the even numbers, and say person #10 will operate all the bulbs that end in a zero. So who would operate for example bulb 48: Persons numbered: 1 & 48, 2 & 24, 3 & 16, 4 & 12, 6 & 8 ........ That is all the factors (numbers by which 48 is divisible) will be in pairs. This means that for every person who switches a bulb on there will be someone to switch it off. This willl result in the bulb being back at it's original state. So why aren't all the bulbs off? Think of bulb 36:- The factors are: 1 & 36, 2 & 13, 6 & 6 Well in this case whilst all the factors are in pairs the number 6 is paired with it's self. Clearly the sixth person will only flick the bulb once and so the pairs don't cancel. This is true of all the square numbers. There are 10 square numbers between 1 and 100 (1, 4, 9, 16, 25, 36, 49, 64, 81 & 100) hence 10 bulbs remain on.", "id": 2174}, {"Category": "Difficult Riddles", "Riddle": "A great banquet was prepared for a Roman emperor and his courtiers. 22 Dormice, 40 Larks' Tongues, 30 Flamingos and 40 Roast Parrots were served.\n\r\n\nHow many portions of Boiled Ostrich were served?", "_type": "dict", "Heading": "The Banquet", "Answer": "42. Each vowel is worth 2 and each consonant 4, so Dormice gives 22, ect.", "id": 2175}, {"Category": "Difficult Riddles", "Riddle": "Marco and Bob have been the best friends ever since they were little kids. They are also very competitive. Throughout the years they have challenged each other to do both physical and mental challenges. And they completed the challenge. But one day Marco thought of something to challenge Bob to do - something he could start but never finish. The average man could do it and so could Mark and they were both the same sex and the same size. It is a physical challenge. Can you figure out what it was?", "_type": "dict", "Heading": "Marco And Bob", "Answer": "Marco challenged Bob to get a tan, but he couldn't...Bob is an albino.", "id": 2176}, {"Category": "Difficult Riddles", "Riddle": "The word F\nA\nC\nE\nT\nIOU\nSL\nY\n contains the six vowels, A-E-I-O-U and Y, \n in their alphabetical order. \n Can you find another English word that does the same?", "_type": "dict", "Heading": "FACETIOUSLY Has The Six Vowels", "Answer": "The word is abstemiously. There may be others.", "id": 2177}, {"Category": "Difficult Riddles", "Riddle": "A wealthy wise old woman feared that her daughter was lazy and as a result rather stupid. When the old woman died, her will stipulated that her assets were to be liquidated and a check was to be written for the full amount. The check was to be placed in one of three envelopes. The other two envelopes would contain a blank piece of paper. If the daughter could determine from the writing on the envelope which envelope contained the check, she would inherit her mother's fortune. Otherwise, the fortune would go to the old woman's favorite charity for animals. The daughter was not allowed to touch the envelopes. Her decision had to be made based on the writing on the envelopes. The daughter was told that only one envelope had a true statement and that the other two statements were false. The envelopes had the following writing: 1. This envelope does not have the check 2. This envelope has the check 3. The second envelope does not have the check Which envelope should the daughter pick?", "_type": "dict", "Heading": "Lazy Daughter", "Answer": "The daughter should pick envelope 1. Unfortunately she picked envelope 3. Statements 1 and 2 were false, and the only true statement was statement 3. If the check was in envelope 1, that would make statement 1 false, statement 2 false and statement 3 is the only true statement. If the check was in envelope 2, statements 1 and 2 would both be true. If the check was in envelope 3, statements 1 and 3 would both be true.", "id": 2248}, {"Category": "Difficult Riddles", "Riddle": "I like indigo but not blue, I like onions but not turnips, I like forms but not shapes. According to the same rule, do I like tomatoes or avocados?", "_type": "dict", "Heading": "Tomatoes Or Avocadoes", "Answer": "Avocadoes - I like all things that start with a preposition.", "id": 2249}, {"Category": "Difficult Riddles", "Riddle": "It's always 1 to 6, \n it's always 15 to 20, \n it's always 5, \n but it's never 21, \n unless it's flying.\n\r\n\nWhat is it?", "_type": "dict", "Heading": "Always & Never", "Answer": "The answer is: a dice. An explanation: \"It's always 1 to 6\": the numbers on the faces of the dice, \"it's always 15 to 20\": the sum of the exposed faces when the dice comes to rest after being thrown, \"it's always 5\": the number of exposed faces when the dice is at rest, \"but it's never 21\": the sum of the exposed faces is never 21 when the dice is at rest, \"unless it's flying\": the sum of all exposed faces when the dice is flying is 21 (1 + 2 + 3 + 4 + 5 + 6).", "id": 2250}, {"Category": "Difficult Riddles", "Riddle": "A boy leaves home in the morning to go to school. At the moment he leaves the house he looks at the clock in the mirror. The clock has no number indication and for this reason the boy makes a mistake in interpreting the time (mirror-image). Just assuming the clock must be out of order, the boy cycles to school, where he arrives after twenty minutes. At that moment the clock at school shows a time that is two and a half hours later than the time that the boy saw on the clock at home.", "_type": "dict", "Heading": "Mirroring Clock", "Answer": "The difference between the real time and the time of the mirror image is two hours and ten minutes (two and a half hours, minus the twenty minutes of cycling). Therefore, the original time on the clock at home that morning could only have been five minutes past seven: The difference between these clocks is exactly 2 hours and ten minutes (note that also five minutes past one can be mirrored in a similar way, but this is not in the morning!). Conclusion: The boy reaches school at five minutes past seven plus twenty minutes of cycling, which is twenty-five minutes past seven!...", "id": 2251}, {"Category": "Difficult Riddles", "Riddle": "Two cars were involved in an accident in the center of town. The man who was driving a little green car, had overtaken a big black car. The driver had misjudged the distance between him and the on-coming traffic and had to swerve back in, causing the black car to swerve and crash into a shop window. When the occupants of the cars were examined everyone in the green car was okay, but in the black car was one dead man. However, the driver of the green car was not charged with manslaughter, why was this so?", "_type": "dict", "Heading": "Getting Away With Manslaughter", "Answer": "The black car was a hearse and was on its way to a funeral.", "id": 2252}, {"Category": "Difficult Riddles", "Riddle": "How can this be true? Have a look at the picture. All the lines are straight, the shapes that make up the top picture are the same as the ones in the bottom picture so where does the gap come from?", "_type": "dict", "Heading": "Triange Problem", "Answer": "The green triangle has dimensions 2 x 5 and gradient 2 / 5 = 0.4 \n The red triangle has dimensions 3 x 8 and gradient 3 / 8 = 0.375 \n Hence the gradient of the green triangle is greater than that of the red triangle.", "id": 2253}, {"Category": "Difficult Riddles", "Riddle": "An item is made from lead blanks in a lathe shop. Each blank suffices for 1 item. Lead shavings accumulated for making 6 items can be melted and made into a blank. How many items can be made from 36 blanks?", "_type": "dict", "Heading": "How Many Items?", "Answer": "From 36 blanks there are 36 items made. The lead shavings are enough to make 6 blanks. Which make 6 more items. But don't stop here. The new shavings are good for 1 more item. Total: 43.", "id": 2254}, {"Category": "Difficult Riddles", "Riddle": "I run, it runs, I stop, it runs\n\r\n\nWhat it it?", "_type": "dict", "Heading": "Running", "Answer": "My watch.", "id": 2255}, {"Category": "Difficult Riddles", "Riddle": "Ben walked into a hardware store and asked the price of some items. The salesman said: One costs $1, Eight costs $1, Seventeen cost $2, One hundred four costs $3 and One thousand seventy two costs $4. What was Ben buying?", "_type": "dict", "Heading": "What Is Ben Buying", "Answer": "Ben was buying home address numbers and they cost $1 per digit.", "id": 2256}, {"Category": "Difficult Riddles", "Riddle": "A car's odometer shows 72927 miles, a palindromic number. What are the minimum miles you would need to travel to form another?", "_type": "dict", "Heading": "A Palindromic Number Brain Teaser", "Answer": "110 miles. (73037)", "id": 2257}, {"Category": "Difficult Riddles", "Riddle": "Carl is trying to find solutions to a geometric puzzle.  He has a square plot of land that he needs to reserve 1/4 for himself and divide the remaining 3/4 equally and in similar shape, among his 4 children.  There are two possible solutions.  Can you solve the puzzle?", "_type": "dict", "Heading": "Geometric Puzzle #1", "Answer": "Solution #1 - Squares\n\r\n\nFirst, Carl divides his as to reserve to himself one-fourth in the form of a square.\n\r\n\n\r\n\nThen, Carl takes the remaining 3/4 shape and scales it down by 1/4.  He then, multiplies the shape into 4 identically shaped pieces, and aranges them so that they fit into the original 3/4 shape.\n\r\n\n\r\n\nSolution #2 - Rectangles\n\r\n\nFirst, create a triangle that is 1/4 the size of the square.\n\r\n\n\r\n\nNow, with straight lines, create two squares.\n\r\n\nProceed to disect the two squares with horizontal lines creating 4 triangles.\n\r\n\nThen, disect one of the resultuing triangles from each square.  The shape of land for each of his four children is divided evenly and is the same shape.\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1.jpg\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1-Answer.jpg\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1-Answer-2.jpg\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1-Solution-2.jpg", "id": 2327}, {"Category": "Difficult Riddles", "Riddle": "Two travellers spend from 12 o'clock to 6 o'clock walking along a level road, up a hill and back again. Their pace is 4 mph on the level, 3 mph uphill, and 6 mph downhill.\n\r\n\nHow far do they walk and at what time do they reach the top of the hill?", "_type": "dict", "Heading": "Travellers Riddle", "Answer": "24 miles half past three.", "id": 2328}, {"Category": "Difficult Riddles", "Riddle": "Jack has 8 bricks 7 of them weights the same amount and one is slightly heavier. Using a balance scale, how can Jack find the heavier brick in two weighings?", "_type": "dict", "Heading": "Odd Brick Out", "Answer": "First he split them in to piles of 3, 3, and 2 bricks. Then he weighs both groups of 3 with each other. If they balance he knows the brick is one of the 2 unweighed bricks and he can weigh them to find the heaver one. If the the stacks of 3 bricks do not balance, he will weigh 2 of the 3 bricks. If they balance he will know the brick left unweighed is heavier, or if they do not balance, he will find the heavier one.", "id": 2329}, {"Category": "Difficult Riddles", "Riddle": "Robert and David were preparing to have a water balloon fight. \"No Fair\" cried Robert, \"You have 3 times as many as I do!\" David said \"Fine!\" and gave Robert 10 more balloons. \"Still not fair!\" argued Robert, \"You still have twice as many as I do.\" How many more balloons must David give Robert for them to have the same number?", "_type": "dict", "Heading": "Water Balloons", "Answer": "David must give Robert another 20 water balloons, giving them each 60. Robert started with 30 water balloons and David with 90.", "id": 2330}, {"Category": "Difficult Riddles", "Riddle": "There is a man\n stood on top of a mountain\n frozen holding a peice of straw.\n How did he get there?", "_type": "dict", "Heading": "The Dead Man", "Answer": "He was with his friend in a hotair balloon when they were about to hit a mountin so they took of there clothes to make it lighter so they would go higher but it wasnt working so they drew straws and who ever had the shortest straw would have to jump out so he was the one who picked the shortest straw.", "id": 2331}, {"Category": "Difficult Riddles", "Riddle": "My first is high, My second damp, My whole a tie, A writer's cramp. What am I?", "_type": "dict", "Heading": "Writer's Cramp Riddle", "Answer": "Hyphen. The first two lines yield high-fen. A hyphen is used by a writer to tie (or cramp) two words together.", "id": 2332}, {"Category": "Difficult Riddles", "Riddle": "Three working women have different careers. If only one of statements 1, 2 and 3 are true, can you tell whether or not Mary is a nurse? 1. This statement is only true if statement 5 is false. 2. This statement is true if statements 4 or 5, or both 4 and 5 are true. 3. This statement is false only if both statements 6 and 1 are true. 4. Mary is a nurse 5. Karen is an artist. 6. Sarah is a photographer.", "_type": "dict", "Heading": "Careers", "Answer": "Mary is not a nurse. The way to solve this riddle, is to consider statements 4, 5, and 6 and create a chart of all possible true and false answers. Next, fill in the chart according to statements 1 through 3. You will discover that there is only one line where only one of statements one, two and three are true. Thus, it is determined that: Statement 4 and 5 are false and statement 6 is true.", "id": 2333}, {"Category": "Difficult Riddles", "Riddle": "Five baby boomer couples each have one child. Each child is a different age than any of the other children. Each child has a favorite toy which is different from any of the other children's favorite toys. Each family eats at only one fast food restaurant. No two women have the same name and no two men have the same name. The children's names are not known. The child who plays with trains is the youngest. Bill's child plays with a GI Joe. Julie's child likes Pokeman. Mike's family eats at Taco Bell. The family of the 4 year old likes Kentucky Fried Chicken. The oldest child is four years older than Marie's child. The child who plays with Barbie is 8 years old. The child with the age is in the middle, has a mother named Marie. The child in the family that eats at McDonalds has a two year age difference with Larry's child. Carol is the mother in the family that eats at Dairy Queen. The child that plays Nintendo likes Burger King. Steve's child is two years apart in age from the child of the family that eats at Kentucky Fried Chicken. The child that plays with trains is two years apart from the 6 year old. The child that eats at McDonalds is two years older or younger than Regina's child. Lisa's child is 10. Who is married to George?", "_type": "dict", "Heading": "Baby Boomers", "Answer": "Lisa is married to George, and their 10 year old plays with Nintendo. They like to eat at Burger King. The associations are: Child age 4, mother Regina, Father Larry, trains, KFC Child age 6, mother Julie, Father Steve, Pokeman, McDonalds Child age 8, mother Marie, Father Mike, Barbie, Taco Bell Child age 10, mother Lisa, Father George, Nintendo, Burger King Child age 12, mother Carol, Father Bill, GI Joe, Dairy Queen To solve, draw a grid with five rows and five columns. Across the top, above the columns, write Age, Mother, Father, Toy and Food. Figure out the known ages and write them in order in the first column. One child's age is unknown at first. However, once the youngest child is discovered (the one who plays with trains) it is then known that the oldest child is the child with the unknown age. Through additional clues, it is possible to determine that the oldest child is age 12. Take the clue, Lisa?s child is 10. In the mother column corresponding to the age 10, you would write LISA (Maybe circle it, because it is the correct answer.) In the mother column for every other age, write \"not Lisa\". Do this for each clue. If you know the answer because of a clue, write it in the appropriate column, and then be sure to write \"not such and such\" in all the other rows for that clue. For example, \"The youngest child plays with trains\", would result in \"not trains\" for any child you can tell isn?t the youngest, but you can?t write \"trains\" for any child, because you don?t know which child is the youngest at first. Eventually, you may find that \"mother not Marie\" is on every line except one, and then you would know that Marie is the mother on the empty line.", "id": 2334}, {"Category": "Difficult Riddles", "Riddle": "A man told his son that he would give him $1000 if he could accomplish the following task. The father gave his son ten envelopes and a thousand dollars, all in one dollar bills. He told his son, \"Place the money in the envelopes in such a manner that no matter what number of dollars I ask for, you can give me one or more of the envelopes, containing the exact amount I asked for without having to open any of the envelopes. If you can do this, you will keep the $1000.\" When the father asked for a sum of money, the son was able to give him envelopes containing the exact amount of money asked for. How did the son distribute the money among the ten envelopes?", "_type": "dict", "Heading": "1000 Bucks", "Answer": "The contents or the ten envelopes (in dollar bills) should be as follows: $1, 2, 4, 8, 16, 32, 64, 128, 256, 489. The first nine numbers are in geometrical progression, and their sum, deducted from 1,000, gives the contents of the tenth envelope.", "id": 2335}]