[{"Category": "Logic Puzzles", "Riddle": "You walk up to a mountain that has two paths. One leads to the other side of the mountain, and the other will get you lost forever. Two twins know the path that leads to the other side. You can ask them only one question. Except! One lies and one tells the truth, and you don't know which is which. So, What do you ask?", "_type": "dict", "Heading": "Which Path?", "Answer": "You ask each twin What would your brother say?. This works because.... Well let's say the correct path is on the left side. So say you asked the liar \"What would your brother say?\" Well, the liar would know his brother was honest and he would say the left side, but since the liar lies, he would say right. If you asked the honest twin the same question, he would say right, because he knows his brother will lie. Therefore, you would know that the correct path was the left!", "id": 97}, {"Category": "Logic Puzzles", "Riddle": "A logician with some time to kill in a small town decided to get a haircut. The town had only two barbers, each with his own shop. The logician glanced into one shop and saw that it was extremely untidy. The barber needed a shave, his clothes were unkempt, his hair was badly cut. The other shop was extremely neat. The barber was freshly shaved and spotlessly dressed, his hair neatly trimmed. Why did the logician return to the first shop for his haircut?", "_type": "dict", "Heading": "The Logician", "Answer": "Each barber must have cut the other's hair. The logician picked the barber who had given his rival the better haircut.", "id": 98}, {"Category": "Logic Puzzles", "Riddle": "George, Helen, and Steve are drinking coffee. Bert, Karen, and Dave are drinking soda. Using logic, is Elizabeth drinking coffee or soda?", "_type": "dict", "Heading": "Coffee Or Soda", "Answer": "Elizabeth is drinking coffee. The letter E appears twice in her name, as it does in the names of the others that are drinking coffee.", "id": 99}, {"Category": "Logic Puzzles", "Riddle": "A man went on a trip with a fox, a goose and a sack of corn. He came upon a stream which he had to cross and found a tiny boat to use to cross the stream. He could only take himself and one other - the fox, the goose, or the corn - one at a time. He could not leave the fox alone with the goose or the goose alone with the corn. How does he get all safely over the stream?", "_type": "dict", "Heading": "A Fox, A Goose And A Sack Of Corn", "Answer": "Take the goose over first and come back. Then take the fox over and bring the goose back. Now take the corn over and come back alone to get the goose. Take the goose over and the job is done!", "id": 100}, {"Category": "Logic Puzzles", "Riddle": "One of the four words does not belong with the other three. Which word does not belong? What is it that the others have in common?  \n\r\n\n1. Green, yellow, red, blue.  \n2. April, December, November, June.  \n3. Cirrus, calculus, cumulus, stratus.  \n4. Carrots, radishes, potatoes, cabbages.  \n5. Fork, comb, rake, shovel.", "_type": "dict", "Heading": "Which One Does Not Belong?", "Answer": "1. Green. Yellow, red and blue are primary colors, green is not.\n\r\n\n2. December. The other months have only 30 days.\n\r\n\n3. Calculus. The others are cloud types.\n\r\n\n4. Cabbage. The others are vegetables that grow underground.\n\r\n\n5. Shovel. The others have prongs.", "id": 101}, {"Category": "Logic Puzzles", "Riddle": "You buy me taken apart, \n\r\n\nTo redo what has been undone; \n\r\n\nFour of my pieces have one sharp corner, \n\r\n\nThe rest of them have none. \n\r\n\nWhat am I?", "_type": "dict", "Heading": "Redo What Has Been Undone", "Answer": "A jigsaw puzzle.", "id": 102}, {"Category": "Logic Puzzles", "Riddle": "If a wheel has 64 spokes, how many spaces are there between the spokes?", "_type": "dict", "Heading": "Inbetween The Spokes", "Answer": "64. The space that comes after the 64th spoke, would be just before the first spoke.", "id": 103}, {"Category": "Logic Puzzles", "Riddle": "What's the least number of chairs you would need around a table to sit four fathers, two grandfathers, and four sons?", "_type": "dict", "Heading": "Number Of Chairs", "Answer": "Four. The four fathers could be grandfathers and are definitely sons already.", "id": 104}, {"Category": "Logic Puzzles", "Riddle": "bcdfgh__?", "_type": "dict", "Heading": "What Is The Next Letter In The Sequence?", "Answer": "J (this is a sequential list of consonants).", "id": 105}, {"Category": "Logic Puzzles", "Riddle": "Take eight small sticks, four of which are half the length of the other four. Make three equal squares out of the sticks.", "_type": "dict", "Heading": "Three Squares", "Answer": "Use the longer four sticks to be sharing sides between the squares and at the end their should be three intertwined squares.\nhttps://www.riddles.com/../../../uploads/images/8-sticks-3-squares.png", "id": 106}, {"Category": "Logic Puzzles", "Riddle": "How high would you have to count before you would use the letter A in the English language spelling of a whole number.", "_type": "dict", "Heading": "The Letter A Count", "Answer": "One thousand.", "id": 357}, {"Category": "Logic Puzzles", "Riddle": "Craig died in Florida. Shortly after, Tracy died at sea. Nobody mourned, In fact, everyone was absolutey delighted.\n\r\n\nWhy?", "_type": "dict", "Heading": "Round And Round", "Answer": "They were both hurricanes.", "id": 358}, {"Category": "Logic Puzzles", "Riddle": "How is it possible to always find what your looking for in the last place you look?", "_type": "dict", "Heading": "The Last Place You Looked", "Answer": "If you find what your are looking for then you would stop looking so it would be in the last place you look.", "id": 359}, {"Category": "Logic Puzzles", "Riddle": "If you were to put a coin into an empty bottle and then insert a cork into the neck, how could you remove the coin without taking out the cork or breaking the bottle?", "_type": "dict", "Heading": "Bottle, Cork, And Coin", "Answer": "Push the cork into the bottle and shake the coin out!", "id": 360}, {"Category": "Logic Puzzles", "Riddle": "Four members of a band are walking to a night concert. They decide to take a shortcut, but must cross a bridge. Luckily they have one flashlight. Because of the varying size of their instruments, it takes each member a different amount of time to cross the bridge - it takes the first person one minute, the second person two minutes, the third person five minutes and the fourth person ten minutes. They must cross the bridge in pairs, travelling at the slower speed so if the one minute person went with the ten minute person, it would take a total of ten minutes. Since there is only one flashlight, one person must come back across the bridge, then another pair can cross. They only have 17 minutes to cross the bridge and still get to the concert on time. What order should they cross to get everyone across and get to the concert?", "_type": "dict", "Heading": "Four Members Of A Band ...", "Answer": "First, the one minute person and the two minute person must cross the bridge, for a total of two minutes. Then the one minute person should come back with flashlight - total of three minutes. The five minute person and the ten minute person cross together next, making the total thirteen minutes. Now the two minute person goes back and (total now fifteen minutes) and gets the one minute person and they cross together bringing the total to seventeen minutes.", "id": 361}, {"Category": "Logic Puzzles", "Riddle": "They are scenes of madness, grief, gaiety, seeming purpose, confusion and queerness often appearing in the dark hours of night. They stretch through time, seeming only but a few moments, yet when reality is not as kind. When appearing they are logical, but when reminiscing they are strange and odd. What is it?", "_type": "dict", "Heading": "Nightly Visits", "Answer": "Dreams.", "id": 362}, {"Category": "Logic Puzzles", "Riddle": "I go up and down the stairs without moving.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "Up And Down The Stairs", "Answer": "I am a carpet", "id": 363}, {"Category": "Logic Puzzles", "Riddle": "A man has Ten Horses and nine stables as shown here. [] [] [] [] [] [] [] [] [] The man wants to fit Ten Horses into nine stables. How can he fit Ten horses into nine stables?", "_type": "dict", "Heading": "Ten Horses In Nine Stables", "Answer": "One letter for each stable. [T][E][N] [H][O][R][S][E][S]", "id": 364}, {"Category": "Logic Puzzles", "Riddle": "If the date of the last Saturday of last month and the first Sunday of this month do not add up to 33, what month are you in?", "_type": "dict", "Heading": "Last Saturday Of The Month Riddle", "Answer": "The same month you are reading this.", "id": 365}, {"Category": "Logic Puzzles", "Riddle": "Two hours ago it was as long after one o'clock in the afternoon as it was before one o'clock in the morning. What time is it now?", "_type": "dict", "Heading": "What Time Is It?", "Answer": "It would be 9:00 pm. There are 12 hours between 1:00 pm and 1:00 am and half of that is six hours. Half-way between would be 7 o'clock. Two hours later it would be 9:00 o'clock.", "id": 366}, {"Category": "Logic Puzzles", "Riddle": "An old fashioned bike wheel has 21 spokes. How many spaces are between the spokes - 20, 21, or 22?", "_type": "dict", "Heading": "Bike Spokes", "Answer": "21", "id": 608}, {"Category": "Logic Puzzles", "Riddle": "Morgan was making apricot jam. She put all the apricots in the pot and stirred them up. Then she remembered she had to add 1 ounce of lemon juice for every two apricots! How did she figure out how much lemon juice to put?", "_type": "dict", "Heading": "Missed A Step ", "Answer": "She counted the pits!", "id": 609}, {"Category": "Logic Puzzles", "Riddle": "A man grabbed a woman's ring and pulled on it, then dropped it. How did this save her life?", "_type": "dict", "Heading": "Saving Lives", "Answer": "They were skydiving, and she was unconscious. He pulled the ripcord ring for her, and the parachute opened.", "id": 610}, {"Category": "Logic Puzzles", "Riddle": "I have three envelopes, into one of them I put a $20 note. I lay the envelopes out on a table in front of me and allow you to pick one envelope. You hold but do not open this envelope. I then take one of the envelopes from the table, demonstrate to you that it was empty, screw it up and throw it away. The question is would you rather stick with the envelope you have selected or exchange it for the one on the table. Why? What would be the expected value to you of the exchange?", "_type": "dict", "Heading": "The Envelopes", "Answer": "The answer might seem a little counter intuitive at first but we'll see... \n The short answer is that it is in your advantage to exchange. But why? \n Well initially there was a 1/3 chance that you were holding the envelope with the note in it and a 2/3 chance that the note was on the table. \n This is still the case after one of the envelopes on the table has been removed, there is still a 1/3 chance that you have the note and a 2/3 chance of it being on the table. \n If this is confusing then it may help to think that the questioner knows which envelope the $20 note is in, though in practice it doesn't actually matter. The questioner would always be able to demonstrate that the note was not in one of the envelopes on the table regardless of where the note was, so the fact that he was able to do this changes nothing. \n Consider a different example.... \n Say there are a 1000 envelopes on the table, 1 with a note inside. You pick 1 envelope, the chance that this has the note in it is clearly 1/1000, where as the chance that it is still on the table is 999/1000. Odds are its on the table. Now the questioner could, assuming he can remember where the note is demonstrate to you that the note is not in 998 of the envelopes on the table. In this case nothing would have happened to change the fact that there is only a 1/1000 chance of you having the note. \n That is why you exchange. \n What is the value of the exchange? \n Simply before the exchange you have 1/3 of $20 and afterwards you will have 2/3 of $20, ie the advantage to you is about $6.66", "id": 611}, {"Category": "Logic Puzzles", "Riddle": "Three cars had driven into a parking lot at the same time, and the three drivers left them all for the attendant to park. Unfortunately, he isn't too good at remembering exactly which driver drove which car. However, he is sure of these 6 facts: a. Colin drove the BMW if and only if Mr. Cooper drove the Avenger. b. Alan drove the Cortina if and only if Mr. Cooper drove the BMW. c. Colin is Mr. Brown if and only if Mr. Andrews drove the BMW. d. Brian is Mr. Andrews if and only if Colin drove the BMW. e. Mr. Cooper drove the Avenger if and only if Alan is Mr. Brown. f. Colin is Mr. Brown if and only if Alan drove the Cortina. Who arrived with which car?", "_type": "dict", "Heading": "Car Mixup", "Answer": "Brian Brown drove the BMW, Alan Andrew drove the Avenger, and Colin Cooper drove the Cortina.", "id": 612}, {"Category": "Logic Puzzles", "Riddle": "I have 10 red socks and 10 blue socks in a drawer. How many socks must I take out to ensure that I have at least one matching pair? One how many to ensure I have at least a pair of red and a pair of blue?", "_type": "dict", "Heading": "Blue And Red Socks", "Answer": "Three for one pair, and twelve to ensure one pair of each color.", "id": 613}, {"Category": "Logic Puzzles", "Riddle": "Two women and two doctors walk into an ice cream parlor. They each order an ice cream cone. When their ice creams come, there is only 1 strawberry,1 chocolate and 1 vanilla.\n\r\n\nHow come they didn't complain?", "_type": "dict", "Heading": "Ice Cream Parlor", "Answer": "One of the women was a doctor!", "id": 614}, {"Category": "Logic Puzzles", "Riddle": "A hiker comes to a fork in the road and doesn't know which way to go to reach his destination. There are two men at the fork, one of whom always tells the truth while the other always lies. The hiker doesn't know which is which, though. He may ask one of the men only one question to find his way. Which man does he ask, and what is the question?", "_type": "dict", "Heading": "Fork In The Road Riddle", "Answer": "Either man should be asked the following question: \"If I were to ask you if this is the way I should go, would you say yes?\" While asking the question, the hiker should be pointing at either of the directions going from the fork.", "id": 615}, {"Category": "Logic Puzzles", "Riddle": "A man buys a rope from a woman for $3.00 and hands the woman a $10 bill. The woman goes into the grocery store next door to get change. She returns and gives the man $7.00. After the man leaves, the clerk from the store comes and says, \"Hey, that was a counterfeit bill you gave me.\" The woman gives the clerk a good bill.\n\r\n\nHow much has the woman lost?", "_type": "dict", "Heading": "Counterfeit Bill", "Answer": "Seven dollars plus the rope.", "id": 616}, {"Category": "Logic Puzzles", "Riddle": "In a contest, there are four fruits (an apple, a banana, an orange, and a pear) which have been placed in four closed boxes (one fruit per box). People may guess which fruit is in which box. There were 123 participants in the contest. The results are; 43 people guessed none correctly, 39 people guessed one correctly and 31 people have guessed two correctly. How many people guessed three correctly and how many people guessed all four correctly?", "_type": "dict", "Heading": "Four Fruits", "Answer": "It is not possible to only get three correct because the fourth would also be correct.  Therefore, the answer would be (123-43-39-31 = 10) 10 people  guessed all four correctly.", "id": 617}, {"Category": "Logic Puzzles", "Riddle": "If place 1 cake of soap on a pan of a scale and 3/4 cake of soap and a 3/4-pound weight on the other, the pans balance.\n\r\n\nHow much does a cake of soap weigh?", "_type": "dict", "Heading": "A Cake Of Soap", "Answer": "Since 1/4 cake weighs 3/4 pound, and entire cake weighs 3 pounds.", "id": 836}, {"Category": "Logic Puzzles", "Riddle": "What animal has no wings, but yet will fly?", "_type": "dict", "Heading": "No Wings, Can Fly", "Answer": "A caterpillar has no wings, but will fly when it matures and becomes a butterfly.", "id": 837}, {"Category": "Logic Puzzles", "Riddle": "If a man is trapped in a room. There are no doors no windows how did he get out?", "_type": "dict", "Heading": "Trapped!!", "Answer": "Through the door way, there are no doors but a door way!", "id": 838}, {"Category": "Logic Puzzles", "Riddle": "An old parchment describes the location of buried treasure: \"On the island there are only two trees, A and B, and the remains of a gallows. Start at the gallows and count the steps required to walk in a straight line to tree A. At the tree turn 90 degrees to the left and then walk forward the same number of steps. At the point where you top drive a spike into the ground. Now return to the gallows and walk in a straight line, counting your steps, to tree B. When you reach the tree, turn 90 degrees to the right and take the same number of steps forward, placing another spike at the point where you stop. Dig at the point exactly halfway between the spikes and you will find the treasure.\" However, our hero when he gets to the island finds the gallows missing. Is there any way he can still get to the treasure?", "_type": "dict", "Heading": "Buried Treasure", "Answer": "A simple experiment with a ruler and paper shows that any position for the gallows leads to the same point.", "id": 839}, {"Category": "Logic Puzzles", "Riddle": "A man walked in to a bar and asked for a glass of water the bar man took out a gun and poined it at him the man who asked for the glass of water just smiled and walked away happy Why?", "_type": "dict", "Heading": "A Man Walked In To A Bar", "Answer": "He had the hicupps", "id": 840}, {"Category": "Logic Puzzles", "Riddle": "You and your friend are trapped in a space prison on an alien planet. The alien warden decides to give you and your friend a chance at freedom. He states that your friend shall be allowed to temporarily leave your cell and try to escape through an electric gate guarded by a 3-number passcode. If your friend answers incorrectly or says anything but the final answer, your friend will be thrown back in the prison. A computer will then tell your friend 4 clues if requested. If this passcode is properly answered, you and your friend shall be freed. You are then blindfolded and your friend leaves. You hear your friend walk down one of the numbered hallways to the gate. Your friend asks for the first clue. A voice answers, \"The numbers are in ascending order so that the number is greater than or equal to the number before it.\" Your friend asks for the second clue. The voice says, \"The product of the 3 numbers is 36.\" Your friend asks for the third clue. The voice says, \"The sum of the numbers is the number of the hallway you entered.\" Your friend pauses for a moment and thinks. Your friend then asks for the fourth and final clue. The voice says, \"The largest number only appears once in the code.\" You hear a beep. You hear your cell door swing open. You are free! What was the code?", "_type": "dict", "Heading": "The Passcode", "Answer": "2,2,9", "id": 841}, {"Category": "Logic Puzzles", "Riddle": "I am a tick, I am usually black or white, You will find me on many clothing, People think I am cool.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "What Makes Me Tick", "Answer": "The Nike Symbol.", "id": 842}, {"Category": "Logic Puzzles", "Riddle": "George was cleaning the windows on the eighteenth floor of an office block when there was a massive power failure. The electric hoist on his platform was immoblized.\n\r\n\nSo how did he manage to get down before the power was restored?", "_type": "dict", "Heading": "Windows For Days", "Answer": "George walked down the stairs. He was cleaning the inside of the windows.", "id": 843}, {"Category": "Logic Puzzles", "Riddle": "There are 50 horses and 50 kings riding along an old dirt road. They came to a peach tree with 50 peaches. Each took one, yet there were still 49 left. How is this possible?", "_type": "dict", "Heading": "49 Peaches", "Answer": "Each is the name of one of the kings and he's the only one that took one!", "id": 844}, {"Category": "Logic Puzzles", "Riddle": "Did you hear about the soilder who bought a camouflage sleeping bag?", "_type": "dict", "Heading": "Camo Bag", "Answer": "He can't find it", "id": 845}, {"Category": "Logic Puzzles", "Riddle": "When completed in 1889 the Eiffel Tower was something of a sensation. Designed by the French engineer Alexandre-Gustave Eiffel its height is 492 feet plus half its own height.\n\r\n\nHow high is the eiffel tower?", "_type": "dict", "Heading": "Eiffel Tower Brain Teaser", "Answer": "984 feet.", "id": 986}, {"Category": "Logic Puzzles", "Riddle": "A young man decides to buy a collector's baseball card. He pays $60 for it. After a month, the value of the card has increased to $70 and he decides to sell it. But already a few days later he regrets his decision to sell the collector's item, and he buys it again. Unfortunately he has to pay $80 to get it back, so he loses $10. After a year of owning the baseball card, he finally decides to sell it for $100. What is his overall profit?", "_type": "dict", "Heading": "Unlucky Baseball Card", "Answer": "$30.00. Overall profit, not net profit!", "id": 987}, {"Category": "Logic Puzzles", "Riddle": "There is a barrel with no lid and some wine in it. \"This barrel of wine is more than half full,\" said Curly. \"No it's not,\" says Mo. \"It's less than half full.\" Without any measuring implements and without removing any wine from the barrel, how can they easily determine who is correct?", "_type": "dict", "Heading": "Barrel Of Wine", "Answer": "Tilt the barrel until the wine barely touches the lip of the barrel. If the bottom of the barrel is visible then it is less than half full. If the barrel bottom is still completely covered by the wine, then it is more than half full.", "id": 988}, {"Category": "Logic Puzzles", "Riddle": "Lauren and Alice are talking long distance on the phone. Lauren is in an East-Coast US state which borders the Atlantic Ocean, and Alice is in a West-Coast state which borders the Pacific Ocean. Lauren asks Alice: \"What time is it?\" Alice replies and Lauren says: \"That's really odd. It's the same time here!\" How can this be?", "_type": "dict", "Heading": "Timezones", "Answer": "Alice is in Eastern Oregon (in Mountain time) and Lauren is in Western Florida (in Central time). It is the night that daylight-savings time changes back to standard time any time after 1:00 and before 2:00 AM.", "id": 989}, {"Category": "Logic Puzzles", "Riddle": "a boy had just got out of the shower and gettin ready for his prom,shaved,and with cologne and there was going to be a after party and his mom, and dad said be home for the next sunrise and was home for the next sunrise but with a full grown beard how can this be?", "_type": "dict", "Heading": "Prom  Time", "Answer": "he lives in alaska and sunrise's are every six months.", "id": 990}, {"Category": "Logic Puzzles", "Riddle": "If you have two quarters on a table touching each other, how can you move one of the quarters without touching it? You are only allowed to touch one quarter but not move it. You cant touch the quarter that you move. You want to get at least enough room between the two quarters to insert another coin between the two quarters.", "_type": "dict", "Heading": "Moving Coins", "Answer": "Hold down one of the quarters very firmly. Take another coin and hit it against the quarter you are holding down. Tap hard enough to move the quarter next to it aside.", "id": 991}, {"Category": "Logic Puzzles", "Riddle": "a muder had been suspected but the police did not know how the man had been killed since there had been no windows no doors no chairs no desks the was only a puddle left on the floor in the mans house and the man had been hung by a rope in the middle of the floor and underneth him hangin was a puddle .how did the man reach the ceiling with no promt to get hung up on the celing and why was there a puddle", "_type": "dict", "Heading": "Puddle", "Answer": "the man had waited on a ice cube and the ice cube had melted and left a puddle", "id": 992}, {"Category": "Logic Puzzles", "Riddle": "You are in a room that is completely bricked in on all four sides, including the cieling and floor. You have nothing but a mirror and a wooden table in the room with you.\n\r\n\nHow do you get out?", "_type": "dict", "Heading": "Bricked Up Room", "Answer": "You look in the mirror you see what you saw, you take the saw and you cut the table in half, two halfs make a whole, and you climb out the hole.", "id": 993}, {"Category": "Logic Puzzles", "Riddle": "A rogue pilot was about to bomb Germany! The commad was given, the hatch was opened and the bomb was released.\n\r\n\nWhy didn't it ever hit the ground?", "_type": "dict", "Heading": "The Hit On Germany", "Answer": "The plane was flying upside down!", "id": 994}, {"Category": "Logic Puzzles", "Riddle": "There are 4 borthers 3 of them want to buy a television which is 30 pounds. Each of them pay 10 pound each they give the money to the fourth brother and asked him to go into town and buy the television. When he got there the man said there was 5 pounds off so the fourth brother took the 5 pound and television and left. He decided to make some money out of this so he took 2 pounds and give the other 3 pounds to his brothers. So the 3 brothers only payed 9 pounds each. 3 times 9 is 27 were is the last pound?", "_type": "dict", "Heading": "Where Did The Pund Go?", "Answer": "Add 3 on to 25 = 28 then add 2", "id": 995}, {"Category": "Logic Puzzles", "Riddle": "Try deciphering this code - S T O E E I T A E S S S I N O Y (Hint - count and you will have the answer!)", "_type": "dict", "Heading": "Code Riddle", "Answer": "Did you count the number of letters? There are 16 of them. Divide them in groups of 4. Then, put each group below the other, and read column wise. Here's how you do it... S T O E E I T A E S S S I N O Y The answer to the code is See it is not so easy.", "id": 1136}, {"Category": "Logic Puzzles", "Riddle": "What's the word inside the riddle?", "_type": "dict", "Heading": "Inside Look", "Answer": "The iddl.", "id": 1137}, {"Category": "Logic Puzzles", "Riddle": "Jack had only $2, but he needed $3 for his cab fare home. He went to a pawn shop and pawned his $2 for $1.50. Jack then bumped into Don and told him that he would sell him his $2 pawn ticket for $1.50. Don agreed. Jack started out with $2 and he ended up with $3. Who is out the extra dollar and why?", "_type": "dict", "Heading": "Pawn Shop Ponzi Scheme", "Answer": "Don is out the extra dollar. Before the pawn broker will return the $2 to the ticket holder, he will want the $1.50 which he advanced returned to him. Don will give the pawn broker the ticket and the $1.50, and the pawn broker will then return the $2.", "id": 1138}, {"Category": "Logic Puzzles", "Riddle": "Charlotte is 13 years old. Her father Montague is 40 years old. How many years ago was Charlotte's father four times as old as Charlotte?", "_type": "dict", "Heading": "Charlotte Match Teaser", "Answer": "Four years ago. When Charlotte was 9 her father was 36, 4 times her age.", "id": 1139}, {"Category": "Logic Puzzles", "Riddle": "Find four numbers, the sum of which is 45, so that if 2 is added to the first number, 2 is subtracted from the second number, the third number is multiplied by 2 and the fourth number is divided by 2, then the four numbers so produced are all the same. What are the four numbers?", "_type": "dict", "Heading": "Forty-Five", "Answer": "8 + 2 = 10\n\r\n\n12 - 2 = 10\n\r\n\n  5 x 2 = 10\n\r\n\n20 ÷ 2 = 10\n45", "id": 1140}, {"Category": "Logic Puzzles", "Riddle": "DEFENDING, CALMNESS, SIGHING, CANOPY and STUMBLE. What do these words have in common?", "_type": "dict", "Heading": "What In Common Riddle", "Answer": "They each have 3 letters in common. CA NOP Y.", "id": 1141}, {"Category": "Logic Puzzles", "Riddle": "What is the next 3 letters in this riddle? o t t f f s s _ _ _", "_type": "dict", "Heading": "Next 3 Letters", "Answer": "e n t They represent the first letter when writing the numbers one thru ten.", "id": 1142}, {"Category": "Logic Puzzles", "Riddle": "When is the best time to have lunch?", "_type": "dict", "Heading": "The Lunch", "Answer": "after breakfast", "id": 1143}, {"Category": "Logic Puzzles", "Riddle": "Use all letters of this sentence once each only to spell out three animals.\n\r\n\n'TALL ELEPHANT OR APEMAN'", "_type": "dict", "Heading": "Three Animals", "Answer": "PANTHER, ANTELOPE, LLAMA", "id": 1144}, {"Category": "Logic Puzzles", "Riddle": "A forest exists somewhere on Earth. This forest has no life except for trees. After a storm, a tree was hit by lightning and falls.\n\r\n\nWhat sound would it make?", "_type": "dict", "Heading": "Existence", "Answer": "None. Sound does not exist if it is unheard.", "id": 1145}, {"Category": "Logic Puzzles", "Riddle": "How many times does the long hand of the clock pass the short hand between midnight one day and midnight the following day? As both hands are together at the starting time of midnight this does not count as a pass.", "_type": "dict", "Heading": "The Hands Of The Clock", "Answer": "21.", "id": 1286}, {"Category": "Logic Puzzles", "Riddle": "What have these words in common?\n\r\n\nASPIRATED  GRANGERS  PRELATES  SWINGERS  CHASTENS", "_type": "dict", "Heading": "Words Change Game", "Answer": "All can be diminished by one letter (from begining and end alternately) forming a new word each time.", "id": 1287}, {"Category": "Logic Puzzles", "Riddle": "A dog had three puppies, named Mopsy, Topsy and Spot. What was the mothers name?", "_type": "dict", "Heading": "Puppy Love", "Answer": "What", "id": 1288}, {"Category": "Logic Puzzles", "Riddle": "The following numbers share a unique property: 1961 6088 6119 8118 6699 6009. What is it?", "_type": "dict", "Heading": "Seven Numbers", "Answer": "Each number reads the same when viewed upside down.", "id": 1289}, {"Category": "Logic Puzzles", "Riddle": "Suppose you want to send in the mail a valuable object to a friend. You have a box which is big enough to hold the object. The box has a locking ring which is large enough to have a lock attached and you have several locks with keys. However, your friend does not have the key to any lock that you have. You cannot send the key in an unlocked box since it may be stolen or copied. How do you send the valuable object, locked, to your friend - so it may be opened by your friend?", "_type": "dict", "Heading": "Mailing A Valuable Object", "Answer": "Send the box with a lock attached and locked. Your friend attaches his or her own lock and sends the box back to you. You remove your lock and send it back to your friend. Your friend may then remove the lock she or he put on and open the box.", "id": 1290}, {"Category": "Logic Puzzles", "Riddle": "Five hundred begins it, five hundred ends it, Five in the middle is seen; First of all figures, the first of all letters, Take up their stations between. Join all together, and then you will bring Before you the name of an eminent king. Who am I?", "_type": "dict", "Heading": "The King Riddle", "Answer": "DAVID (Roman numerals)", "id": 1291}, {"Category": "Logic Puzzles", "Riddle": "Sally, Lisa, and Bernadette are triplets. But Sally and Lisa share something that Berandette does not. What is it?", "_type": "dict", "Heading": "Sisters", "Answer": "The letter 'L' in their names.", "id": 1292}, {"Category": "Logic Puzzles", "Riddle": "As a whole, I am both safe and secure. Behead me, and I become a place of meeting. Behead me again, and I am the partner of ready. Restore me, and I become the domain of beasts.\n\r\n\nWhat am I?", "_type": "dict", "Heading": "I Am Safe And Secure.", "Answer": "Stable.", "id": 1293}, {"Category": "Logic Puzzles", "Riddle": "Some cogs are tigs. \n All tigs are bons. \n Some bons are pabs. \n Some pabs are tigs. \n Therefore, cogs are definitely pabs.--- TRUE or FALSE?", "_type": "dict", "Heading": "Cogs, Tigs And Pabs", "Answer": "False. Some cogs may be pabs, but not definitely all of them.", "id": 1294}, {"Category": "Logic Puzzles", "Riddle": "A Queen has twins by Caesarean section so it's impossible to tell who was born first.  Now the twins are adults and ready to rule. One is intensely stupid, while the other is highly intelligent, well loved and charismatic. Yet the unintelligent one is chosen as the next ruler.\n\r\n\nWhy?", "_type": "dict", "Heading": "First In Line", "Answer": "He is a male.", "id": 1295}, {"Category": "Logic Puzzles", "Riddle": "A woman who lives in new york legally married three men, she did not get divorce, get an enollment, or legally seperate.\n\r\n\nHow is this possible?", "_type": "dict", "Heading": "Marriage Riddle", "Answer": "She is a minister.", "id": 1436}, {"Category": "Logic Puzzles", "Riddle": "You want to send a valuable object to a friend. You have a box which is more than large enough to contain the object. You have several locks with keys. The box has a locking ring which is more than large enough to have a lock attached. But your friend does not have the key to any lock that you have. How do you do it? Note that you cannot send a key in an unlocked box, since it might be copied.", "_type": "dict", "Heading": "Locked And Safe", "Answer": "Attach a lock to the ring. Send it to her. She attaches her own lock and sends it back. You remove your lock and send it back to her. She removes her lock.", "id": 1437}, {"Category": "Logic Puzzles", "Riddle": "I have ten or more daughters. I have less than ten daughters. I have at least one daughter. If only one of these statements is true, how many daughters do I have?", "_type": "dict", "Heading": "My Daughters", "Answer": "If I have any daughters, there will always be two statements which are true. Therefore, I have no daughters.", "id": 1438}, {"Category": "Logic Puzzles", "Riddle": "Two grandmothers, with their two granddaughters; \n Two husbands, with their two wives; \n Two fathers, with their two daughters; \n Two mothers, with their two sons; \n Two maidens, with their two mothers; \n Two sisters, with their two brothers; \n Yet only six in all lie buried here; \n All born legitimate, from incest clear", "_type": "dict", "Heading": "Two Grandmothers", "Answer": "Two widows each had a son, and each widow married the son of the other and then each had a daughter", "id": 1439}, {"Category": "Logic Puzzles", "Riddle": "Fred is listening to the raido when it suddenly stops playing. Nobody is with Fred and nobody touches the radio. A few seconds later, the radio resumes playing.\n\r\n\nHow can this be?", "_type": "dict", "Heading": "Fred's System", "Answer": "Fred was driving his car through a tunnel.", "id": 1440}, {"Category": "Logic Puzzles", "Riddle": "You go to the doctor because you're ill and he prescribes you with 3 pills and tells you to take them every half hour.\n\r\n\nHow long do the pills last you?", "_type": "dict", "Heading": "Doctor", "Answer": "An hour because the first pill doesn't take 30 min. to take.", "id": 1441}, {"Category": "Logic Puzzles", "Riddle": "A man enters an expensive restraunt and orders a meal. When the waiter brings him his meal the man takes out a slip of paper and writes down 102004180, then leaves. The cashier hands the slip of paper to the cashier who understood it immediately.\n\r\n\nWhat did the slip of paper say?", "_type": "dict", "Heading": "Smart Cashier", "Answer": "I =1, 0=Ought, 2=To, 0=Owe, 0=Nothing, 4=For, 1=I, 8=Ate, 0=Nothing. I Ought To Owe Nothing For I Ate Nothing. 102004180", "id": 1442}, {"Category": "Logic Puzzles", "Riddle": "A hunter met two shepherds, one of whom had three loaves and the other, five loaves. All the loaves were the same size. The three men agreed to share the eight loaves equally between them. After they had eaten, the hunter gave the shepherds eight bronze coins as payment for his meal. How should the two shepherds fairly divide this money?", "_type": "dict", "Heading": "Two Shepherds", "Answer": "The shepherd who had three loaves should get one coin and the shepherd who had five loaves should get seven coins. If there were eight loaves and three men, each man ate two and two-thirds loaves. So the first shepherd gave the hunter one-third of a loaf and the second shepherd gave the hunter two and one-third loaves. The shepherd who gave one-third of a loaf should get one coin and the one who gave seven-thirds of a loaf should get seven coins.", "id": 1443}, {"Category": "Logic Puzzles", "Riddle": "While playing with a metal washer shaped like a ring, Dave accidently pushed it on his finger too far and couldn't get it off. Trying to remove it using soap and water didn't work. The hospital sent him to a service station thinking they could cut the metal. Since the ring was made with a specially hardened steel, it couldn't be cut. Just then Bob arrived on the scene and suggested an easy way to remove the washer in just a few minutes. What was his solution?", "_type": "dict", "Heading": "Metal Washer Ring", "Answer": "Bob suggested that Dave hold his finger in the air while someone wound a piece of string tightly around his finger just above the metal ring. The string forced the swelling down. As they unwounded the string from the end nearest the ring, someone else slid the ring up. They continued winding and unwinding the string until the ring could be easily removed.", "id": 1444}, {"Category": "Logic Puzzles", "Riddle": "You have two container, a 5 gallon and a 3 gallon container. How do you measure out 4 gallons?", "_type": "dict", "Heading": "Gallons Of Water", "Answer": "Fill up the 3 gallon container and pour the 3 gallons into the 5 gallon container.\nThen, fill the 3 gallon container back up, and pour it into the 5 gallon container.\nThe 3 gallon container will have 1 gallon left. \nEmpty the 5 gallon container.\nPour the remining 1 gallon into the 5 gallon container.\nThen fill the 3 gallon container back up and pour it into the 5 gallon container.\nThus, you have 4 gallons.", "id": 1445}, {"Category": "Logic Puzzles", "Riddle": "If it is 1,800 kilometers to America, 1,200 kilometers to Japan, 2,400 kilometers to New Zealand, and 1,400 kilometers to Brazil- \n\r\n\nHow far is Morocco?", "_type": "dict", "Heading": "Lets Travel ", "Answer": "The answer is 1,700 kilometers, as vowels in the countries' names are worth 300 kilometers and the consonats are worth 200 kilometers.", "id": 1586}, {"Category": "Logic Puzzles", "Riddle": "You are given a set of scales and 12 marbles. The scales are of the old balance variety. That is, a small dish hangs from each end of a rod that is balanced in the middle. The device enables you to conclude either that the contents of the dishes weight the same or that the dish that falls lower has heavier contents than the other. The 12 marbles appear to be identical. In fact, 11 of them are identical, and one is of a different weight. Your task is to identify the unusual marble and discard it. You are allowed to use the scales three times if you wish, but no more. Note that the unusual marble may be heavier or lighter than the others. You are asked to both identify it and determine whether it is heavy or light", "_type": "dict", "Heading": "Marbles", "Answer": "Most people seem to think that the thing to do is weight six coins against six coins, but if you think about it, this would yield you no information concerning the whereabouts of the only different coin. As we already know that one side will be heavier than the other. So that the following plan can be followed, let us number the coins from 1 to 12. For the first weighing let us put on the left pan coins 1,2,3,4 and on the right pan coins 5,6,7,8. There are two possibilities. Either they balance, or they don't. If they balance, then the different coin is in the group 9,10,11,12. So for our second weighing we would put 1,2 in the left pan and 9,10 on the right. If these balance then the different coin is either 11 or 12. Weigh coin 1 against 11. If they balance, the different coin is number 12. If they do not balance, then 11 is the different coin. If 1,2 vs 9,10 do not balance, then the different coin is either 9 or 10. Again, weigh 1 against 9. If they balance, the different coin is number 10, otherwise it is number 9. That was the easy part. What if the first weighing 1,2,3,4 vs 5,6,7,8 does not balance? Then any one of these coins could be the different coin. Now, in order to proceed, we must keep track of which side is heavy for each of the following weighings. Suppose that 5,6,7,8 is the heavy side. We now weigh 1,5,6 against 2,7,8. If they balance, then the different coin is either 3 or 4. Weigh 4 against 9, a known good coin. If they balance then the different coin is 3, otherwise it is 4. Now, if 1,5,6 vs 2,7,8 does not balance, and 2,7,8 is the heavy side, then either 7 or 8 is a different, heavy coin, or 1 is a different, light coin. For the third weighing, weigh 7 against 8. Whichever side is heavy is the different coin. If they balance, then 1 is the different coin. Should the weighing of 1,5, 6 vs 2,7,8 show 1,5,6 to be the heavy side, then either 5 or 6 is a different heavy coin or 2 is a light different coin. Weigh 5 against 6. The heavier one is the different coin. If they balance, then 2 is a different light coin.", "id": 1587}, {"Category": "Logic Puzzles", "Riddle": "There are 100 light bulbs lined up in a row in a long room. Each bulb has its own switch and is currently switched off. The room has an entry door and an exit door. There are 100 people lined up outside the entry door. Each bulb is numbered consecutively from 1 to 100. So is each person. Person No. 1 enters the room, switches on every bulb, and exits. Person No. 2 enters and flips the switch on every second bulb (turning off bulbs 2, 4, 6, ...). Person No. 3 enters and flips the switch on every third bulb (changing the state on bulbs 3, 6, 9, ...). This continues until all 100 people have passed through the room. What is the final state of bulb No. 64? And how many of the light bulbs are illuminated after the 100th person has passed through the room?", "_type": "dict", "Heading": "The Lightbulb", "Answer": "First think who will operate each bulb, obviously person #2 will do all the even numbers, and say person #10 will operate all the bulbs that end in a zero. So who would operate for example bulb 48: Persons numbered: 1 & 48, 2 & 24, 3 & 16, 4 & 12, 6 & 8 ........ That is all the factors (numbers by which 48 is divisible) will be in pairs. This means that for every person who switches a bulb on there will be someone to switch it off. This willl result in the bulb being back at it's original state. So why aren't all the bulbs off? Think of bulb 36:- The factors are: 1 & 36, 2 & 13, 6 & 6 Well in this case whilst all the factors are in pairs the number 6 is paired with it's self. Clearly the sixth person will only flick the bulb once and so the pairs don't cancel. This is true of all the square numbers. There are 10 square numbers between 1 and 100 (1, 4, 9, 16, 25, 36, 49, 64, 81 & 100) hence 10 bulbs remain on.", "id": 1588}, {"Category": "Logic Puzzles", "Riddle": "How can this be true? Have a look at the picture. All the lines are straight, the shapes that make up the top picture are the same as the ones in the bottom picture so where does the gap come from?", "_type": "dict", "Heading": "Triange Problem", "Answer": "The green triangle has dimensions 2 x 5 and gradient 2 / 5 = 0.4 \n The red triangle has dimensions 3 x 8 and gradient 3 / 8 = 0.375 \n Hence the gradient of the green triangle is greater than that of the red triangle.", "id": 1589}, {"Category": "Logic Puzzles", "Riddle": "Their are three gaurds and three prisoners who need to cross a river. Their boat only holds two people at a time, and the number of prisoners must NEVER be allowed to outnumber the number of gaurds on either side of the river; otherwise, the prisoners will overpower the gaurds and, well, the story will come to an abrupt end. \n \n Determine how many trips it will take to safely transport all of the gaurds and prisoners across the river, list each of the trips that need to be made and who is in the boat and who is on each of the riverbanks during each trip.", "_type": "dict", "Heading": "GUARDS AND PRISONERS", "Answer": "Inless some one can tell me a way that 2 prisoners, at some point, don't out number the guards whether they are just dropping off and still in the boat or actually on land (because even if they are just dropping off and remain in the boat they are still on the other side of the river) I conclude this to be impossible. Please let me know an alternative if you figure one out because i'm stumped. \n \n thanks", "id": 1590}, {"Category": "Logic Puzzles", "Riddle": "you are stuck in a house\n you have four objects to use\n you have a wooden chair,a ladder\n a piano,and an axe.\n The axe is rubber\n What would you use to get out?? hint* you can't get out with breaking it\n and you can only pick one object.", "_type": "dict", "Heading": "Stuck In A House", "Answer": "you use the piano KEYS!!!!!", "id": 1591}, {"Category": "Logic Puzzles", "Riddle": "Angry and Hungry are two words ending in 'gry\"\n There are three words, (Using popular terminology) \nin the English Language, that end in \"GRY\". \n .\n What is the third word? \n The word is something that everyone uses every day. \n If you have listened carefully, \n I have already told you what it is.", "_type": "dict", "Heading": "The GRY Riddle", "Answer": "Answer is terminology. (It's the third word ending in gry. Usin(g) popula(r) teminolog(y)", "id": 1592}, {"Category": "Logic Puzzles", "Riddle": "Carl is trying to find solutions to a geometric puzzle.  He has a square plot of land that he needs to reserve 1/4 for himself and divide the remaining 3/4 equally and in similar shape, among his 4 children.  There are two possible solutions.  Can you solve the puzzle?", "_type": "dict", "Heading": "Geometric Puzzle #1", "Answer": "Solution #1 - Squares\n\r\n\nFirst, Carl divides his as to reserve to himself one-fourth in the form of a square.\n\r\n\n\r\n\nThen, Carl takes the remaining 3/4 shape and scales it down by 1/4.  He then, multiplies the shape into 4 identically shaped pieces, and aranges them so that they fit into the original 3/4 shape.\n\r\n\n\r\n\nSolution #2 - Rectangles\n\r\n\nFirst, create a triangle that is 1/4 the size of the square.\n\r\n\n\r\n\nNow, with straight lines, create two squares.\n\r\n\nProceed to disect the two squares with horizontal lines creating 4 triangles.\n\r\n\nThen, disect one of the resultuing triangles from each square.  The shape of land for each of his four children is divided evenly and is the same shape.\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1.jpg\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1-Answer.jpg\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1-Answer-2.jpg\nhttps://www.riddles.com/../../../uploads/images/Geometric-Puzzle-1-Solution-2.jpg", "id": 1593}, {"Category": "Logic Puzzles", "Riddle": "Three working women have different careers. If only one of statements 1, 2 and 3 are true, can you tell whether or not Mary is a nurse? 1. This statement is only true if statement 5 is false. 2. This statement is true if statements 4 or 5, or both 4 and 5 are true. 3. This statement is false only if both statements 6 and 1 are true. 4. Mary is a nurse 5. Karen is an artist. 6. Sarah is a photographer.", "_type": "dict", "Heading": "Careers", "Answer": "Mary is not a nurse. The way to solve this riddle, is to consider statements 4, 5, and 6 and create a chart of all possible true and false answers. Next, fill in the chart according to statements 1 through 3. You will discover that there is only one line where only one of statements one, two and three are true. Thus, it is determined that: Statement 4 and 5 are false and statement 6 is true.", "id": 1594}, {"Category": "Logic Puzzles", "Riddle": "A man told his son that he would give him $1000 if he could accomplish the following task. The father gave his son ten envelopes and a thousand dollars, all in one dollar bills. He told his son, \"Place the money in the envelopes in such a manner that no matter what number of dollars I ask for, you can give me one or more of the envelopes, containing the exact amount I asked for without having to open any of the envelopes. If you can do this, you will keep the $1000.\" When the father asked for a sum of money, the son was able to give him envelopes containing the exact amount of money asked for. How did the son distribute the money among the ten envelopes?", "_type": "dict", "Heading": "1000 Bucks", "Answer": "The contents or the ten envelopes (in dollar bills) should be as follows: $1, 2, 4, 8, 16, 32, 64, 128, 256, 489. The first nine numbers are in geometrical progression, and their sum, deducted from 1,000, gives the contents of the tenth envelope.", "id": 1595}]