[{"Category": "Math Riddles", "Riddle": "How do you make the number 7 even without addition, subtraction, multiplication, or division?", "_type": "dict", "Heading": "Even Seven", "Answer": "Drop the \"S\".", "id": 87}, {"Category": "Math Riddles", "Riddle": "Can you write down eight eights so that they add up to one thousand?", "_type": "dict", "Heading": "Eight Eights", "Answer": "888 + 88 + 8 + 8 + 8 = 1000.", "id": 88}, {"Category": "Math Riddles", "Riddle": "How can you take 2 from 5 and leave 4?", "_type": "dict", "Heading": "Strange Subtraction", "Answer": "F  I V  E\n\r\n\nRemove the 2 letters F and E from five and you have IV.", "id": 89}, {"Category": "Math Riddles", "Riddle": "How many sides does a circle have?", "_type": "dict", "Heading": "What About Circles", "Answer": "Two. The inside and the outside.", "id": 90}, {"Category": "Math Riddles", "Riddle": "How many times can you subtract the number 5 from 25?", "_type": "dict", "Heading": "Subtraction", "Answer": "Once, because after you subtract it's not 25 anymore.", "id": 91}, {"Category": "Math Riddles", "Riddle": "When John was six years old he hammered a nail into his favorite tree to mark his height. Ten years later at age sixteen, John returned to see how much higher the nail was. If the tree grew by five centimeters each year, how much higher would the nail be?", "_type": "dict", "Heading": "A Growing Tree", "Answer": "The nail would be at the same height since trees grow at their tops.", "id": 92}, {"Category": "Math Riddles", "Riddle": "I am four times as old as my daughter. In 20 years time I shall be twice as old as her.\n\r\n\nHow old are we now?", "_type": "dict", "Heading": "4x As Old", "Answer": "I am 40 and my daughter is 10.", "id": 93}, {"Category": "Math Riddles", "Riddle": "What did one math book say to the other math book?", "_type": "dict", "Heading": "Math Book Talk", "Answer": "Do you want to hear my problems?", "id": 94}, {"Category": "Math Riddles", "Riddle": "There is a clothing store in Bartlesville. The owner has devised his own method of pricing items. A vest costs $20, socks cost $25, a tie costs $15 and a blouse costs $30. Using the method, how much would a pair of underwear cost?", "_type": "dict", "Heading": "By Letter By Number Logic Puzzle", "Answer": "$45. The pricing method consists of charging $5 for each letter required to spell the item.", "id": 95}, {"Category": "Math Riddles", "Riddle": "One is to three as three is to five and five is to four and four is the magic number.\n\r\n\nWhat is the pattern?", "_type": "dict", "Heading": "The Pattern?", "Answer": "One has three letters in the word three has five letters in it five has four letters and four has four letters in it (if you try more numbers they will always come back to the number four: so four is the magic number)", "id": 96}, {"Category": "Math Riddles", "Riddle": "Lily is a lilypad in a small pond. Lilly doubles her size each day, On the 20th day she covers the whole pond. On what day was Lily half the size of the pond?", "_type": "dict", "Heading": "Lily The Lillypad", "Answer": "Day 19, it's not 10 because on day 20 she doubled from day 19, so 19 must be half the size of the pond.", "id": 347}, {"Category": "Math Riddles", "Riddle": "If a boy blows 18 bubbles, \n Then pops 6 eats 7 and then \n He pops 5 and blows 1. \n How many are left?", "_type": "dict", "Heading": "7up...", "Answer": "1.", "id": 348}, {"Category": "Math Riddles", "Riddle": "What did the triangle say to the circle?", "_type": "dict", "Heading": "Geometrical Joke", "Answer": "You’re pointless.", "id": 349}, {"Category": "Math Riddles", "Riddle": "The ages of a father and son add up to 66. \n The father's age is the son's age reversed. \n How old could they be? \n (3 possible solutions).", "_type": "dict", "Heading": "Age Of Father And Son", "Answer": "51 and 15. 42 and 24. 60 and 06.", "id": 350}, {"Category": "Math Riddles", "Riddle": "What two whole, positive numbers that have a one-digit answer when multiplied and a two-digit answer when added?", "_type": "dict", "Heading": "Numbers Added And Multiplied Riddle", "Answer": "1 and 9.", "id": 351}, {"Category": "Math Riddles", "Riddle": "81 x 9 = 801. What must you do to make the this equation true?", "_type": "dict", "Heading": "Math Equation Riddle", "Answer": "Turn it upside down.  108 = 6 x 18.", "id": 352}, {"Category": "Math Riddles", "Riddle": "You want to boil a two-minute egg. If you only have a three-minute timer (hourglass), a four-minute timer and a five-minute timer, how can you boil the egg for only two minutes?", "_type": "dict", "Heading": "Boiling An Egg", "Answer": "Once the water is boiling, turn the three-minute timer and five-minute timer over. When the three-minute timer runs out, put the egg in the boiling water. When the five-minute timer runs out, two minutes have elapsed and it is time take the egg out of the water. You don't need the four-minute timer for this riddle.", "id": 353}, {"Category": "Math Riddles", "Riddle": "How much will a 38° angle measure when looked at under a microscope that magnifies ten times?", "_type": "dict", "Heading": "Angle Measure Riddle", "Answer": "It will still be 38°.", "id": 354}, {"Category": "Math Riddles", "Riddle": "How can you make the following equation true by drawing only one straight line: 5+5+5=550? Can you figure it out?", "_type": "dict", "Heading": "Make The Equation True", "Answer": "Draw a line on the first plus sign that turns it into a 4! The equation then becomes true: 545+5=550. You could also change the equal symbol to a crossed out equal symbol which means \"not equal to\".", "id": 355}, {"Category": "Math Riddles", "Riddle": "What did the little lobster get on its math test?", "_type": "dict", "Heading": "Lobster Results", "Answer": "Sea-plus.", "id": 356}, {"Category": "Math Riddles", "Riddle": "If you're 8 feet away from a door and with each move you advance half the distance to the door. How many moves will it take to reach the door?", "_type": "dict", "Heading": "Advance Half The Distance?", "Answer": "Infinity! Technically you will never reach the door, as you can only move half the distance, no matter how small.", "id": 598}, {"Category": "Math Riddles", "Riddle": "How old is your son? asked a man to his neighbour. My son is five times as old as my daughter and my wife is five times as old as my son. Iam twice as old as my wife whereas my grandmother, who is celebrating her eighty-first birthday is as old as all of us put togeather.\n\r\n\nHow old is the man's son?", "_type": "dict", "Heading": "Grandmothers Birthday", "Answer": "Five.", "id": 599}, {"Category": "Math Riddles", "Riddle": "I am a three digit number. \n My tens digit is five more than my ones digit. \n My hundreds digit is eight less than my tens digit. \n What number am I?", "_type": "dict", "Heading": "I Am A Three Digit Number", "Answer": "Number 194.", "id": 600}, {"Category": "Math Riddles", "Riddle": "A sphere has three, a circle has two, and a point has zero. What is it?", "_type": "dict", "Heading": "Be On Point", "Answer": "Dimensions.", "id": 601}, {"Category": "Math Riddles", "Riddle": "Why is it easier to count cows than sheep?", "_type": "dict", "Heading": "Math Tutor", "Answer": "You can use a cowculator.", "id": 602}, {"Category": "Math Riddles", "Riddle": "If 4+2=26, 8+1=79 and 6+5=111. Then, what is 7+3?", "_type": "dict", "Heading": "Expert Level Mathematics", "Answer": "410.4+2=26 is because 4-2=2 and 4+2=6,so it is 26. Therefore, 7-3=4 and 7+3=10(410).", "id": 603}, {"Category": "Math Riddles", "Riddle": "In a stable there are men and horses. In all, there are 22 heads and 72 feet. How many men and how many horses are in the stable?", "_type": "dict", "Heading": "In The Stable", "Answer": "14 horses and 8 men. 14x4 plus 8x2 = 72 feet.", "id": 604}, {"Category": "Math Riddles", "Riddle": "A tree doubled in height each year until it reached its maximum height over the course of ten years. How many years did it take for the tree to reach half its maximum height?", "_type": "dict", "Heading": "Doubling", "Answer": "Nine Years.", "id": 605}, {"Category": "Math Riddles", "Riddle": "Take two numbers, such that the square of the first, plus the square of the second, shall equal 8; while the first, plus the product of the first and second, shall equal 6.  What are the two numbers?", "_type": "dict", "Heading": "Two Numbers Riddle", "Answer": "2 and 2.", "id": 606}, {"Category": "Math Riddles", "Riddle": "What do mathematics teachers like to eat?", "_type": "dict", "Heading": "Hungry Teachers", "Answer": "Pi.", "id": 607}, {"Category": "Math Riddles", "Riddle": "Find the four digit number in which the first digit is one fourth of the last digit, the second digit is 6 times the first digit, and the third digit is the second digit plus 3. What is it?", "_type": "dict", "Heading": "Four Digit Number", "Answer": "1694.", "id": 826}, {"Category": "Math Riddles", "Riddle": "What happened to the plant in the math classroom?", "_type": "dict", "Heading": "Mathematical!", "Answer": "It grew square roots, of course.", "id": 827}, {"Category": "Math Riddles", "Riddle": "Something very extraordinary happened on the 6th of May, 1978 at 12:34 a.m. What was it?", "_type": "dict", "Heading": "Sequences Of Time", "Answer": "At that moment, the time and day could be written as: 12:34, 5/6/78.", "id": 828}, {"Category": "Math Riddles", "Riddle": "What do you call two math friends?", "_type": "dict", "Heading": "Math Friends", "Answer": "Algebros!!", "id": 829}, {"Category": "Math Riddles", "Riddle": "What did one math book say to another?", "_type": "dict", "Heading": "Mathbook Riddle", "Answer": "I have so many problems.", "id": 830}, {"Category": "Math Riddles", "Riddle": "When my father was 31 I was 8. Now he is twice as old as me. How old am I?", "_type": "dict", "Heading": "How Old Am I?", "Answer": "The difference in age is 23 years, so I must be 23 if my father is twice as old as me.", "id": 831}, {"Category": "Math Riddles", "Riddle": "What is the most useful instrument in a mathematics teacher's tool kit?", "_type": "dict", "Heading": "Handy Math Teachers", "Answer": "Multi-pilers!", "id": 832}, {"Category": "Math Riddles", "Riddle": "A new medical building containing 100 offices had just been completed. Mark was hired to paint the numbers 1 to 100 on the doors. How many times will Mark have to paint the number nine?", "_type": "dict", "Heading": "Tricky Nines", "Answer": "The answer is 20! 9, 19, 29, 39, 49, 59, 69, 79, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99.", "id": 833}, {"Category": "Math Riddles", "Riddle": "Take eight small sticks, four of which are half the length of the other four. Make three equal squares out of the sticks.", "_type": "dict", "Heading": "Three Squares", "Answer": "Use the longer four sticks to be sharing sides between the squares and at the end their should be three intertwined squares.\nhttps://www.riddles.com/../../../uploads/images/8-sticks-3-squares.png", "id": 834}, {"Category": "Math Riddles", "Riddle": "What is the next number in the series?\n\r\n\n7,645 5,764 4,576...", "_type": "dict", "Heading": "Whats Next", "Answer": "6,457. The last digit is moved to the front to make the next number.", "id": 835}, {"Category": "Math Riddles", "Riddle": "If seven people meet each other and each shakes hands only once with each of the others, how many handshakes will there have been?", "_type": "dict", "Heading": "Handshaking", "Answer": "Twenty one. Most people would think there were 42 handshakes. The first person shakes the hand of \n6\n others, the second person shakes the hand of \n5\n remaining people, the third person shakes the hand of \n4\n remaining people, the fourth person shakes the hand of \n3\n remaining people, the 5th person shakes the hand of \n2\n remaining people and the sixth person shakes the hand of \n1\n remaining person. \n6\n+\n5\n+\n4\n+\n3\n+\n2\n+\n1\n=\n21", "id": 976}, {"Category": "Math Riddles", "Riddle": "I am a two-digit number. All my digits are even. No two digits are the same. None of my digits are prime numbers. I am not a multiple of ten. My tens digit is bigger than my other numbers. If you followed all the previous steps, there should be three options remaining the number is the option where if you add all the digits it’s exactly in the middle (in how big the number is) of all the other options with their digits added together. What number am I?", "_type": "dict", "Heading": "The Even Number.", "Answer": "If you followed all the steps apart from the last one there will be three options remaining: 64, 84, and 86. You then had to add up the digits, 64=6+4=10, 84=8+4=12, and 86=8+6=14. Finally, you then had to take up the middle biggest number (12) and put it back as it was before the digits were added together and your answer should be 84.", "id": 977}, {"Category": "Math Riddles", "Riddle": "I am a three-digit number. All of my digits are prime. One of the numbers is even. Each of my numbers are used only once. The total of my first and last digits equals 10. The total of my first two digits equals 5.", "_type": "dict", "Heading": "The King Of Primes", "Answer": "This one is fairly easy if you use elimination if you follow all the first 5 steps you get three options: 525, 327, and 723 but if you followed the last step you would reach your answer. The answer was 327.", "id": 978}, {"Category": "Math Riddles", "Riddle": "If someone says to you, \"I'll bet you $1 that if you give me $2, I will give you $3 in return\", would this be a good bet for you to accept?", "_type": "dict", "Heading": "Crazy Bet", "Answer": "No. This is a situation where you lose even if you win. Assuming the other person is being wise, they would take your $2 and say, \"I lose\", and give you $1 in return. You win the bet, but you're out $1.", "id": 979}, {"Category": "Math Riddles", "Riddle": "The distance from the Earth to the Sun is about 100 million miles. The speed of light is 186,000 miles per second, and light takes eight minutes to reach the Earth from the Sun.  Let's say the Sun rose at 6am this morning, and that by some freak of physics the speed of light is suddenly doubled to 372,000 miles a second.\n\r\n\nWhat time will the Sun rise tomorrow?", "_type": "dict", "Heading": "Light Speed", "Answer": "6am again. After all, what diffrence does the speed of light make to the answer?  It's irrelevant- only the speed of the roation of the Earth matters here.", "id": 980}, {"Category": "Math Riddles", "Riddle": "Taking that internship in a remote mountain lab might not have been the best idea. Pulling that lever with the skull symbol just to see what it did probably wasn’t so smart either. But now is not the time for regrets because you need to get away from these mutant zombies...fast. Can you use math to get you and your friends over the bridge before the zombies arrive? Alex Gendler shows how.", "_type": "dict", "Heading": "The Bridge Riddle By Alex Gendler - TED-ed", "Answer": "At first it might seem like no matter what you do, you're just a minute or two short of time, but there is a way.  The key is to minimize the time wasted by the two slowest people by having them cross together.  And because you'll need to make a couple of return trips with the lantern, you'll want to have the fastest people available to do so.  So, you and the lab assistant quickly run across with the lantern, though you have to slow down a bit to match her pace.  After two minutes, both of you are across, and you, as the quickest, run back with the lantern.  Only three minutes have passed.  So far, so good.  Now comes the hard part.  The professor and the janitor take the lantern and cross together.  This takes them ten minutes since the janitor has to slow down for the old professor who keeps muttering that he probably shouldn't have given the zombies night vision.  By the time they're across, there are only four minutes left, and you're still stuck on the wrong side of the bridge.  But remember, the lab assistant has been waiting on the other side, and she's the second fastest of the group.  So she grabs the lantern from the professor and runs back across to you.  Now with only two minutes left, the two of you make the final crossing.  As you step on the far side of the gorge, you cut the ropes and collapse the bridge behind you, just in the nick of time.", "id": 981}, {"Category": "Math Riddles", "Riddle": "The head of a whale is six feet long; his tail is as long as his head and half his body, and his body is half of his whole length. How long is the whale?", "_type": "dict", "Heading": "How Long Is The Whale?", "Answer": "Forty-eight feet.", "id": 982}, {"Category": "Math Riddles", "Riddle": "Adored by few, Feared and hated by many. Mistress of the entire universal reason, Master in the art of numbers. Some may have solved many of your mysteries, But there still much of them to find. What are they?", "_type": "dict", "Heading": "Art Of Numbers", "Answer": "Mathematics.", "id": 983}, {"Category": "Math Riddles", "Riddle": "In a pond there are some flowers with some bees hovering over them. How many flowers and bees are there if both the following statements are true: 1. If each bee lands on a flower, one bee doesn't get a flower. 2. If two bees share each flower, there is one flower left out.", "_type": "dict", "Heading": "Bees And Flowers", "Answer": "4 bees and 3 flowers.", "id": 984}, {"Category": "Math Riddles", "Riddle": "There are two numbers whose product added to the sum of their squares is 109, and the difference of whose squares is 24. What are the two numbers?", "_type": "dict", "Heading": "Two Numbers Math Riddle", "Answer": "5 and 7.\n\r\n\n(5)² = 25\n(7)² = 49\n(5x7)+25+49=109\n49-25=24", "id": 985}, {"Category": "Math Riddles", "Riddle": "Three point one four, one five nine two six five, three five eight nine... What am I?", "_type": "dict", "Heading": "Pi Day Riddle", "Answer": "Pi - π.", "id": 1126}, {"Category": "Math Riddles", "Riddle": "2, 3, 5, 9, 17, _ What is the next number in the sequence?", "_type": "dict", "Heading": "What's The Next Number?", "Answer": "33. The pattern:  Double the previous number and subtract 1.", "id": 1127}, {"Category": "Math Riddles", "Riddle": "Two schoolgirls were traveling from the city to a dacha (summer cottage) on an electric train.\n\r\n\n\"I notice,\" one of the girls said \"that the dacha trains coming in the opposite direction pass us every 5 minutes. What do you think-how many dacha trains arrive in the city in an hour, given equal speeds in both directions?\"\n\r\n\n\"Twelve, of course,\" the other girl answered, \"because 60 divided by 5 equals 12.\"\n\r\n\nThe first girl did not agree. What do you think?", "_type": "dict", "Heading": "Riding The Train", "Answer": "If the girls had been on a standing train, the first girl's calculations would have been correct, but their train was moving. It took 5 minutes to meet a second train, but then it took the second train 5 more minutes to reach where the girls met the first train. So the time between trains is 10 minutes, not 5, and only 6 trains per hour arrive in the city.", "id": 1128}, {"Category": "Math Riddles", "Riddle": "Robert and David played several golf matches against each other in a week. They played for a pizza at each match, but no pizzas were purchased until the end of the week. If at any time Robert and David had the same number of wins, those pizzas were canceled. Robert won four matches (but no pizzas), and David won three pizzas. How many rounds of golf were played?", "_type": "dict", "Heading": "Rounds Of Golf", "Answer": "Eleven, David won 7 matches, 4 to cancel out Robert's 4 wins, and 3 more to win the pizzas.", "id": 1129}, {"Category": "Math Riddles", "Riddle": "Combine plus signs and five 2's to get 28. Combine plus signs and eight 8's to get 1,000.", "_type": "dict", "Heading": "With The Same Figures", "Answer": "22+2+2+2=28; 888+88+8+8+8=1,000", "id": 1130}, {"Category": "Math Riddles", "Riddle": "There is a certain club which is for men only. There are 600 men who belong to this club and 5% of these men wear one earring. Of the other 95% membership, half wear two earrings and the other half wear none. How many earrings are being worn in this club?", "_type": "dict", "Heading": "Mens Club", "Answer": "Six hundred. We know that 5%, or 30 of the men are wearing one earring. Of the other 95%, or 570, we know that half are wearing two earrings and the other half none. This is the same as if they all wore one.", "id": 1131}, {"Category": "Math Riddles", "Riddle": "Janie's friends were chipping in to buy her a wedding shower present. At first, 10 friends chipped in, but 2 of them dropped out. Each of the 8 had to chip in another dollar to bring the amount back up. How much money did they plan to collect?", "_type": "dict", "Heading": "Wedding Shower Present", "Answer": "$40 (10 at $4, or 8 at $5).", "id": 1132}, {"Category": "Math Riddles", "Riddle": "Eight years ago, Bill was eight times the age of his son Bill Jr. Today, if you add their ages together, they add up to 52. How old are Bill and his son?", "_type": "dict", "Heading": "Bill And Bill Jr.", "Answer": "Bill is 40, and Bill Jr. is 12.", "id": 1133}, {"Category": "Math Riddles", "Riddle": "I am a place, in a state. I am an answer to a math problem. The math problem is: To get a cube, you multiply something by 6. What do you multiply by?", "_type": "dict", "Heading": "3D Problem", "Answer": "You Times Square!", "id": 1134}, {"Category": "Math Riddles", "Riddle": "One fourth of the population of a newly discovered planet have 4 legs. The rest have two legs. There are 60 legs total. How big is the population of the newly discovered planet?", "_type": "dict", "Heading": "How Many Are There Math Riddle", "Answer": "24.", "id": 1135}, {"Category": "Math Riddles", "Riddle": "Three matches are sitting on a table. Without adding another make for three matches four. You are not allowed to break any of the matches.", "_type": "dict", "Heading": "Four Out Of Three", "Answer": "Shape the 3 matches into a romanumeral four.", "id": 1276}, {"Category": "Math Riddles", "Riddle": "A nonstop train leaves Moscow for Leningrad at 60 mph. Another nonstop train leaves Leningrad for Moscow at 40 mph. How far apart are the trains 1 hour before they pass each other?", "_type": "dict", "Heading": "Two Trains", "Answer": "100 miles (60+40)", "id": 1277}, {"Category": "Math Riddles", "Riddle": "A 300 ft. train is traveling 300 ft. per minute must travel through a 300 ft. long tunnel.  How long will it take the train to travel through the tunnel?", "_type": "dict", "Heading": "Train Math Riddle", "Answer": "Two minutes. It takes the front of the train one minute and the rest of the train will take two minutes to clear the tunnel.", "id": 1278}, {"Category": "Math Riddles", "Riddle": "There is a creature which could double its size every day. So, if the creature is put in a tank then it will fill the tank in 10 days.\n\r\n\nHow many days would it take for the creature to fill 1/2 and 1/4 of the tank?", "_type": "dict", "Heading": "Growing Creature", "Answer": "9 days to fill 1/2 and 8 days to fill 1/4 of the tank.  If the creature fills the tank in 10 days and it doubles every day, on the ninth day it would fill 1/2 the tank. Thus on the 8th day it will fill 1/4 of tank.", "id": 1279}, {"Category": "Math Riddles", "Riddle": "How can you measure nine minutes with have two hourglasses, one four minute and one seven minute?", "_type": "dict", "Heading": "How Do You Measure Nine Minutes With Two Hourglasses?", "Answer": "Turn over both hourglasses at once. When the four-minute hourglass runs out, turn it over. When the seven-minute hourglass runs out, turn it over. When the four-minute timer runs out this time (eight minutes have elapsed), the seven-minute hourglass has been running for one minute. Now turn over the seven minute timer back over. When the timer runs out, nine minutes have elapsed.", "id": 1280}, {"Category": "Math Riddles", "Riddle": "If two's company and three's a crowd, what are four and five?", "_type": "dict", "Heading": "Two's A Company", "Answer": "Four and five is nine.", "id": 1281}, {"Category": "Math Riddles", "Riddle": "Tara has $29.00 dollars. She bought 4 coloring books that cost $3.00 each, 4 boxes of crayola crayons that cost $2.00 each. She spend the rest of her money on markers.\n\r\n\nHow much money did she spend on markers", "_type": "dict", "Heading": "How  Many  Dollars Does Tara Has", "Answer": "$9.00 on markers", "id": 1282}, {"Category": "Math Riddles", "Riddle": "Place three matches on a table. Tell a friend to add two more matches to make eight.", "_type": "dict", "Heading": "Three And Two Is Eight", "Answer": "Add two matches to make a roman numeral eight.", "id": 1283}, {"Category": "Math Riddles", "Riddle": "Tom volunteered to be the chief organizer for the world's tether ball championships. There were 657 contestants from around the world. The tournament was set up whereby the winner would advance and the loser would be eliminated. Since there was an odd number of participants, the initial pairing leaves one player out. That player gets a bye and automatically advances to the next round. How many matches will Tom have to schedule to determine the tether ball champion?", "_type": "dict", "Heading": "Hard Job", "Answer": "656 matches will be needed.", "id": 1284}, {"Category": "Math Riddles", "Riddle": "A frog fell into a well 12 feet deep. He could jump 3 feet, but every time he jumped 3 feet, he fell back 2 feet. How many times did he have to jump to get out of the well?", "_type": "dict", "Heading": "The Frog And The Well", "Answer": "The tenth jump took him out. (On the tenth jump he reached 13 feet and was out.)", "id": 1285}, {"Category": "Math Riddles", "Riddle": "A hundred stones are placed, in a straight line, a yard distant from each other. How many yards must a person walk, who undertakes to pick them up, and place them in a basket stationed one yard from the first stone?", "_type": "dict", "Heading": "A Hundred Stones", "Answer": "In solving this question it is clear that to pick up the first stone and put it into the basket, the person must walk two yards, one in going for the stone and another in returning with it; that for the second stone he must walk four yards, and so on increasing by two as far as the hundredth, when he must walk two hundred yards, so that the sum total will be the product of 202 multiplied by 50, or 10,100 yards. If any one does not see why we multiply 202 by 50 in getting the answer, we refer him to his arithmetic.", "id": 1426}, {"Category": "Math Riddles", "Riddle": "You have 14 brown socks, 14 blue socks and 14 black socks in your sock drawer. How many socks must you remove (without looking to be sure) to have a matched pair?", "_type": "dict", "Heading": "Darn Socks", "Answer": "Four. You will have a pair of one color or another.", "id": 1427}, {"Category": "Math Riddles", "Riddle": "A certain number has three digits. The sum of the three digits equals 36 times this number. Seven times the left digit plus 9 is equal to 5 times the sum of the two other digits. 8 times the second digit minus 9 is equal to the sum of the first and third.\n\r\n\nWhat is the number?", "_type": "dict", "Heading": "What's The Number?", "Answer": "This one is fairly easy - 324 is the answer.", "id": 1428}, {"Category": "Math Riddles", "Riddle": "David is throwing Robert a surprise birthday party but he has to stay within his budget. He spent half of his money plus $2.00 on the cake. Half of what he had left plus $2.00 was spent on balloons and streamers. Then he spent half of what he had left plus $1.00 on candy. Now he is out of money, how much did he start with?", "_type": "dict", "Heading": "Surprise Party", "Answer": "This one is best solved working backwards, the last part David spent half of what was left plus $1.00 on candy and then was out of money. That means he must have spent $2.00 on Candy as $1.00 was half of what he had using the same logic backwards: $2.00 on candy $6.00 on Balloons and Streamers $12.00 on the cake Total of $20.00.", "id": 1429}, {"Category": "Math Riddles", "Riddle": "What is significant about 3661 seconds past midnight on 1st January 2001?", "_type": "dict", "Heading": "Date Significance", "Answer": "The time and date will be 01:01:01 on 01/01/01.", "id": 1430}, {"Category": "Math Riddles", "Riddle": "What is the 4 digit number in which the first digit is one-fifth of the last, and the second and third digits are the last digit multiplied by 3?", "_type": "dict", "Heading": "The 4 Digit Number", "Answer": "1155.", "id": 1431}, {"Category": "Math Riddles", "Riddle": "Two hours ago it was as long after one o'clock in the afternoon as it was before one o'clock in the morning. What time is it now?", "_type": "dict", "Heading": "What Time Is It?", "Answer": "It would be 9:00 pm. There are 12 hours between 1:00 pm and 1:00 am and half of that is six hours. Half-way between would be 7 o'clock. Two hours later it would be 9:00 o'clock.", "id": 1432}, {"Category": "Math Riddles", "Riddle": "Why are 1999 ten pound notes worth more than 1993 ten pound notes?", "_type": "dict", "Heading": "Ten-Pound Notes", "Answer": "Because there are more of them!", "id": 1433}, {"Category": "Math Riddles", "Riddle": "If place 1 cake of soap on a pan of a scale and 3/4 cake of soap and a 3/4-pound weight on the other, the pans balance.\n\r\n\nHow much does a cake of soap weigh?", "_type": "dict", "Heading": "A Cake Of Soap", "Answer": "Since 1/4 cake weighs 3/4 pound, and entire cake weighs 3 pounds.", "id": 1434}, {"Category": "Math Riddles", "Riddle": "When completed in 1889 the Eiffel Tower was something of a sensation. Designed by the French engineer Alexandre-Gustave Eiffel its height is 492 feet plus half its own height.\n\r\n\nHow high is the eiffel tower?", "_type": "dict", "Heading": "Eiffel Tower Brain Teaser", "Answer": "984 feet.", "id": 1435}, {"Category": "Math Riddles", "Riddle": "If 10 bags of jelly beans and 6 licorice sticks cost $1, and 10 licorice sticks and 6 jelly bean bags cost 92 cents.\n\r\n\nHow much does one licorice stick cost?", "_type": "dict", "Heading": "Jelly Beans And Licorice Sticks", "Answer": "5 cents. Jelly bean bags cost 7 cents.", "id": 1576}, {"Category": "Math Riddles", "Riddle": "A woman went into a bank to cash an insurance refund check. By mistake the teller gave her dollars for cents and cents for dollars. She put the money in her purse but accidentally dropped a nickel on the floor. When she got home, she found that she had exactly twice the amount of the check she had cashed. She didn't have any money in her wallet before going to the bank. What was the exact amount of that check?", "_type": "dict", "Heading": "Refund Check", "Answer": "The amount must have been $31.63. She received $63.31. After she dropped a nickel there would remain the sum of $63.26, which is twice the amount of the check.", "id": 1577}, {"Category": "Math Riddles", "Riddle": "Farmer Brown came to town with some watermelons. He sold half of them plus half a melon, and found that he had one whole melon left. How many melons did he take to town?", "_type": "dict", "Heading": "Melon Math Riddle", "Answer": "Three melons!", "id": 1578}, {"Category": "Math Riddles", "Riddle": "Joe has ten coins totaling $1.19. From these coins, he cannot make exact change for a dollar, half-dollar, quarter, dime, or nickel.\n\r\n\nWhat are the coins?", "_type": "dict", "Heading": "Wha Are The Coins?", "Answer": "A half-dollar, a quarter, four dimes, and four pennies.", "id": 1579}, {"Category": "Math Riddles", "Riddle": "Walking home one day, you take a short cut along the train tracks. The tracks cross a narrow bridge over a deep gorge. At the point you are 3/8 of the way across the bridge, you hear the train whistle somewhere behind you. You charge across the bridge, and jump off the track as the train is about to run you down. As it happens, if you had gone the other way, you would have reached safety just before being run over as well. If you can run ten miles per hour, how fast is the train moving?", "_type": "dict", "Heading": "Cut Along The Tracks", "Answer": "The train is moving at 40 miles per hour. Imagine that a friend is walking with you. When the train whistle blows, you head away from the train, he heads toward it. When he reaches safety, you will be 6/8 (or 3/4)of the way across the bridge, and the train will have just reached the bridge. For the train to cross 4/4 of the bridge in the time you cross the remaining 1/4, the train must be moving four times your speed.", "id": 1580}, {"Category": "Math Riddles", "Riddle": "A half is a third of it. What is it?", "_type": "dict", "Heading": "One Half Is One Third", "Answer": "1 1/2.", "id": 1581}, {"Category": "Math Riddles", "Riddle": "Twelve flags stand equidistant along the track at the stadium. The runners start at the first flag. A runner reaches the eighth flag 8 seconds after he starts. If he runs at an even speed, how many seconds does he need altogether to reach the twelfth flag?", "_type": "dict", "Heading": "At The Stadium", "Answer": "Not 12 seconds. There are 7 segments from the first flag tot the eighth, and 11 from the first to the twelfth. He runs each segment in 8/7 seconds; therefore, 11 segments take 88/7= 12 4/7 seconds.", "id": 1582}, {"Category": "Math Riddles", "Riddle": "A boy has as many sisters as brothers, but each sister has only half as many sisters as brothers.\n\r\n\nHow many brothers and sisters are there in the family?", "_type": "dict", "Heading": "How Many?", "Answer": "Four brothers and three sisters.", "id": 1583}, {"Category": "Math Riddles", "Riddle": "How many pluses should we put between the digits of 987,654,321 to get a total of 99, and where?", "_type": "dict", "Heading": "Add Plus Signs", "Answer": "(6) 9 + 8 + 7 + 6 + 5 + 43 + 21= 99\n\r\n\n(7) 9 + 8 + 7 + 65 + 4 + 3 + 2 + 1= 99", "id": 1584}, {"Category": "Math Riddles", "Riddle": "My only timepiece is a wall clock. One day I forgot to wind it and it stopped. I went to visit a friend whos watch is always correct, stayed awhile, and then went home. There I made a simple calculation and set the clock right.\n\r\n\nHow did I do this even though I had no watch on me to tell how long it took me to return from my friend's house?", "_type": "dict", "Heading": "The Stopped Clock", "Answer": "Before I left, I wound the wall clock. When I returned, the change in time equaled how long it took to go to my friends house and return, plus the time I spent there. But I knew the latter because I looked at my friends watch when I arrived and left.\n\r\n\nSubtracting the time of the visit from the time I was absent from my house, and dividing by 2, I obtained the time it took me to return home. I added this time to what my friend watch showed when I left, and set the sum on my wall clock.", "id": 1585}, {"Category": "Math Riddles", "Riddle": "If a stopper and a bottle cost $2.10 and the bottle costs $2.00 more than the stopper.\n\r\n\nThen what does the stopper cost?", "_type": "dict", "Heading": "Cost Of The Stopper", "Answer": "Five Cents.", "id": 1726}, {"Category": "Math Riddles", "Riddle": "Given two 2s, \"plus\" can be changed to \"times\" without changing the results: 2 + 2= 2 x 2.\n\r\n\nThe solution with three numbers is easy too: 1 + 2 + 3= 1 x 2 x 3.\n\r\n\nNow find the answer for 4 numbers and for 5 numbers.", "_type": "dict", "Heading": "Same Result", "Answer": "Solution for 4 numbers:\n\r\n\n1 + 1 + 2 + 4= 1 x 1 x 2 x 4.\n\r\n\nSolution for 5 numbers:\n\r\n\n1 + 1 + 1 + 2 + 5= 1 x 1 x 1 x 2 x 4 \n\r\n\n1 + 1 + 1 + 3 + 3= 1 x 1 x 1 x 2 x 4\n\r\n\n1 + 1 +2 + 2 + 2= 1 x 1 x 2 x 2 x 2", "id": 1727}, {"Category": "Math Riddles", "Riddle": "Lazy Larry agreed to work on a job for his brother-in-law for thirty hours at eight dollars an hour, on the condition that he would forfeit ten dollars per hour for every hour that he idled. At the end of the thirty hours Larry wasn't owed any money and didn't owe his brother-in-law any money either. How many hours did Larry work and how many hours did he idle?", "_type": "dict", "Heading": "Lazy Larry", "Answer": "Lazy Larry worked 16-2/3 hours and idled 13-1/3 hours. 16-2/3 hours, at $8.00 an hour amounts to the same amount as 13-1/3 hours at $10.00 per hour.", "id": 1728}, {"Category": "Math Riddles", "Riddle": "An officer wishing to arrange his men in a solid square found by his first arrangement that he had 39 men left over. He then started increasing the number of men on a side by one, but found that 50 additional men would be needed to complete a new square.\n\r\n\nHow many men did the officer have?", "_type": "dict", "Heading": "Solution To Solid Square", "Answer": "The officer had 1975 men. When he formed a square measuring 44 by 44, he had 39 men over. When he tried to form a square 45 x 45, he was 50 men short.", "id": 1729}, {"Category": "Math Riddles", "Riddle": "This number added to it's square, and the digits of that summation added together, bring it back to itself. What is it?", "_type": "dict", "Heading": "Summation", "Answer": "3. 3 squared is 9. 3+9=12. Take the two digits of the summation and add them; 1+2=3. In short; 3-9-12-3. This can also work with the number 0 and 9.", "id": 1730}, {"Category": "Math Riddles", "Riddle": "There are 4 borthers 3 of them want to buy a television which is 30 pounds. Each of them pay 10 pound each they give the money to the fourth brother and asked him to go into town and buy the television. When he got there the man said there was 5 pounds off so the fourth brother took the 5 pound and television and left. He decided to make some money out of this so he took 2 pounds and give the other 3 pounds to his brothers. So the 3 brothers only payed 9 pounds each. 3 times 9 is 27 were is the last pound?", "_type": "dict", "Heading": "Where Did The Pund Go?", "Answer": "Add 3 on to 25 = 28 then add 2", "id": 1731}, {"Category": "Math Riddles", "Riddle": "A house has 6 stories, each the same height. How many times as long is the ascent to the sixth floor as the ascent to the third?", "_type": "dict", "Heading": "Stairs", "Answer": "2 1/2 times (5/2, not 6/3).", "id": 1732}, {"Category": "Math Riddles", "Riddle": "A man had a bar of lead that weighed 40 lbs., and he divided it into four pieces in such a way as to allow him to weigh any number of pounds from one to forty. What are the weights of the four pieces?", "_type": "dict", "Heading": "Divide Into Four Pieces", "Answer": "1, 3, 9, 27, are the weights of the four pieces.", "id": 1733}, {"Category": "Math Riddles", "Riddle": "Mr. Grumper grumbles about bad time-keeping trains like everybody else. On one particular morning he was justified, though. The train left on time for the one hour journey and it arrived 5 minutes late. However, Mr. Grumper's watch showed it to be 3 minutes early, so he adjusted his watch by putting it forward 3 minutes. His watch kept time during the day, and on the return journey in the evening the train started on time, according to his watch, and arrived on time, according to the station clock. If the train traveled 25 percent faster on the return journey than it did on the morning journey, was the station clock fast or slow, and by how much?", "_type": "dict", "Heading": "Train Journey", "Answer": "The station clock is 3 minutes fast. The morning journey took 65 minutes, and the evening journey therefore took 52 minutes, and the train arrived 57 minutes after it should have left, that is, 3 minutes early.", "id": 1734}, {"Category": "Math Riddles", "Riddle": "Two wine merchants arrive at the gates of Paris. One has 64 and the other 20 barrels of wine. Since they have not enough money to pay the custom duties, the first pays 40 francs and 5 barrels of wine. The second pays 2 barrels of wine but receives 40 francs in change.\n\r\n\nWhat is the value of each barrel of wine and what is the duty payable?", "_type": "dict", "Heading": "Customs", "Answer": "The value of a barrel is 120 francs and the duty is 10 francs a barrel.", "id": 1735}, {"Category": "Math Riddles", "Riddle": "A bird has a head 9cm long. The tail is equal to the size of the head plus a half of the size of the body. The body is the size of the head plus the tail.\n\r\n\nHow long is the bird?", "_type": "dict", "Heading": "Big Bird", "Answer": "72cm. Th head is 9cm. The tail is 18 + 9= 27cm. The body is 9 + 18 + 9= 36cm. 9 + 27 + 36= 72cm.", "id": 1854}, {"Category": "Math Riddles", "Riddle": "'How much is this bag of potatoes?' asked the man. '32lb divided by half its own weight,' said the green grocer.\n\r\n\nHow much did the potatoes weigh?", "_type": "dict", "Heading": "Bag Of Potatoes", "Answer": "8lbs.", "id": 1855}, {"Category": "Math Riddles", "Riddle": "If 6 doubloons are worth 1 1/2 ducats, how many ducats are 27 doubloons worth?", "_type": "dict", "Heading": "Ducats And Doubloons", "Answer": "6 3/4 ducats (27/6=4 1/2. 4 1/2 x 1 1/2= 6 3/4)", "id": 1856}, {"Category": "Math Riddles", "Riddle": "Insert the numbers 1-9 inclusive each only, into the claculation to arrive at the answer 100.\n\r\n\n(  -  )  +  +  -  -  -  =  100", "_type": "dict", "Heading": "Century Puzzle", "Answer": "( 7 - 5 )²  + 96 + 8 - 4 - 3 - 1 = 100", "id": 1857}, {"Category": "Math Riddles", "Riddle": "It takes the town hall clock 6 seconds to strike 4 o'clock in the afternoon. How long does it take to strike midnight?", "_type": "dict", "Heading": "Striking Clock", "Answer": "22 Seconds.", "id": 1858}, {"Category": "Math Riddles", "Riddle": "Out of 100 ladies attending the gala,\n85 had a white hand bag;\n75 had black shoes;\n60 carried an umbrella;\n90 wore a ring;\n\r\n\nHow many ladies must have had all four items?", "_type": "dict", "Heading": "The Ladies Of The Gala, ", "Answer": "10\n\r\n\nDivide by 3. All the ladies had three items. The remainder shows the number of ladies who had 4.\n\r\n\n85\n75\n60\n90\n______\n310 / 3 = 100 + 10 remainder", "id": 1859}, {"Category": "Math Riddles", "Riddle": "My age today is three times what it will be three years from now minus three times what my age was three years ago. How old am I?", "_type": "dict", "Heading": "What's Your Age?", "Answer": "Don't be too confused, the answer is 18 years old.", "id": 1860}, {"Category": "Math Riddles", "Riddle": "A man has nine children, born at regular intervals. The sum of their squares of their ages is equal to the square of his own age.\n\r\n\nWhat are  the ages of the children?", "_type": "dict", "Heading": "Children Squared", "Answer": "2  -  5  -  8  -  11  -  14  -  17  -  20  -  23  -  26", "id": 1861}, {"Category": "Math Riddles", "Riddle": "Mr. and Mrs. Smith were walking home from the shopping mall with their purchases when Mr. Smith began to complain that his load was too heavy. Mrs. Smith turned to her husband and said, \"I don't know what you're complaining about because if you gave me one of your parcels, I would have twice as many as you and if I gave you just one of mine, we would have equal loads.\" How many parcels was each carrying?", "_type": "dict", "Heading": "Heavy Load", "Answer": "Mrs. Smith was carrying seven parcels and Mr. Smith was carrying five.", "id": 1862}, {"Category": "Math Riddles", "Riddle": "A man bumps into his mathematician friend on the street that he hasn't seen in 5 years. The man asks the mathematician how old his children are. The mathematician, who always replies in riddles said, \"I now have three children. The sum of their ages is equal to the number of windows on the building in front of you and the product of their ages equals 36.\" The friend then says \"I need one more piece of information.\" The mathematician then replies \"My youngest child has blue eyes.\" What are the ages of the mathematicians three children?", "_type": "dict", "Heading": "Speaking In Riddles", "Answer": "They are 6, 6, and 1.", "id": 1863}, {"Category": "Math Riddles", "Riddle": "How many sides does a snowflake have?", "_type": "dict", "Heading": "Flakey Side Teaser", "Answer": "6.", "id": 1964}, {"Category": "Math Riddles", "Riddle": "Edward is as old as Benjamin used to be when Edward was as old as Benjamn is now.\n\r\n\nBenjamin is 36. How old is Edward?", "_type": "dict", "Heading": "Edward And Benjamin Brain Teaser", "Answer": "Edward is 48.", "id": 1965}, {"Category": "Math Riddles", "Riddle": "Jack had only $2, but he needed $3 for his cab fare home. He went to a pawn shop and pawned his $2 for $1.50. Jack then bumped into Don and told him that he would sell him his $2 pawn ticket for $1.50. Don agreed. Jack started out with $2 and he ended up with $3. Who is out the extra dollar and why?", "_type": "dict", "Heading": "Pawn Shop Ponzi Scheme", "Answer": "Don is out the extra dollar. Before the pawn broker will return the $2 to the ticket holder, he will want the $1.50 which he advanced returned to him. Don will give the pawn broker the ticket and the $1.50, and the pawn broker will then return the $2.", "id": 1966}, {"Category": "Math Riddles", "Riddle": "When I asked her how old she was, she smiled and said cryptically: \"The day before yesterday I was 22, but next year I'll be 25.\" What is her birthday and when was the date of our conversation?", "_type": "dict", "Heading": "How Old Are You?", "Answer": "We conversed on January 1 and her birthday was on December 31. So, the day before yesterday on Dec. 30th she was 22 and he turned 23 on Dec. 31. So her next birthday, when she turns 24, would be Dec. 31 of the same year the question was asked.  However, next years birthday would be the following year on Dec. 31, when she would be 25.", "id": 1967}, {"Category": "Math Riddles", "Riddle": "A girl is twice as old as her brother and half as old as her father. In 50 years, her brother will be half as old as his father. How old is the daughter now?", "_type": "dict", "Heading": "How Old Am I", "Answer": "50 years old.", "id": 1968}, {"Category": "Math Riddles", "Riddle": "A large truck is crossing a bridge 1 mile long. The bridge can only hold 14000 lbs, which is the exact weight of the truck. The truck makes it half way across the bridge and stops. A bird lands on the truck. Does the bridge collapse?", "_type": "dict", "Heading": "A Large Truck", "Answer": "No, it does not collapse. Because it has driven a half mile - you would subtract the gas used from the total weight of the truck.", "id": 1969}, {"Category": "Math Riddles", "Riddle": "Charlotte is 13 years old. Her father Montague is 40 years old. How many years ago was Charlotte's father four times as old as Charlotte?", "_type": "dict", "Heading": "Charlotte Match Teaser", "Answer": "Four years ago. When Charlotte was 9 her father was 36, 4 times her age.", "id": 1970}, {"Category": "Math Riddles", "Riddle": "A rubber ball is tossed off the top of a 90 foot building. Every time it bounces, it goes back up half way. How many bounces will the ball take before it stops?", "_type": "dict", "Heading": "A Rubber Ball", "Answer": "The answer is infinite, in a gravity free world. But of course gravity will eventually stop it.", "id": 1971}, {"Category": "Math Riddles", "Riddle": "Find four numbers, the sum of which is 45, so that if 2 is added to the first number, 2 is subtracted from the second number, the third number is multiplied by 2 and the fourth number is divided by 2, then the four numbers so produced are all the same. What are the four numbers?", "_type": "dict", "Heading": "Forty-Five", "Answer": "8 + 2 = 10\n\r\n\n12 - 2 = 10\n\r\n\n  5 x 2 = 10\n\r\n\n20 ÷ 2 = 10\n45", "id": 1972}, {"Category": "Math Riddles", "Riddle": "If you toss a die and it comes up with the number one 9 times in a row, what is the probability that it will come up with one on the next throw?", "_type": "dict", "Heading": "Lucky Die IQ Test", "Answer": "One in six. A die has no memory of what it last showed.", "id": 1973}, {"Category": "Math Riddles", "Riddle": "'When Gwen is twice as old as Dean, Then I shall be just 17. But Gwendoline was 23 When Dean was twice as old as me.' Thats what Bill said.\n\r\n\nSo tell us then, How old he was when Dean was ten?", "_type": "dict", "Heading": "Ages!", "Answer": "Eight.", "id": 2065}, {"Category": "Math Riddles", "Riddle": "What single-digit number should go in the box with the question?\n\r\n\n\r\n\n\r\n\n\r\n\n6\n\r\n\n5\n\r\n\n9\n\r\n\n2\n\r\n\n7\n\r\n\n\r\n\n\r\n\n1\n\r\n\n4\n\r\n\n3\n\r\n\n5\n\r\n\n?\n\r\n\n\r\n\n\r\n\n8\n\r\n\n0\n\r\n\n2\n\r\n\n8\n\r\n\n1", "_type": "dict", "Heading": "Math Puzzle", "Answer": "The missing number is 4.  Simply add the first and second rows together to get the third row value.\n\r\n\n\r\n\n\r\n\n\r\n\n \n\r\n\n65, 927\n\r\n\n\r\n\n\r\n\n+\n\r\n\n14, 354\n\r\n\n\r\n\n\r\n\n \n\r\n\n80, 281", "id": 2066}, {"Category": "Math Riddles", "Riddle": "What is the value of 1/2 of 2/3 of 3/4 of 4/5 of 5/6 of 6/7 of 7/8 of 8/9 of 9/10 of 1,000?", "_type": "dict", "Heading": "Fraction Teaser", "Answer": "One hundred - work backwards and you will understand.", "id": 2067}, {"Category": "Math Riddles", "Riddle": "How many times does the long hand of the clock pass the short hand between midnight one day and midnight the following day? As both hands are together at the starting time of midnight this does not count as a pass.", "_type": "dict", "Heading": "The Hands Of The Clock", "Answer": "21.", "id": 2068}, {"Category": "Math Riddles", "Riddle": "How can you give someone $63 using six bills, without using any one dollar bills?", "_type": "dict", "Heading": "Don't Use Any Ones", "Answer": "1 - $50 bill, 1 - $5 bill , 4 - $2 bills", "id": 2069}, {"Category": "Math Riddles", "Riddle": "If seven cats kill seven rats in 7 minutes, how many would be needed to kill one hundred rats in 50 minutes?", "_type": "dict", "Heading": "Ahhh Rats", "Answer": "14.", "id": 2070}, {"Category": "Math Riddles", "Riddle": "A box of hardware contains nuts and bolts.  The bolts account for 25 percent of the number of items in the box.  What percentage are the bolts of the entire box.", "_type": "dict", "Heading": "Nuts And Bolts Riddle", "Answer": "20 percent. For example, there are 10 bolts.  Since the number of bolts is 25 percent of the number of items, there must be 40 nuts. The total number of items = 10 bolts + 40 nuts = 50.  So, 10/50 = 1/5 = 20%.", "id": 2071}, {"Category": "Math Riddles", "Riddle": "A book costs $1 plus half its price. How much does it cost?", "_type": "dict", "Heading": "Price Of A Book", "Answer": "$2", "id": 2072}, {"Category": "Math Riddles", "Riddle": "Three pirates, One Eye, Long John, and Peg Leg, were gambling with pieces of gold. All the winnings were piled up on the table.  One Eye said, 'I have won 1/2' and took a large handful or two. Long John said, 'I have won 1/3' and took a handful. Peg Leg said, ' I have won 1/6' and took a small handful.  One Eye said, ' I have taken too much' and returned a half. Long John said, 'I have taken too much' and returned a third. Peg Leg said, 'I have taken too much and returned a sixth.  The money on the table was then shared out equally and they had 42 pieces each.  One Eye said, 'I have now 1/2 of the total originally.' Long John said, ' I now have 1/3 of the originally.'  Peg Leg said, 'I have now 1/6 of the originally.'\n\r\n\nHow much was on the table originally?", "_type": "dict", "Heading": "Pirates", "Answer": "282 Pieces.", "id": 2073}, {"Category": "Math Riddles", "Riddle": "Two cyclists began a training run, one starting from Moscow and the other starting from Simferopol.\n\r\n\nWhen the riders were 180 miles apart, a fly took an interest. Starting on one cyclists shoulder, the fly flew ahead to meet the other cyclist. After reaching him the fly then turned around and yet back. \n\r\n\nThe restless fly continued to shuttleback and fourth until the pair met; then settled on the nose of one rider.\n\r\n\nThe flys speed was 30 mph. Each cyclist speed was 15 mph.\n\r\n\nHow many miles did the fly travel?", "_type": "dict", "Heading": "The Restless Fly", "Answer": "The cyclists took 6 hours to meet. The fly traveled 6*30=180 miles.", "id": 2074}, {"Category": "Math Riddles", "Riddle": "Express 100 with 5 1s. Express 100 three ways with five 5s. You can use brackets, parentheses and these signs +,-,X, /", "_type": "dict", "Heading": "One Hundred", "Answer": "111-11=100\n\r\n\n(5 x 5 x 5)-(5 x 5)=100; (5+5+5+5)x 5=100;(5 x 5)(5-(5/5)=100.", "id": 2148}, {"Category": "Math Riddles", "Riddle": "A woman is walking down a street night at a constant pace.  As she passes the street light, she notices that her shadow becomes longer.  Does the top of her shadow move faster, slower or the same when the shadow is longer as when it is shorter?", "_type": "dict", "Heading": "Shadow Riddle", "Answer": "This point maintains a constant speed, independent of the lenght of the shadow.", "id": 2149}, {"Category": "Math Riddles", "Riddle": "The title of the problem tells you how to approach these four questions.\n\r\n\n(A).  A bus leaves Moscow for Tula at noon. An hour later a cyclist leaves Tula for mosco, moving slower than the bus. When the bus and cyclist meet, which one of the two will be farther from Moscow?\n\r\n\n(B). Which is worth more: a pound of $10 gold peices or half a pound of $20 gold pieces?\n\r\n\n(C). At six o'clock the wall clock struck 6 times. Checking with my watch, I noticed the time between the first and last strokes was 30 seconds. How long will the clock take to strike 12 at midnight?\n\r\n\n(D). Three swallows fly outward from a point. When will they all be on the same plane in space?\n\r\n\nNow check the answers. Did you fall into any of the traps which lurk in these simple problems?", "_type": "dict", "Heading": "Speedily Yet Cautiously ", "Answer": "(A). Neither\n\r\n\n(B). A pound of metal is always more than half a pound of the same metal.\n\r\n\n(C). Six strokes took 30 seconds, therefore 12 strokes will take 60 seconds. But when the clock struck six, there were only 5 intervals between strokes, and each interval was 30/5=6 seconds. Between the first and twelfth strokes there will be 11 intervals of 6 seconds each, therefore 12 strokes will take 66 seconds.\n\r\n\n(D). There is always a plane that contains any 3 points", "id": 2150}, {"Category": "Math Riddles", "Riddle": "(A) Use two digits to make the smallest possible positve intiger.\n\r\n\n(B) Five 3s can express 37:  37=33+3+3/3\n\r\n\nFind another way to do it.\n\r\n\n(C) Use six identical dgits to make 100. (Several solutions are possible.)\n\r\n\n(D) Use five 4s to make 55.\n\r\n\n(E) Use four 9s to make 20.", "_type": "dict", "Heading": "Arithmetical Nuts To Crack", "Answer": "(A) 1 X 1; 1/1;2/2;ect....;1-0;2-1;and many others.\n\r\n\n(B) 37=333/3X3; 37=3 X 3 X 3 + 3/.3\n\r\n\n(C) 99 + 99/99; 55+55- 5- 5; (666-66)/6\n\r\n\n(D) 44 + 44/4=55.\n\r\n\n(E) 9 + 99/9=20.", "id": 2151}, {"Category": "Math Riddles", "Riddle": "As I traveled up and down our great glorious country, I found myself in a place where the tempature goes up sharply in the day and down at night. This had an effect on my watch, I noticed it was 1/2 a minute faster at nightfall, but at dawn it had lost 1/3 minute, making it only 1/6 minute fast.\n\r\n\nOne morning- May 1- my watch showed the right time. By what date was it 5 minutes faster?", "_type": "dict", "Heading": "My Watch", "Answer": "In 24 hours the watch gained 1/2-1/3= 1/6 minute. It would seem it would be 5 minutes fast in 5 X 6= 30 days; that is,the morning of May 31. But already on the morning of May 28 the was 27/6= 4 1/2 minutes fast. At the close of the day the watch gained 1/2 minute more, so it was 5 minutes fast on may 28.", "id": 2152}, {"Category": "Math Riddles", "Riddle": "An alarm clock runs 4 minutes slow every hour. It was set right 3 1/2 hours ago. Now another clock which is correct shows noon. \n\r\n\nIn how many minutes, to the nearest minutes, to the nearest minute, will the alarm clock show noon?", "_type": "dict", "Heading": "The Alarm Clock", "Answer": "In 3 1/2 hours the alarm clock has become 14 minutes slow. At noon the alarm clock will fall behind approximently an additional minute. Its hands will show noon in 15 minutes.", "id": 2153}, {"Category": "Math Riddles", "Riddle": "You go to the doctor because you're ill and he prescribes you with 3 pills and tells you to take them every half hour.\n\r\n\nHow long do the pills last you?", "_type": "dict", "Heading": "Doctor", "Answer": "An hour because the first pill doesn't take 30 min. to take.", "id": 2154}, {"Category": "Math Riddles", "Riddle": "You have accidently left out the plug and are attempting to fill the bath with both taps full on. The hot tap takes 6 minutes to fill the bath. The cold tap takes 2 minutes and the water empties through the plug hole in 4 minutes.\n\r\n\nIn how many minutes will the bath be filled?", "_type": "dict", "Heading": "Filling A Bath", "Answer": "2 minutes and 24 seconds.", "id": 2155}, {"Category": "Math Riddles", "Riddle": "A hunter met two shepherds, one of whom had three loaves and the other, five loaves. All the loaves were the same size. The three men agreed to share the eight loaves equally between them. After they had eaten, the hunter gave the shepherds eight bronze coins as payment for his meal. How should the two shepherds fairly divide this money?", "_type": "dict", "Heading": "Two Shepherds", "Answer": "The shepherd who had three loaves should get one coin and the shepherd who had five loaves should get seven coins. If there were eight loaves and three men, each man ate two and two-thirds loaves. So the first shepherd gave the hunter one-third of a loaf and the second shepherd gave the hunter two and one-third loaves. The shepherd who gave one-third of a loaf should get one coin and the one who gave seven-thirds of a loaf should get seven coins.", "id": 2156}, {"Category": "Math Riddles", "Riddle": "What number squared = 12345678987654321?", "_type": "dict", "Heading": "Ben's Riddle Game", "Answer": "111,111,111", "id": 2157}, {"Category": "Math Riddles", "Riddle": "A watchmaker was telephoned urgently to make a house call to replace the broken hands on a clock. He was sik so he sent his apprentice.\n\r\n\nThe apprentice was thorough. When he finished inspecting the clock it was dark. Assuming his work was done, he attached the new hands and set the clock by his pocket watch. It was sic o'clock, so he set the big hand at the 12 and the little hand at the 6.\n\r\n\nThe apprectice returned, but soon the telephone rang. He picked up to his angry client:\n\r\n\n\"You didn't do the job right. The clock shows the wrong time.\"\n\r\n\nSurprised he hurried back. He found the clock showing not much past eight. He handed is watch to the client and showed her that her clock was not even one second late. The client had to agree.\n\r\n\nEarly the nect morning, the client telephoned to say the clock has apparently gone berserk, hands were moving around the clock at will. The apprentice again rushed over, the clock showed a little past seven. After checking his watch he yelled:\n\r\n\n\"You are making fun of me! Your clock shows the right time!\"\n\r\n\nHave you figured out whats going on?", "_type": "dict", "Heading": "The Wondrous Clock", "Answer": "As the problem says the apprentice mixed up the hands so that the minute hand was short and the hour hand was long.\n\r\n\nThe first time the apprentice returned to the client was about 2 hours and 10 minutes after he had set the clock at six.The long had moved olny from twelve to a little past two. The little made two whole circles and an additional 10 minutes. Thus the clock showed the correct time.\n\r\n\nThe next day around 7:o5 a.m.he came a second time,13 hours and 15 minutes after he had set the clock for six. The long had, acting as the hour hand,covered 13 hours to reach 1. The short hand made 13 full circles and 5 minutes, reaching 7, So the clock showed the correct time again.", "id": 2228}, {"Category": "Math Riddles", "Riddle": "When the celebrated German mathematician Karl Friedrich Gauss (1777-1855) was nine he was asked to add all the integers from 1 through 100. He quickly added 1 to 100, 2 to 99, and so on for 50 pairs of numbers each adding to 101.\n\r\n\nAnswer: 50 X 101=5,050.\n\r\n\nNow find the sum of all the digits in integers from 1 through 1,000,000,000.\n\r\n\nThat's all the digits in all the numbers, not all the numbers themselves.", "_type": "dict", "Heading": "1 To 1,000,000,000", "Answer": "The numbers can be grouped by pairs:\n\r\n\n999,999,999 and 0;\n\r\n\n999,999,998 and 1'\n\r\n\n999,999,997 and 2;\n\r\n\nand so on....\n\r\n\nThere are half a billion pairs, and the sum of the digits in each pair is 81. The digits in the unpaired number, 1,000,000,000, add to 1. Then:\n\r\n\n(500,000,000 X 81) + 1= 40,500,000,001.", "id": 2229}, {"Category": "Math Riddles", "Riddle": "How many cats are in a small room if in each of the four corners a cat is sitting, and opposite each cat there sit three cats, and a each cat's tail another is sitting?", "_type": "dict", "Heading": "Don't Think Too Long", "Answer": "Four cats, each near a tail of a cat in an adjacent corner.", "id": 2230}, {"Category": "Math Riddles", "Riddle": "A soccer fan, upset by the defeat of his favorite team, slept restlessly. In his dream a goalkeeper was practicing in a large unfurnished room, tossing a soccer ball against the wall and then catching it.\n\r\n\nBut the goalkeeper grew smaller and smaller and then changed into a ping-pong ball while the soccer ball was swelled up into a huge cast-iron ball. The iron ball circled round madly, trying to crush the ping-pong ball, how did the ping-pong find safety whithout leaving the floor?", "_type": "dict", "Heading": "Soccer Fan's Nightmare", "Answer": "If the ping-pong ball rolls flush against the wall, the cast-iron ball cannot crush it.\n\r\n\nThose who know geometry can determine that if the diameter of a large ball is at least 5.83 (3+2(square root of 2) times as large as the diameter of a little ball, then the little ball will be safe if it hugs the wall.\n\r\n\nA cast-iron ball that is larger than a soccer ball is more than 4.83 times as large in diameter as a ping-pong ball.", "id": 2231}, {"Category": "Math Riddles", "Riddle": "Can you divide the watch face with 2 straight lines so that the sums of the sums of the numbers in each part are equal?", "_type": "dict", "Heading": "A Watch Face", "Answer": "The sum of the numbers on the watch face is 78. If the two lines cross, there must be 4 equal parts, but 78 is not divisible by 4. Then the lines do not cross, giving three parts with the sum of 26 each. Once you see the pairs on the face that add to 13(12+1,11+2, and so far) the answer will be easy to find.", "id": 2232}, {"Category": "Math Riddles", "Riddle": "0,1,2,3,4,5,6,7,8,9 \n\r\n\nUse the digits above once each only to compose two fractions which when added togeather equal 1.", "_type": "dict", "Heading": "Two Fractions", "Answer": "35/70 + 148/296 = 1", "id": 2233}, {"Category": "Math Riddles", "Riddle": "A boy presses a side of a blue pencil to a side of a yellow pencil, holding both pencils vertically. One inch of the pressed side of the blue pencil, measuring from its lower end, is smeared with paint. The yellow pencil is held steady while the boy slides the blue pencil down 1 inch, continueing to press it against the yellow one. He returns the blue pencil to its former position, then again it slides down 1 inch. He continues until he has lowered the blue pencil 5 times and raised it 5 times- 10 moves in all.\n\r\n\nSupposed that during this time the paint neither dries nor diminishes in quantity. How many inches of each pencil will be sneared with paint after the tenth move?", "_type": "dict", "Heading": "Down And Up", "Answer": "At the start, 1inch of the yellow pencil gets smeared with wet paint. As the blue pencil is moved downward, a second inch of the blue pencils smears a second inch of the yellow pencil.\n\r\n\nEach pair of down and up movesof the blue pencil smears 1 more inch of each pencil. 5 pairs of moves will smear 5 inches. This together with the initial inch, makes 6 inches for each pencil.", "id": 2234}, {"Category": "Math Riddles", "Riddle": "A mother has three sick children. She has a 24-ounce bottle of medicine and needs to give each child eight ounces of the medicine. She is unable to get to the store and has only three clean containers, which measure 5, 11 and 13 ounces. The electricity is out and she has no way of heating water to wash the containers and doesn't want to spread germs. How can she divide the medicine to give each child an equal portion without having any two children drink from the same container?", "_type": "dict", "Heading": "Bottle Of Medicine", "Answer": "Fill the 5 oz. and 11 oz. Containers from the 24 oz. container. This leaves 8 oz. in the 24 oz. bottle. Next empty the 11 oz. bottle by pouring the contents into the 13 oz. bottle. Fill the 13 oz. bottle from the 5 oz. container (with 2 oz.) and put the remaining 3 oz. in the 11 oz. bottle. This leaves the 5 oz. container empty. Now pour 5 oz. from the 13 oz. bottle into the 5 oz. bottle leaving 8 oz. in the 13 oz. bottle. Finally pour the 5 oz. bottle contents into the 11 oz. bottle giving 8 oz. in this container.", "id": 2235}, {"Category": "Math Riddles", "Riddle": "If it is 1,800 kilometers to America, 1,200 kilometers to Japan, 2,400 kilometers to New Zealand, and 1,400 kilometers to Brazil- \n\r\n\nHow far is Morocco?", "_type": "dict", "Heading": "Lets Travel ", "Answer": "The answer is 1,700 kilometers, as vowels in the countries' names are worth 300 kilometers and the consonats are worth 200 kilometers.", "id": 2236}, {"Category": "Math Riddles", "Riddle": "You are given a set of scales and 12 marbles. The scales are of the old balance variety. That is, a small dish hangs from each end of a rod that is balanced in the middle. The device enables you to conclude either that the contents of the dishes weight the same or that the dish that falls lower has heavier contents than the other. The 12 marbles appear to be identical. In fact, 11 of them are identical, and one is of a different weight. Your task is to identify the unusual marble and discard it. You are allowed to use the scales three times if you wish, but no more. Note that the unusual marble may be heavier or lighter than the others. You are asked to both identify it and determine whether it is heavy or light", "_type": "dict", "Heading": "Marbles", "Answer": "Most people seem to think that the thing to do is weight six coins against six coins, but if you think about it, this would yield you no information concerning the whereabouts of the only different coin. As we already know that one side will be heavier than the other. So that the following plan can be followed, let us number the coins from 1 to 12. For the first weighing let us put on the left pan coins 1,2,3,4 and on the right pan coins 5,6,7,8. There are two possibilities. Either they balance, or they don't. If they balance, then the different coin is in the group 9,10,11,12. So for our second weighing we would put 1,2 in the left pan and 9,10 on the right. If these balance then the different coin is either 11 or 12. Weigh coin 1 against 11. If they balance, the different coin is number 12. If they do not balance, then 11 is the different coin. If 1,2 vs 9,10 do not balance, then the different coin is either 9 or 10. Again, weigh 1 against 9. If they balance, the different coin is number 10, otherwise it is number 9. That was the easy part. What if the first weighing 1,2,3,4 vs 5,6,7,8 does not balance? Then any one of these coins could be the different coin. Now, in order to proceed, we must keep track of which side is heavy for each of the following weighings. Suppose that 5,6,7,8 is the heavy side. We now weigh 1,5,6 against 2,7,8. If they balance, then the different coin is either 3 or 4. Weigh 4 against 9, a known good coin. If they balance then the different coin is 3, otherwise it is 4. Now, if 1,5,6 vs 2,7,8 does not balance, and 2,7,8 is the heavy side, then either 7 or 8 is a different, heavy coin, or 1 is a different, light coin. For the third weighing, weigh 7 against 8. Whichever side is heavy is the different coin. If they balance, then 1 is the different coin. Should the weighing of 1,5, 6 vs 2,7,8 show 1,5,6 to be the heavy side, then either 5 or 6 is a different heavy coin or 2 is a light different coin. Weigh 5 against 6. The heavier one is the different coin. If they balance, then 2 is a different light coin.", "id": 2237}, {"Category": "Math Riddles", "Riddle": "An item is made from lead blanks in a lathe shop. Each blank suffices for 1 item. Lead shavings accumulated for making 6 items can be melted and made into a blank. How many items can be made from 36 blanks?", "_type": "dict", "Heading": "How Many Items?", "Answer": "From 36 blanks there are 36 items made. The lead shavings are enough to make 6 blanks. Which make 6 more items. But don't stop here. The new shavings are good for 1 more item. Total: 43.", "id": 2308}, {"Category": "Math Riddles", "Riddle": "Jenna wrote all the numbers from 300 to 400 on a piece of paper. How many times did she write the digit 3?", "_type": "dict", "Heading": "How Many Threes?", "Answer": "Jenna wrote it 120 times.", "id": 2309}, {"Category": "Math Riddles", "Riddle": "A car's odometer shows 72927 miles, a palindromic number. What are the minimum miles you would need to travel to form another?", "_type": "dict", "Heading": "A Palindromic Number Brain Teaser", "Answer": "110 miles. (73037)", "id": 2310}, {"Category": "Math Riddles", "Riddle": "What is 1/2 of 1/4 of 2/9 of 3/7 of 84?", "_type": "dict", "Heading": "What Is..", "Answer": "The answer is 1. 3/7 of 84 = 36 2/9 of 36 = 8 1/4 of 8 = 2 1/2 of 2 = 1", "id": 2311}, {"Category": "Math Riddles", "Riddle": "What number is that, which, added separately to 100 and 164, shall make them perfect squares?", "_type": "dict", "Heading": "Perfect Squares", "Answer": "125.", "id": 2312}, {"Category": "Math Riddles", "Riddle": "Two travellers spend from 12 o'clock to 6 o'clock walking along a level road, up a hill and back again. Their pace is 4 mph on the level, 3 mph uphill, and 6 mph downhill.\n\r\n\nHow far do they walk and at what time do they reach the top of the hill?", "_type": "dict", "Heading": "Travellers Riddle", "Answer": "24 miles half past three.", "id": 2313}, {"Category": "Math Riddles", "Riddle": "Jack has 8 bricks 7 of them weights the same amount and one is slightly heavier. Using a balance scale, how can Jack find the heavier brick in two weighings?", "_type": "dict", "Heading": "Odd Brick Out", "Answer": "First he split them in to piles of 3, 3, and 2 bricks. Then he weighs both groups of 3 with each other. If they balance he knows the brick is one of the 2 unweighed bricks and he can weigh them to find the heaver one. If the the stacks of 3 bricks do not balance, he will weigh 2 of the 3 bricks. If they balance he will know the brick left unweighed is heavier, or if they do not balance, he will find the heavier one.", "id": 2314}, {"Category": "Math Riddles", "Riddle": "Robert and David were preparing to have a water balloon fight. \"No Fair\" cried Robert, \"You have 3 times as many as I do!\" David said \"Fine!\" and gave Robert 10 more balloons. \"Still not fair!\" argued Robert, \"You still have twice as many as I do.\" How many more balloons must David give Robert for them to have the same number?", "_type": "dict", "Heading": "Water Balloons", "Answer": "David must give Robert another 20 water balloons, giving them each 60. Robert started with 30 water balloons and David with 90.", "id": 2315}, {"Category": "Math Riddles", "Riddle": "A man told his son that he would give him $1000 if he could accomplish the following task. The father gave his son ten envelopes and a thousand dollars, all in one dollar bills. He told his son, \"Place the money in the envelopes in such a manner that no matter what number of dollars I ask for, you can give me one or more of the envelopes, containing the exact amount I asked for without having to open any of the envelopes. If you can do this, you will keep the $1000.\" When the father asked for a sum of money, the son was able to give him envelopes containing the exact amount of money asked for. How did the son distribute the money among the ten envelopes?", "_type": "dict", "Heading": "1000 Bucks", "Answer": "The contents or the ten envelopes (in dollar bills) should be as follows: $1, 2, 4, 8, 16, 32, 64, 128, 256, 489. The first nine numbers are in geometrical progression, and their sum, deducted from 1,000, gives the contents of the tenth envelope.", "id": 2316}]