[{"Category":"Video Riddles","Video":"https//www.youtube.com/embed/ZXJvzjIcD5Y","Riddle":"In the early 1900's in England, there was two towns: town A and town B, and there was a huge river in between them. The only way across to each town was by a long bridge with a guard post in the middle. It took 20 minutes to cross the bridge from one side to the other and 10 minutes each way from the guards tower. There were no hiding spots on the bridge so people couldn't sneak past, and the guard comes out every 5 minutes or so to check to see if anyone is trying to cross. The guards tower was placed because of a law that stated that no one was aloud to leave their own town into the other because of political reasons and anyone who was caught by the guard would be fined and told to turn back. Many people have tried to cross but have always been caught, even very fast runners have only able to make it past the guards tower before being caught. But one night someone was able to make it across....\nHow did they do it?","_type":"dict","Heading":"Can You Solve The Bridge Crossing Riddle? ","Answer":"Did you get it? The answer is that they went up close to the guards tower, turned around and started walking back to the town they came from, the guard caught them and assumed that they came the other way and sent them back! \nHope you enjoyed this, please subscribe and check back soon for more riddles!"},{"Category":"Video Riddles","Video":"https//www.youtube.com/embed/N5vJSNXPEwA","Riddle":"You and nine other individuals have been captured by super intelligent alien overlords. The aliens think humans look quite tasty, but their civilization forbids eating highly logical and cooperative beings. Unfortunately, they're not sure whether you qualify, so they decide to give you all a test.  Through its universal translator, the alien guarding you tells you the following: You will be placed in a single-file line facing forward in size order so that each of you can see everyone lined up ahead of you. You will not be able to look behind you or step out of line. Each of you will have either a black or a white hat on your head assigned randomly, and I won't tell you how many of each color there are.\n\r\n\nWhen I say to begin, each of you must guess the color of your hat starting with the person in the back and moving up the line. And don't even try saying words other than black or white or signaling some other way, like intonation or volume; you'll all be eaten immediately. If at least nine of you guess correctly, you'll all be spared. You have five minutes to discuss and come up with a plan, and then I'll line you up, assign your hats, and we'll begin. Can you think of a strategy guaranteed to save everyone? Alex Gendler shows how.","_type":"dict","Heading":"Prisoner Hat Riddle - Alex Gendler ","Answer":"Let's see how it would play out if the hats were distributed like this. The tallest captive sees three black hats in front of him, so he says \"black,\" telling everyone else he sees an odd number of black hats. He gets his own hat color wrong, but that's okay since you're collectively allowed to have one wrong answer. Prisoner two also sees an odd number of black hats, so she knows hers is white, and answers correctly.  Prisoner three sees an even number of black hats, so he knows that his must be one of the black hats the first two prisoners saw. Prisoner four hears that and knows that she should be looking for an even number of black hats since one was behind her. But she only sees one, so she deduces that her hat is also black. Prisoners five through nine are each looking for an odd number of black hats, which they see, so they figure out that their hats are white. Now it all comes down to you at the front of the line. If the ninth prisoner saw an odd number of black hats, that can only mean one thing. You'll find that this strategy works for any possible arrangement of the hats. \nThe first prisoner has a 50% chance of giving a wrong answer about his own hat, but the parity information he conveys allows everyone else to guess theirs with absolute certainty. Each begins by expecting to see an odd or even number of hats of the specified color. If what they count doesn't match, that means their own hat is that color. And every time this happens, the next person in line will switch the parity they expect to see. So that's it, you're free to go. It looks like these aliens will have to go hungry, or find some less logical organisms to abduct."},{"Category":"Video Riddles","Video":"https//www.youtube.com/embed/98TQv5IAtY8","Riddle":"One hundred green-eyed logicians have been imprisoned on an island by a mad dictator. Their only hope for freedom lies in the answer to one famously difficult logic puzzle. Can you solve it? Alex Gendler walks us through this green-eyed riddle.","_type":"dict","Heading":"Green Eyed Logic Puzzle Video Riddle By Alex Gendler - TED-ed","Answer":"The answer to the riddle is in the video riddle above"},{"Category":"Video Riddles","Video":"https://www.youtube.com/embed/7yDmGnA8Hw0","Riddle":"Taking that internship in a remote mountain lab might not have been the best idea. Pulling that lever with the skull symbol just to see what it did probably wasn't so smart either. But now is not the time for regrets because you need to get away from these mutant zombies...fast. Can you use math to get you and your friends over the bridge before the zombies arrive? Alex Gendler shows how.","_type":"dict","Heading":"The Bridge Riddle By Alex Gendler - TED-ed","Answer":"At first it might seem like no matter what you do, you're just a minute or two short of time, but there is a way.  The key is to minimize the time wasted by the two slowest people by having them cross together.  And because you'll need to make a couple of return trips with the lantern, you'll want to have the fastest people available to do so.  So, you and the lab assistant quickly run across with the lantern, though you have to slow down a bit to match her pace.  After two minutes, both of you are across, and you, as the quickest, run back with the lantern.  Only three minutes have passed.  So far, so good.  Now comes the hard part.  The professor and the janitor take the lantern and cross together.  This takes them ten minutes since the janitor has to slow down for the old professor who keeps muttering that he probably shouldn't have given the zombies night vision.  By the time they're across, there are only four minutes left, and you're still stuck on the wrong side of the bridge.  But remember, the lab assistant has been waiting on the other side, and she's the second fastest of the group.  So she grabs the lantern from the professor and runs back across to you.  Now with only two minutes left, the two of you make the final crossing.  As you step on the far side of the gorge, you cut the ropes and collapse the bridge behind you, just in the nick of time."},{"Category":"Video Riddles","Video":"https//www.youtube.com/embed/1rDVz_Fb6HQ","Riddle":"Before he turned physics upside down, a young Albert Einstein supposedly showed off his genius by devising a complex riddle involving a stolen exotic fish and a long list of suspects. Can you resist tackling a brain teaser written by one of the smartest people in history? Dan Van der Vieren shows how.","_type":"dict","Heading":"Can You Solve \"Einstein's Riddle\"? - Dan Van Der Vieren","Answer":"The key is that the person at the back of the line who can see everyone else's hats can use the words \"black\" or \"white\" to communicate some coded information.  So what meaning can be assigned to those words that will allow everyone else to deduce their hat colors?  It can't be the total number of black or white hats.  There are more than two possible values, but what does have two possible values is that number's parity, that is whether it's odd or even.  So the solution is to agree that whoever goes first will, for example, say \"black\" if he sees an odd number of black hats and \"white\" if he sees an even number of black hats.  Let's see how it would play out if the hats were distributed like this.  The tallest captive sees three black hats in front of him, so he says \"black,\" telling everyone else he sees an odd number of black hats.  He gets his own hat color wrong, but that's okay since you're collectively allowed to have one wrong answer.  Prisoner two also sees an odd number of black hats, so she knows hers is white, and answers correctly.  Prisoner three sees an even number of black hats, so he knows that his must be one of the black hats the first two prisoners saw.  Prisoner four hears that and knows that she should be looking for an even number of black hats since one was behind her.  But she only sees one, so she deduces that her hat is also black.  Prisoners five through nine are each looking for an odd number of black hats, which they see, so they figure out that their hats are white.  Now it all comes down to you at the front of the line.  If the ninth prisoner saw an odd number of black hats, that can only mean one thing.  You'll find that this strategy works for any possible arrangement of the hats.  The first prisoner has a 50% chance of giving a wrong answer about his own hat, but the parity information he conveys allows everyone else to guess theirs with absolute certainty.  Each begins by expecting to see an odd or even number of hats of the specified color.  If what they count doesn't match, that means their own hat is that color.  And every time this happens, the next person in line will switch the parity they expect to see."},{"Category":"Video Riddles","Video":"https//www.youtube.com/embed/cpwSGsb-rTs","Riddle":"You're stranded in a rainforest, and you've eaten a poisonous mushroom. To save your life, you need an antidote excreted by a certain species of frog. Unfortunately, only the female frog produces the antidote. The male and female look identical, but the male frog has a distinctive croak. Derek Abbott shows how to use conditional probability to make sure you lick the right frog and get out alive.","_type":"dict","Heading":"Frog Video Riddle","Answer":"If you chose to go to the clearing, you're right, but the hard part is correctly calculating your odds.  \nThere are two common incorrect ways of solving this problem.  Wrong answer number one:  Assuming there's a roughly equal number of males and females, the probability of any one frog being either sex is one in two, which is 0.5, or 50%.  And since all frogs are independent of each other, the chance of any one of them being female should still be 50% each time you choose.  This logic actually is correct for the tree stump, but not for the clearing.  \nWrong answer two:  First, you saw two frogs in the clearing.  Now you've learned that at least one of them is male, but what are the chances that both are?  If the probability of each individual frog being male is 0.5, then multiplying the two together will give you 0.25, which is one in four, or 25%.  So, you have a 75% chance of getting at least one female and receiving the antidote.  \nSo here's the right answer.  Going for the clearing gives you a two in three chance of survival, or about 67%.  If you're wondering how this could possibly be right, it's because of something called conditional probability.  Let's see how it unfolds.  When we first see the two frogs, there are several possible combinations of male and female. If we write out the full list, we have what mathematicians call the sample space, and as we can see, out of the four possible combinations, only one has two males.  So why was the answer of 75% wrong?  Because the croak gives us additional information.  As soon as we know that one of the frogs is male, that tells us there can't be a pair of females, which means we can eliminate that possibility from the sample space, leaving us with three possible combinations.  Of them, one still has two males, giving us our two in three, or 67% chance of getting a female.  This is how conditional probability works.  You start off with a large sample space that includes every possibility.  But every additional piece of information allows you to eliminate possibilities, shrinking the sample space and increasing the probability of getting a particular combination.  The point is that information affects probability.  And conditional probability isn't just the stuff of abstract mathematical games. It pops up in the real world, as well.  \nComputers and other devices use conditional probability to detect likely errors in the strings of 1's and 0's that all our data consists of.  And in many of our own life decisions, we use information gained from past experience and our surroundings to narrow down our choices to the best options so that maybe next time, we can avoid eating that poisonous mushroom in the first place."}]