[{"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who is that with a neck and no head, two arms and no hands?  What is it?", "_type": "dict", "Heading": "No Hands", "Answer": "A shirt.", "id": 11}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who is never hungry during Christmas?", "_type": "dict", "Heading": "Hungry Turkey", "Answer": "The turkey because he is always stuffed.", "id": 12}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who always enjoys poor health?", "_type": "dict", "Heading": "Enjoys Poor Health", "Answer": "A doctor.", "id": 13}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "A beggar's brother died, but the man who died had no brother.\n\r\n\nHow could that be?", "_type": "dict", "Heading": "The Beggar", "Answer": "The beggar was his sister!", "id": 14}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "A father and son were in a car accident where the father was killed. The ambulance brought the son to the hospital. He needed immediate surgery. In the operating room, a doctor came in and looked at the little boy and said I can't operate on him he is my son.\n\r\n\nWho is the doctor?", "_type": "dict", "Heading": "The Doctor And The Son", "Answer": "The Mother", "id": 15}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Mr. Steve lives in a mansion. He is very rich. He's so rich that he has a maid, a cook, a butler, and a lifeguard. Yesterday, Mr. Steve was found dead. The chief detective was coming from Sunday church to investigate. The police were already there. They caught 6 suspects. The maid, the butler, the cook, the lifeguard, the postman, and Mrs. Steve. The maid said she was dusting. The butler said he was playing a board game with Mr. Steve's sons. The cook said he was making dinner. The lifeguard said he was watching Mr. Steve's daughter swim in the pool. The postman said he was delivering mail. Mrs. Steve said she was watching TV. Who is lying? You only have one chance because if you choose incorrectly, you accuse the wrong person and the true killer gets away.", "_type": "dict", "Heading": "Mr. Steve's Investigation", "Answer": "The postman was lying. If the chief detective was coming from church, then you know that the post office doesn't deliver mail on Sunday.", "id": 16}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who was the the most famous Skeleton detective?", "_type": "dict", "Heading": "Skeleton Detective", "Answer": "Sherlock Bones.", "id": 17}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who can shave three times a day and still grow a beard?", "_type": "dict", "Heading": "Still Grow A Beard Mind Trick", "Answer": "A barber, He could shave other men three times a day and still grow his own beard.", "id": 18}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "A guy was waiting at home, he swung a metal pole then took 3 left turns and on his way back home there was a masked man waiting for him. What is he doing and who is the masked man?", "_type": "dict", "Heading": "3 Left Turns", "Answer": "He is playing baseball and the masked man is the Catcher.", "id": 19}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Ray Whitcombe is found dead in his office at his desk. The police have narrowed the suspects down to three people: Mrs. Barbara Whitcombe, Ray's wife; Mr. Jason McCubbins, Ray's business partner; and Mr. Harold Nichols, Ray's best friend. All three visited Mr. Whitcombe the day of his murder, but all three provide the police with stories of explanation as to the reason for their visit. Police found Mr. Whitcombe with his wrist watch still on his right arm, a torn up picture of his wife laying on the floor beside the trash can, and an ink pen in his right hand. On the desk, the police found a name plate, a telephone that was off the hook, and a personal calendar turned to the July 5th page with 7B91011 written on it. After examining this evidence, the police knew their suspect. Who was it?", "_type": "dict", "Heading": "Who Murdered Ray?", "Answer": "Jason McCubbins, Ray's business partner. The calendar is the clue to solving this murder. The police realized that since Mr. Whitcombe was wearing his watch on his right arm, he must be left handed. But the pen was found in his right hand. Realizing that the number on the calendar was written in a hurry and with his opposite hand, police matched the written number with the months of the year. So the B was an 8, thereby giving us 7-8-9-10-11: July, August, September, October, November. Use the first letter of each month and it spells J-A-S-O-N.", "id": 20}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "He has married many women, but has never been married. Who is he?", "_type": "dict", "Heading": "Marriage Not For Me", "Answer": "A preacher.", "id": 177}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "A man was found dead out in a field of snow. The only tracks that were left was a set of footprints between two parallel lines. Who should the police be looking for?", "_type": "dict", "Heading": "Set Of Footprints", "Answer": "A man in a wheelchair.", "id": 178}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Hands she has but does not hold, teeth she has but does not bite, feet she has but they are cold, eyes she has but without sight. Who is she?", "_type": "dict", "Heading": "Without Life", "Answer": "A Doll.", "id": 179}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "A very famous chemist was found murdered in his kitchen today. The police have narrowed it down to six suspects. They know it was a two man job. Their names: Felice, Maxwell, Archibald, Nicolas, Jordan, and Xavier. A note was also found with the body: '26-3-58/28-27-57-16'. Who are the killers?", "_type": "dict", "Heading": "Chemistry", "Answer": "Felice and Nicholas are the murderers. The numbers correspond to atomic numbers on the periodic table of elements: 'Fe-Li-Ce/Ni-Co-La-S'.", "id": 180}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who is braver, a stone or a tree?", "_type": "dict", "Heading": "A Stone Or A Tree", "Answer": "The stone, because it's a little boulder.", "id": 181}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who is it that rows quickly with four oars but never comes out from under his own roof?", "_type": "dict", "Heading": "Shy Little Guy", "Answer": "A Turtle.", "id": 182}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who is the boss in the dairy factory?", "_type": "dict", "Heading": "Dairy Factory ", "Answer": "The big cheese.", "id": 183}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "What kin is that child to it's father who is not it's father's own son?", "_type": "dict", "Heading": "Father And Child Riddle", "Answer": "His daughter.", "id": 184}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Brothers and sisters have I none, But that man's father is my father's son. Who is \"that man\"?", "_type": "dict", "Heading": "Who Is \"that Man\"?", "Answer": "The son of the speaker.", "id": 185}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "Who is the strange one who lives in the sea, he has eight arms but no legs. Who is it?", "_type": "dict", "Heading": "Kids Riddles O", "Answer": "An Octopus.", "id": 186}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "A masked man is being hunted by the authorities for his vigilante activities, in which he helps and protects innocent people. His modus operandi is to seek out injustices caused by corrupt and evil people, stop these people from completing their wicked plans, and to deliver his own personal letter to these villains --- something to remind them of his visit. Who is this masked man, and what is the personal letter he delivers?", "_type": "dict", "Heading": "The Man In The Mask", "Answer": "The masked man is Zorro, and the personal letter he delivers to the villains he thwarts ----- is the letter \"Z\".", "id": 437}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "There are eight people who like each other? Rhonda likes Jim. Tom likes Amber. Cameron likes Britney. Will likes Katie. They all know that they're liked by at least someone. The question is, who is loved? *Hint think about the *words in this statement...", "_type": "dict", "Heading": "Who Likes Who?", "Answer": "No one is loved, they're just liked.", "id": 438}, {"Category": "Who Is It Riddles, Who Is It", "Riddle": "A man while looking at a photograph said, \"Brothers and sisters have I none. That man's father is my father's son.\" Who was the person in the photograph?", "_type": "dict", "Heading": "Brothers And Sisters I Have None...", "Answer": "That man's son.", "id": 439}]